{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:000", "title": "46a2bb5d", "text": "Review paper Advancement of artiﬁcial intelligence based treatment strategy in type 2 diabetes: A critical update Aniruddha Sena, Palani Selvam Mohanrajb, Vijaya Laxmib, Sumel Ashiquec, d, **, Rajalakshimi Vasudevane, Afaf Aldahishe, Anupriya Veluf, Arani Dasg, Iman Ehsanh, Anas Islami, Sabina Yasminj, Mohammad Yousuf Ansarik, * a Department of Biochemistry, All India Institute of Medical Sciences, Gorakhpur, 273008, India b Department of Pharmacology, All India Institute of Medical Sciences, Gorakhpur, 273008, India c Department of Pharmaceutical Technology, Bharat Technology, Uluberia, 711316, India d School of Pharmaceutical Sciences, Lovely Professional University, Phagwara, 144411, India e Department of Pharmacology and Toxicology, College of Pharmacy, King Khalid University, Abha, 62529, Saudi Arabia f Department of Biochemistry, Mahayogi Gorakhnath University, Gorakhpur, 273008, India g Department of Physiology, All India Institute of Medical Sciences, Gorakhpur, 273008, India h National Institute of Pharmaceutical Education and Research, Kolkata, 700054, India i Faculty of Pharmacy, Integral University, Lucknow, 226026, India j Department of Pharmaceutical Chemistry, College of Pharmacy, King Khalid University, Abha, 62529, Saudi Arabia k Ibne Seena College of Pharmacy, Azmi Vidya Nagri Anjhi Shahabad, Hardoi, 241124, India article info Article history: Received 29 August 2024 Received in revised form 5 March 2025 Accepted 4 April 2025 Available online 10 April 2025 Keywords: Type 2 diabetes mellitus Therapeutics Artiﬁcial intelligence Personalized therapy abstract In the unrelenting race to strive to dominate type 2 diabetes mellitus (T2DM) care better, this review paper sets out on a signiﬁcant discovery trip across recent advancements in treatment and the blooming era of artiﬁcial intelligence (AI) utilities. Given the considerable global burden of T2DM, innovative therapeutic approaches to improve patient outcomes remain a public health priority. This reviewﬁrst provides an in-depth analysis of the current state of therapy, from novel pharmacotherapy to lifestyle interventions and new treatment methods. At the same time, the rapidly increasing role of AI in diabetes care is woven into the story, mainly targeting how insulin therapy can be modiﬁed and personalized through algorithms and predictive modelling. It leaves a deep review of their pre-existing synergies, which helps understand how collaborative opportunities will unlock the future of T2DM care. This critical role is shown by integrating recent therapeutic advances and AI with overall showcasing better screening, diagnosis, and therapeutics decision-making to outcome prediction in T2DM. The review emphasizes how AI applications in insulin therapy have transformative potential in diabetes care. These person-centred approaches to T2DM management, which are more effective and personalized than some traditional strategies, only work because of the often-hidden synergies between AI algorithms in areas such as diagnostic criteria, predictive methods, and familiar classiﬁcation tools for subgroups with relevant aspects/predictors on prognosis or treatment responsiveness. © 2025 The Author(s). Published by Elsevier B.V. on behalf of Xi’an Jiaotong University. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). 1. Introduction Type 2 diabetes mellitus (T2DM) is a progressive disease with a growing prevalence, posing a signiﬁcant global health challenge. This condition is associated with an increased risk of complications and profoundly impacts individuals,"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:001", "title": "46a2bb5d", "text": "Xi’an Jiaotong University. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). 1. Introduction Type 2 diabetes mellitus (T2DM) is a progressive disease with a growing prevalence, posing a signiﬁcant global health challenge. This condition is associated with an increased risk of complications and profoundly impacts individuals, societies, and healthcare sys- tems. The introduction of new classes of antidiabetic drugs has dramatically changed the landscape of diabetes therapy, yet man- aging the burden of the disease remains a challenge. Effective management strategies for T2DM include both pharmacological and non-pharmacological interventions. Lifestyle modi ﬁcations, including losing weight, undergoing metabolic surgery, and adopting aggressive treatments to lower blood sugar levels, have demonstrated effectiveness in initiating diabetes remission. However, the enduring impact of these approaches on the Peer review under responsibility of Xi'an Jiaotong University. * Corresponding author. ** Corresponding author. Department of Pharmaceutical Technology, Bharat Technology, Uluberia, 711316, India. E-mail addresses: ashiquesumel007@gmail.com (S. Ashique), yousufniper@ gmail.com (M.Y. Ansari). Contents lists available atScienceDirect Journal of Pharmaceutical Analysis journal homepage: www.elsevier.com/locate/jpa https://doi.org/10.1016/j.jpha.2025.101305 2095-1779/© 2025 The Author(s). Published by Elsevier B.V. on behalf of Xi’an Jiaotong University. This is an open access article under the CC BY-NC-ND license (http:// creativecommons.org/licenses/by-nc-nd/4.0/). Journal of Pharmaceutical Analysis 15 (2025) 101305 long-term complications associated with diabetes is still uncertain [1]. Obesity and T2DM are major public health concerns, often linked with adiposopathy, which describes the pathophysiological changes in adipose tissue. This dysfunctional state of adipose tissue is a signiﬁcant factor in the aetiology of these conditions, promot- ing chronic inﬂammation, dysregulated glucose homeostasis, and insulin resistance. Currently, the most successful strategies for achieving signiﬁcant weight loss and consequent diabetes remis- sion are metabolic surgery and innovative categories of antidiabetic drugs [2]. A comprehensive lifestyle clinic study demonstrated the impact of non-pharmacological interventions on metabolic health and remission of these conditions, highlighting the importance of personalized physical exercise and nutritional counselling [3]. The integration of recent therapeutic advances and artiﬁcial intelli- gence (AI) is now used for diagnosis, therapeutic decision-making, and outcome prediction in T2DM. AI applications in T2DM care primarily focus on screening and diagnosis in different stages, with machine learning (ML) methods being the most commonly applied techniques. These methods, including support vector machine and naive Bayesian, have shown promise in improving diabetes-related outcomes classiﬁcation [4]. The development of AI-driven clinical decision support systems (CDSS) integrated with electronic health records (EHR) represents a signiﬁcant step forward. These plat- forms assist healthcare providers and individuals in examining pertinent patient data, establishing therapeutic objectives, and considering different treatment options based on forecasts, thus enhancing the support for pharmacological decision-making in T2DM [5]. The importance of precise and personalized manage- ment strategies in T2DM care can not be overstated, given the impact of individual characteristics and lifestyle on treatment plans and patient outcomes. AI offers great promise in combining pat- terns from various data sources with healthcare professionals' expertise to achieve optimal care. Studies have shown that AI- generated individualized feedback can lead to improved health behaviours and"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:002", "title": "46a2bb5d", "text": "overstated, given the impact of individual characteristics and lifestyle on treatment plans and patient outcomes. AI offers great promise in combining pat- terns from various data sources with healthcare professionals' expertise to achieve optimal care. Studies have shown that AI- generated individualized feedback can lead to improved health behaviours and better management of T2DM [6]( Figs. 1A and B). Furthermore, AI interpretation and graph neural networks (GNN) are being used to explore risk factors for complications associated with T2DM, such as cognitive impairment, and to screen potential therapeutic drugs. This approach not only aids in under- standing the underlying mechanisms of T2DM complications but also assists in discovering effective treatments [7]. This review aims to provide insights into more effective, personalized, and patient- centric management approaches for T2DM by examining how AI can complement and enhance traditional therapeutic strategies. Hence, the objective of this review is dual:ﬁrstly, to present a comprehensive overview of the existing treatment alternatives for T2DM, and secondly, to examine the burgeoning intersection of these therapies with AI. By merging these two aspects, we aim to shed light on the prospective collaborative dynamics that may arise between them. This review is structured to provide a comprehen- sive understanding of the evolving landscape of T2DM manage- ment. The initial sections explore traditional approaches, including pharmacotherapy and lifestyle interventions, emphasising their role in managing the disease's complexity. Subsequently, the re- view discusses how AI has emerged as a transformative force in diabetes care, offering innovations in predictive analytics, decision- making support, and personalized treatment strategies. Theﬁnal sections delve into the synergies between these advancements, highlighting the integration of AI with modern therapeutics to create patient-centred and outcome-driven management frame- works. By bridging conventional methods with cutting-edge tech- nology, this review aims to provide insights into the future trajectory of T2DM care. Recent advances like regulation-aware graph learning have demonstrated the potential of leveraging heterogeneous biological networks and connectivity patterns for effective drug repositioning, achieving superior performance in predicting drug-disease associations [ 8]. Graph representation learning models, such as FuHLDR, have introduced innovative ap- proaches by integrating higher and lower-order biological infor- mation, demonstrating enhanced effectiveness in drug repositioning compared to state-of-the-art models [9]. Network- based computational approaches like large-scale graph drug- target interactions (LGDTI), which integrate local and global rep- resentations of drugs and proteins, have shown remarkable accu- racy in predicting drug-target interactions by leveraging heterogeneous information networks [ 10]. The fasting plasma glucose (FPG) test requires fasting for at least 8 h and needs conﬁrmation with a second test on a different day if the result is abnormal (/C21126 mg/dL or/C217.0 mmol/L) [11]. Oral glucose tolerance test (OGTT) with a 75 g glucose load is conducted following World Health Organization (WHO) guidelines. Diagnosis is con ﬁrmed with a second test on a different day, where a 2-h plasma glucose (PG) level of/C21200 mg/dL (/C2111.1 mmol/L) during the OGTT indicates diabetes [12]. The diagnosis is based on a single haemoglobin A1c (HbA1C) test using the National Glycohemoglobin Standardization"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:003", "title": "46a2bb5d", "text": "World Health Organization (WHO) guidelines. Diagnosis is con ﬁrmed with a second test on a different day, where a 2-h plasma glucose (PG) level of/C21200 mg/dL (/C2111.1 mmol/L) during the OGTT indicates diabetes [12]. The diagnosis is based on a single haemoglobin A1c (HbA1C) test using the National Glycohemoglobin Standardization Program (NGSP)-certiﬁed and Diabetes Control and Complications Trial (DCCT) standardized laboratory method, with an HbA1C level of /C216.5% (/C2148 mmol/mol) [13]. The current diagnostic standards for T2DM are summarised inTable 1[11e13]. 2. Therapeutic modalities for T2DM 2.1. Pharmacotherapy The treatment of T2DM involves a variety of medications that target different aspects of the disease's underlying mechanisms. 2.1.1. Oral antidiabetic agents Oral antidiabetic agents, commonly called oral hypoglycemic agents or oral hypoglycemics, function through various mecha- nisms to regulate blood sugar levels, aiming to improve insulin sensitivity, enhance insulin secretion, or reduce glucose absorption from the digestive tract. The development and utilization of oral antidiabetic agents have evolved signi ﬁcantly over the years, reﬂecting advancements in our understanding of diabetes patho- physiology and the quest for more effective and patient-friendly treatment options. As an integral component of diabetes manage- ment, oral antidiabetic agents are often prescribed based on indi- vidual needs, considering factors such as the type and severity of diabetes, overall health, and any coexisting medical conditions. The diverse classes of oral antidiabetic agents include biguanides, sul- fonylureas, meglitinides, thiazolidinediones (TZDs), dipeptidyl peptidase-4 (DPP-4) inhibitors, sodium-glucose co-transporter-2 (SGLT2) inhibitors, and alpha-glucosidase inhibitors [14,15]. 2.1.2. Biguanides Without contraindications, metformin is regarded as theﬁrst- line medication for treating T2DM. Metformin appears to reduce blood and liver levels of lipopolysaccharide (LPS), reduction of LPS and mechanism of action of metformin [16e18]. Metformin acti- vates adenosine monophosphate (AMP)-activated protein kinase (AMPK) in liver cells, leading to the activation of AMPK in hepa- tocytes [19]. It also suppresses adenyl cyclase, which inhibits glucagon-induced cyclic AMP (cAMP) generation, demonstrating its mechanism of action through the suppression of adenyl cyclase [20 ]. Activation of hepatic AMPK leads to the activation of liver- kinase B1 (LKB1), which describes the mechanism of action by which AMPK activates LKB1 [21,22]. At high doses, metformin in- hibits complex I of the mitochondrial electron transport chain, which lowers adenosine triphosphate (ATP) levels and increases A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 2 the AMP/ATP ratio. This mechanism of action involves inhibition of complex I in the mitochondria [23]. Inhibition of mitochondrial glycerol phosphate dehydrogenase (mG3PDH) disrupts gluconeo- genesis from lactate [ 24]. Metformin's component, LKB1, may activate AMPK and contribute to the inhibition of cell growth by activating the tumor suppressor protein LKB1 [25]. Observational research indicates that metformin may reduce the risk of devel- oping cancer by mechanisms that lower cancer risk [26]. Its diverse mechanisms of action and associated effects are listed inTable 2 [16e26]. 2.1.3. Blockers of alpha-glucosidase Acarbose, miglitol, and voglibose are the currently approved drugs in this class. Inhibition of alpha-glucosidase in the small in- testine's brush border membrane"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:004", "title": "46a2bb5d", "text": "devel- oping cancer by mechanisms that lower cancer risk [26]. Its diverse mechanisms of action and associated effects are listed inTable 2 [16e26]. 2.1.3. Blockers of alpha-glucosidase Acarbose, miglitol, and voglibose are the currently approved drugs in this class. Inhibition of alpha-glucosidase in the small in- testine's brush border membrane results in decreased absorption of carbohydrates as the conversion of complex non-absorbable oli- gosaccharides into simple absorbable monosaccharides is blocked by alpha-glucosidase inhibitors [27]. Because alpha-glucosidase inhibitors might cause asymptomatic elevations in liver enzymes and are not advised for individuals with creatinine clearance below 25 mL/min, it is vital to manage liver enzyme levels [28]. Fig. 1.A comparative schematic representation of two methods. (A) Artiﬁcial intelligence (AI)-assisted personalized treatment for type 2 diabetes mellitus (T2DM), showcasing how AI integrates with different treatment modalities to enhance patient-speciﬁc outcomes. (B) Traditional method for the treatment of T2DM. Table 1 Chart summarising the current diagnostic standards for type 2 diabetes mellitus (T2DM). Diagnostic criteria Result threshold Test conditions Refs. FPG /C21126 mg/dL (/C217.0 mmol/L) Fasting for at least 8 h and requires con ﬁrmation with a second test on a different day if abnormal [11] Random PG /C21200 mg/dL (/C2111.1 mmol/L) Classic symptoms of hyperglycemia or hyperglycaemic crisis, and requires conﬁrmation with a second test [11] 2-h PG /C21200 mg/dL (/C2111.1 mmol/L) during OGTT OGTT with 75 g glucose load, as per WHO guidelines, and diagnosis conﬁrmed with a second test on a different day [12] HbA1C /C216.5% (/C2148 mmol/mol) NGSP-certi ﬁed and DCCT standardised laboratory method, and diagnosis is based on a single A1C test [13] FPG: fasting plasma glucose; PG: plasma glucose; OGTT: oral glucose tolerance test; WHO: World Health Organisation; HbA1C: haemoglobin A1C; NGSP: National Glyco- hemoglobin Standardization Program; DCCT: Diabetes Control and Complications Trial. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 3 2.1.4. DPP-4 inhibitors Different dipeptidyl peptidase inhibitors (iDPPs) are sitagliptin, vildagliptin, saxagliptin, linagliptin, and alogliptin. Incretins are a group of gastrointestinal hormones that play a crucial role in regulating glucose metabolism. The two main incretin hormones are glucagon-like peptide-1 (GLP-1) and glucose-dependent insu- linotropic polypeptide (GIP). These hormones are released from the gut in response to food intake and act on pancreatic beta cells to stimulate insulin secretion in a glucose-dependent manner. Addi- tionally, incretins suppress glucagon secretion from pancreatic alpha cells, delay gastric emptying, and promote satiety [29]. The mechanism of action of DPP-4 inhibitors involves inhibiting the enzyme DPP-4, which results in increased levels of GLP-1 and GIP. This leads to enhanced glucose-dependent insulin secretion, sup- pression of glucagon secretion, slowed gastric emptying, and improved glycemic control. Due to the minimal risk of hypoglyce- mia and other adverse effects, these drugs are considered as being relatively safe. When using insulin and sulfonylureas together, each of them has an increased risk of hypoglycemia [30]. 2.1.5. The insulin secretagogues-sulfonylureas and meglitinides Although they belong to separate groups of oral hypoglycemic medications, sulfonylureas and insulin secretagogues (meglitinides or glinides) promote"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:005", "title": "46a2bb5d", "text": "adverse effects, these drugs are considered as being relatively safe. When using insulin and sulfonylureas together, each of them has an increased risk of hypoglycemia [30]. 2.1.5. The insulin secretagogues-sulfonylureas and meglitinides Although they belong to separate groups of oral hypoglycemic medications, sulfonylureas and insulin secretagogues (meglitinides or glinides) promote insulin release from the pancreatic beta cells. Since they were initially made available for use in clinical settings in the 1950s, sulfonylureas have been the de factoﬁrst- or second- line therapy for people with T2DM [31,32]. Although sulfonylureas and glinides bind to the receptor at different sites, they both cause channel closure and cell depolarization, which raises cytoplasmic calcium levels and, as a result, causes the release of insulin. Second- generation sulfonylureas include glimepiride, glipizide, gliclazide, and glyburide [16]. Meglitinides are advantageous for those for whom the objective of avoiding hypoglycaemic episodes is crucial since they typically have a lower risk of hypoglycaemia [ 33]. Repaglinide and nateglinide are two distinct glinides. The phenyl- alanine derivative nateglinide differs structurally from sulfonyl- ureas and meglitinide. Sulfonylureas considerably inﬂuence FPG concentrations due to their pharmacokinetics, while meglitinides mainly affect postprandial glucose levels [34]. Sulfonylureas are likely to reduce HbA1C by 1.0%e1.5%, although meglitinides are often less efﬁcient in lowering blood sugar (0.5%e1.0%) [16,22]. Hypoglycemia is the most frequent side effect, particularly with long-acting sulfonylureas (such as glyburide/glimepiride) [35e37]. 2.1.6. Sodium-glucose co-transporter-2 (SGLT2) inhibitor In individuals with T2DM, SGLT2 inhibitors renal glucose reab- sorption and increases glucose excretion. It works independently of insulin, carries no risk of hypoglycemia, and does not induce fatigue or excessive stimulation of beta cells [38]. Because its method of action depends on proper glomerular-tubular function, individuals with renal insufﬁciency have decreased SGLT2 efﬁciency [39]. The three medications that best typify the SGLT2 drug family are empagliﬂozin, dapagli ﬂozin and canagli ﬂozin [40]. They have proven effective in improving glycemic control and lowering body weight in patients with T2DM [41]. If these medications may also reduce the dosage of insulin, weight loss will be higher. Patients experience more weight loss more quickly [42]. The impact of these medications on the lipid proﬁle is unclear. All of the SGLT2 do not provide the same outcomes. Some studies found them to be lipid- friendly and lipid-neutral in others [43,44]. Finally, since SGLT2 is linked to glomerular hyper-ﬁltration, blocking it may have neph- roprotective effects [45]. SGLT2 inhibitors have demonstrated sig- niﬁcant cardiovascular protective effects by reducing major adverse cardiovascular events, improving heart function, lowering heart failure risk, and promoting renal health. These beneﬁts extend to individuals both with and without diabetes, suggesting their po- tential to prevent heart-related complications and improve overall cardiac outcomes [46]. 2.1.7. TZDs Pioglitazone and rosiglitazone are the two TZDs that are mar- keted in the United States. Because the overall hazards of rosigli- tazone outweigh the beneﬁts, the European Medicines Agency has prohibited its use in Europe since 2010 [47]. The mechanism of action of TZDs involves activating peroxisome proliferator- activated receptor gamma (PPARg), a nuclear"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:006", "title": "46a2bb5d", "text": "the two TZDs that are mar- keted in the United States. Because the overall hazards of rosigli- tazone outweigh the beneﬁts, the European Medicines Agency has prohibited its use in Europe since 2010 [47]. The mechanism of action of TZDs involves activating peroxisome proliferator- activated receptor gamma (PPARg), a nuclear receptor primarily found in adipose tissue but also present in other tissues such as the liver, muscle, and pancreas. Activation of PPARg leads to increased insulin sensitivity in peripheral tissues, such as muscle and adipose tissue. These results in improved glucose uptake and utilization by cells, decreased hepatic glucose production, and reduced circu- lating levels of free fatty acids [48]. TZDs also affect adipocyte dif- ferentiation and adipokine secretion, which can contribute to their metabolic effects [49]. The activation of PPARg in the central nervous system, pro- moting heightened appetite, contributes to the weight gain asso- ciated with TZD [50]. Because PPARg is more common in the collecting tubules of the nephron, TZD treatment-induced PPARg activation results in salt absorption in those cells, causing retention of ﬂuid that may cause or aggravate heart failure [51]. 2.2. Injectable antidiabetic agents Injectable antidiabetic agents constitute a crucial category of medications employed in treating and managing diabetes mellitus. Injectable antidiabetic agents are primarily utilized in cases where oral medications may be insufﬁcient in achieving glycemic control, particularly in individuals with more advanced stages of diabetes or Table 2 Possible mechanisms of action for metformin. Mechanism of action of metformin Description Refs. Reduction of LPS Metformin appears to reduce blood and liver levels of LPS [ 16e18] Activation of AMPK in hepatocytes Metformin activates AMPK in liver cells [ 19] Suppression of adenyl cyclase Metformin suppresses adenyl cyclase, preventing glucagon-induced cAMP generation [ 20] Activation of LKB1 by AMPK Hepatic AMPK activation leads to the activation of LKB1 [ 21,22] Inhibition of complex I in mitochondria At high doses, metformin inhibits complex I of the electron transport chain in mitochondria, lowering ATP levels and increasing AMP/ATP ratio [23] Inhibition of mG3PDH Inhibition of mG3PDH interrupts gluconeogenesis from lactate [ 24] Activation of tumor suppressor protein LKB1 Metformin's component LKB1 may activate AMPK and contribute to inhibiting cell growth [25] Reduction of cancer risk Observational research suggests metformin may lower the risk of developing cancer [ 26] LPS: lipopolysaccharide; AMPK: adenosine monophosphate (AMP)-activated protein kinase; cAMP: cyclic AMP; LKB1: liver-kinase B1; ATP: adenosinetriphosphate; mG3PDH: mitochondrial glycerol phosphate dehydrogenase. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 4 those who require additional therapeutic interventions [52]. The injectable antidiabetic agents include various classes of medica- tions, each with distinct mechanisms of action targeting different aspects of glucose metabolism. The most common types include insulin and GLP-1 receptor agonists (GLP-1 RAs). Insulin, a hormone produced by the pancreas, is vital for glucose utilization, and injectable insulin is often prescribed when the body's natural in- sulin production is inadequate [53]. GLP-1 RAs mimic the action of a naturally occurring hormone, GLP-1, which"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:007", "title": "46a2bb5d", "text": "common types include insulin and GLP-1 receptor agonists (GLP-1 RAs). Insulin, a hormone produced by the pancreas, is vital for glucose utilization, and injectable insulin is often prescribed when the body's natural in- sulin production is inadequate [53]. GLP-1 RAs mimic the action of a naturally occurring hormone, GLP-1, which stimulates insulin secretion and inhibits glucagon release. By enhancing insulin ac- tivity and suppressing the release of glucose from the liver, GLP-1 RAs contribute to improved glycemic control [54]. Injectable anti- diabetic agents are an essential component of diabetes manage- ment, offering ﬂexibility and precision in addressing the diverse needs of individuals with diabetes when a more rapid and direct impact on blood glucose levels is required. The selection of inject- able antidiabetic agents is based on factors such as the type of diabetes and individual patient characteristics [30]. 2.2.1. Insulin Pre-meal coverage with traditional insulin has a quicker onset and a shorter half-life than long-acting analogues, which allow a once-daily dose. It also shows less daily variation [55]. In addition to long-acting insulins like glargine and detemir, ultra-long-acting insulins like degludec and glargine U-300 and rapid-acting insulins like aspart, lispro or glulisine may be used together. Human insulin and insulin glargine are equivalent, except for the two extra argi- nine molecules added to the B-chain and the substitution of glycine for asparagine at position A21 [56]. With a half-life of over 25 h and an action of over 42 h, the insulin degludec proﬁle is ﬂatter than other long-acting insulins (glargine and detemir), reducing acute and overnight hypoglycemias [57]. Compared to glargine, insulin degludec demonstrates non-inferiority in lowering HbA1C and a reduced risk of nocturnal hypoglycaemia [58]. 2.2.2. RA-GLP1 After eating, the body secretes the hormone GLP-1, which stimulates insulin release to regulate blood sugar levels. GLP-1 and glucose-dependent insulinotropic polypeptide (GIP), produced by enteroendocrine L-cells in different parts of the digestive tract, play key roles in this process. In T2DM, GLP-1 treatments enhance glucose-dependent insulin secretion, reducing the risk of hypo- glycemia. These treatments also lower glucagon levels, slow gastric emptying to moderate postprandial blood sugar spikes, and in- crease satiety, aiding in weight management and overall blood glucose control [54]. RA-GLP1 are categorized as short-acting or long-acting, depending on how long they persist. Short-acting RA- GLP1 medications include lixisenatide and twice-daily exenatide. Lixisenatide has a considerably longer half-life (2.7e4.3 h) than native GLP1. Additionally, lixisenatide has been used with basal insulin treatment [59,60]. Exenatide long-acting release (LAR) is more effective than the maximum dosage of twice-daily exenatide, sitagliptin, pioglitazone, and insulin glargine in T2DM patients using oral hypoglycemic medications [61e64]. 3. Recent therapeutic advances in T2DM management The landscape of T2DM management is undergoing a trans- formative era, marked by signiﬁcant advancements that span a broad spectrum of therapeutic approaches [65]. Recent efforts in this ﬁeld focus on the potential for disease remission, the inno- vation and development of new medications, and comprehensive management strategies. These advancements aim to enhance the quality of life for individuals with"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:008", "title": "46a2bb5d", "text": "era, marked by signiﬁcant advancements that span a broad spectrum of therapeutic approaches [65]. Recent efforts in this ﬁeld focus on the potential for disease remission, the inno- vation and development of new medications, and comprehensive management strategies. These advancements aim to enhance the quality of life for individuals with T2DM by providing more effective glycemic control, reducing complications, and inte- grating patient-centric care models. The following sections will delve into the latest developments, including promising drugs currently in clinical trials, and explore how these innovations reshape the future of T2DM treatment [ 66]. Clinical trials of orforglipron are advancing into phase 2, demonstrating its po- tential as an innovative oral non-peptide GLP-1 RA [67]. Maz- dutide is advancing in phase 2 trials, showcasing its promising dual-action mechanism [ 68]. By functioning as a weak GLP-1 agonist alongside a glucagon receptor agonist, it offers a unique approach to treatment [69]. This promising drug, dorzagliatin, is currently undergoing phase 3 clinical trials and acts as a dual- acting glucokinase activator, targeting both hepatic and pancre- atic functions [70]. Imeglimin is currently undergoing a Phase 2 clinical trial and works through a tetrahydrotriazine-based structure, which helps restore and prevent mitochondrial dysfunction in pancreatic b cells [71]. Summarise all ongoing clinical trials of novel therapies for T2DM are listed inTable 3 [67e71]. 4. Lifestyle modiﬁcations Modifying dietary habits commonly entails adhering to a controlled diet that emphasizes equilibrium between energy intake and expenditure. This generally translates to a diet low in processed sugars and saturated fats while abundant in whole grains, lean proteins, fruits, and vegetables [ 72]. Consistent physical activity is key to enhancing insulin sensitivity, managing blood sugar levels, and mitigating cardiovascular risk factors. A well-rounded exercise routine typically includes aerobic activities like walking, swimming, cycling, and resistance training. The objective is to attain a harmonious exercise regimen that facili- tates glucose regulation, comprehensive physical ﬁtness, and effective weight management [73]. Sleep is a frequently under- estimated facet of lifestyle management for T2DM. Research in- dicates that obtaining 6 /C09 h of sleep can diminish cardio- metabolic risk factors in individuals with T2DM. On the con- trary, insufﬁcient sleep can worsen various complications linked to T2DM, including hypertension, hyperglycemia, insulin resis- tance, and dyslipidemia. Hence, prioritising sufﬁcient and high- quality sleep is equally signiﬁcant alongside diet and exercise in the comprehensive management of T2DM [20]. Managing T2DM through lifestyle modiﬁcations underscores the signi ﬁcance of adopting a well-rounded strategy encompassing dietary adjust- ments, physical activity, and sufﬁcient sleep. Table 3 On-going clinical trials of novel therapies for type 2 diabetes mellitus (T2DM) and their mechanisms of action. Name of the drug Phase of clinical trial Proposed mechanism of action Refs. Tirzepatide Phase 3 Dual GLP-1 and GIP receptor agonist [67] Orforglipron Phase 2 Oral non-peptide GLP-1 RA [68] Mazdutide Phase 2 Dual, GLP-1 (weak) and glucagon receptor agonist [ 69] Dorzagliatin Phase 3 Dual-acting (hepatic and pancreatic) glucokinase activator [ 70] Imeglimin Phase 2 Tetrahydrotriazine-based structure, restores/prevents pancreatic b cell mitochondrial"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:009", "title": "46a2bb5d", "text": "Phase 3 Dual GLP-1 and GIP receptor agonist [67] Orforglipron Phase 2 Oral non-peptide GLP-1 RA [68] Mazdutide Phase 2 Dual, GLP-1 (weak) and glucagon receptor agonist [ 69] Dorzagliatin Phase 3 Dual-acting (hepatic and pancreatic) glucokinase activator [ 70] Imeglimin Phase 2 Tetrahydrotriazine-based structure, restores/prevents pancreatic b cell mitochondrial dysfunction [ 71] GLP-1: glucagon-like peptide-1; GIP: glucose-dependent insulinotropic polypeptide; GLP-1 RA: GLP-1 receptor agonist. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 5 4.1. Diet Recent research has spotlighted personalized dietary strategies tailored to individual needs, mainly focusing on approaches like low-carbohydrate diets, Mediterranean diets, and time-restricted feeding. These nuanced dietary interventions have exhibited promising outcomes in enhancing glycemic control and positively impacting metabolic parameters among individuals with T2DM. When individuals adhere to these customised dietary guidelines, the bene ﬁts extend beyond glycemic control. Studies have demonstrated a decrease in the prevalence of urinary incontinence among women, alongside improvements in conditions such as sleep apnea, depression, and the overall health-related quality of life. The relationship between obesity and insulin secretion adds complexity to the understanding of T2DM. Exploring these con- nections sheds light on the intricate interplay between metabolic factors, dietary choices, and overall health in T2DM. By losing weight, one will become more sensitive to insulin, improving one's ability to manage one's blood sugar levels. Consuming enough di- etary ﬁbre, particularly ﬁbre that contains natural resources, has been demonstrated to enhance glycemic control and cardiovascular risk factor management, which lowers the risk of cardiovascular mortality in people with diabetes [74,75]. Epidemiological research has linked fats to an increased risk of obesity and cardiovascular disease [76]. Studies on the Mediterranean diet have shown that monounsaturated fatty acids, notably when swapped out for saturated fatty acids, may reduce cardiovascular risk factors and improve glycemic management [77]. Individualized reduced so- dium intake should be used when people also have hypertension, which is prevalent [78]. 4.2. Exercise Regular physical activity and exercise have maintained their status as fundamental pillars in managing T2DM. They have demonstrated notable beneﬁts, including enhanced insulin sensi- tivity, improved glucose control, favourable alterations in lipid pro- ﬁles and overall cardiovascular health. The positive impact on mental health includes a reduction in depression, emphasising the holistic beneﬁts of incorporating exercise into the routine of individuals with T2DM [72,79,80]. Exercise has proven to be beneﬁcial in preventing the onset of peripheral neuropathy. However, it is advisable to ex- ercise caution, especially in individuals with existing foot ulcers and sores. It is recommended to avoid activities that exert repetitive stress on the lower extremities in such cases. This cautious approach ensures that the positive effects of exercise in preventing peripheral neuropathy are realised without compromising the safety and well- being of individuals with pre-existing foot conditions [81,82]. How- ever, it is crucial to ensure adequate hydration. It is uncommon for T2DM to involve a severe insulin deﬁcit akin to type 1 diabetes (T1D). Maintaining appropriate hydration conditions becomes particularly important in the context of"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:010", "title": "46a2bb5d", "text": "compromising the safety and well- being of individuals with pre-existing foot conditions [81,82]. How- ever, it is crucial to ensure adequate hydration. It is uncommon for T2DM to involve a severe insulin deﬁcit akin to type 1 diabetes (T1D). Maintaining appropriate hydration conditions becomes particularly important in the context of physical activity, contributing to overall health and helping manage the potential effects of hyperglycemia in individuals with T2DM [83]. 5. AI in diabetes care Integrating AI in diabetes care represents a transformative shift in managing this chronic and complex condition. Recent studies have illuminated the multifaceted applications of AI in diabetes management, encompassing patient education, clinical decision support, and predictive analytics, each contributing to a more nuanced and practical approach to diabetes care. AI's role in patient education and self-management is particularly noteworthy. AI- driven applications and platforms can provide personalized educa- tion, dietary recommendations, and lifestyle advice tailored to in- dividual patient proﬁles. This personalisation is crucial, as diabetes management depends on patient behaviour and lifestyle choices. AI systems can analyse patient data to offer customised advice and even predict potential challenges a patient might face, enabling preemptive action [84]. In clinical decision support, AI has shown immense potential in enhancing the accuracy and efﬁciency of diabetes management. AI algorithms can analyse vast amounts of patient data, including blood glucose levels, dietary habits, and ex- ercise routines, to assist healthcare providers in making informed decisions. This can include medication adjustments, insulin dosage recommendations, and identifying patients at risk of complications such as hypoglycemia. By providing real-time, data-driven insights, AI aids clinicians in delivering more precise and effective care. Pre- dictive analytics is another area where AI is making signiﬁcant strides in diabetes care [85]. AI models can predict the onset of diabetes-related complications, such as diabetic retinopathy or kidney disease, allowing for early intervention. This predictive capability is vital for preventing or delaying complications, often the most challenging and costly aspects of diabetes management. Moreover, AI is revolutionizing the monitoring and management of blood glucose levels. Integrated with AI algorithms, continuous glucose monitoring (CGM) systems can analyse glucose data in real- time, providing patients with actionable insights to manage their condition effectively [86]. These systems can alert patients to po- tential hyperglycemia or hypoglycemia events, enabling timely intervention. The integration of AI in diabetes care also extends to the development of advanced insulin delivery systems. AI-powered closed-loop systems, also known as artiﬁcial pancreas systems, can automatically adjust insulin delivery based on CGM data, signiﬁ- cantly reducing the burden of daily diabetes management for pa- tients [87]( Fig. 2). However, integrating AI in diabetes care is not challenging. Issues such as data privacy, the need for extensive and diverse datasets to train AI models and ensuring equitable access to AI-driven tools are critical concerns that need addressing. Addi- tionally, there is a need for collaboration between technologists, clinicians, patients, and policymakers to ensure that AI tools are effectively integrated into healthcare systems and are accessible to all patients, regardless of"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:011", "title": "46a2bb5d", "text": "to train AI models and ensuring equitable access to AI-driven tools are critical concerns that need addressing. Addi- tionally, there is a need for collaboration between technologists, clinicians, patients, and policymakers to ensure that AI tools are effectively integrated into healthcare systems and are accessible to all patients, regardless of socioeconomic status. AI's role in diabetes management spans education, clinical decision support, and pre- dictive analytics. Advanced algorithms, such as convolutional neural networks (CNNs), aid in complication prediction, including reti- nopathy and nephropathy. AI-powered platforms like Information Data Exchange-Diabetic Retinopathy (IDx-DR) exemplify technology integration into clinical practice, providing automated diabetic retinopathy screening. Additionally, AI-driven decision-support systems, such as those used in hospital settings, enhance insulin and drug dosing by analyzing real-time patient data to suggest opti- mized treatment plans. These tools not only improve efﬁciency and accuracy in clinical workﬂows but also contribute to better glycemic control and reduced risks of complications for patients [88]. AI also plays a transformative role in oral drug therapy by predicting drug efﬁcacy and aiding in personalized drug selection. Predictive modelling techniques enable the stratiﬁcation of patients based on genetic, clinical, and metabolic proﬁles to identify the most effective oral hypoglycemic agents [89]. Recent studies have highlighted us- ing ML algorithms to analyse patient data and optimize drug responsiveness, improving therapeutic outcomes. For instance, AI has been utilized to predict patient adherence patterns, enabling healthcare providers to pre-emptively address barriers to treatment compliance. This application signiﬁcantly enhances precision med- icine in diabetes care, fostering a more individualized and practical approach to oral pharmacotherapy [90]. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 6 5.1. Personalized insulin therapy through AI Personalized insulin therapy has emerged as a promising avenue for improving the management of T2DM. This article ex- plores the role of AI in tailoring insulin therapy to individual pa- tients, thereby enhancing treatment outcomes and patient well- being. Furthermore, AI has the potential to enhance patient engagement and adherence to insulin therapy. Researchers have highlighted the use of AI-driven chatbots to provide real-time support and education to T2DM patients on insulin therapy [91]. These chatbots can answer questions, offer reminders for medica- tion administration, and provide lifestyle recommendations, thereby improving patient self-management. It is worth noting that the integration of AI in personalized insulin therapy is a rapidly evolving ﬁeld with ongoing research and development. These include ML models, wearable devices, and smartphone applications that continuously monitor and optimize insulin therapy (Fig. 3). 5.2. AI-driven algorithms for insulin dosage A study by Nayak et al. [92] demonstrated that voice-based conversational AI applications could assist patients with T2DM in titrating basal insulin at home, thus achieving rapid glycemic control. The potential for AI to improve the management of T2DM is clear and holds great promise for the future of diabetes care. 5.3. Predictive modelling in insulin management Predictive modelling in insulin management for T2DM has seen signiﬁcant advancements, particularly through the integration of AI and ML techniques. A"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:012", "title": "46a2bb5d", "text": "control. The potential for AI to improve the management of T2DM is clear and holds great promise for the future of diabetes care. 5.3. Predictive modelling in insulin management Predictive modelling in insulin management for T2DM has seen signiﬁcant advancements, particularly through the integration of AI and ML techniques. A key area of development is the use of ML approaches for predicting disease progression and management. Lim et al. [93] provided a comprehensive overview of how pre- dictive modelling, including ML methods, is reshaping the man- agement of T2DM, offering more personalized and effective treatment plans. In a similar vein, Lin et al. [94] developed a deep learning-based glucose trajectory prediction system for individuals with T2DM, showing promising results in controlling glucose levels. However, the system also indicated increased stress levels in participants, pointing to the need for further research to reﬁne these AI-aided health management systems. The LIGHTNING study by Pettus et al. [95] aimed to use ML to predict hypoglycemic event rates in T2DM patients receiving different basal insulin treatments. This study underscores the potential of predictive modelling in identifying patient subgroups at lower risk of hypoglycemia and in foreseeing cost savings related to hypoglycemia. Additionally, Far- uqui et al. [96] developed an online nurse-in-the-loop predictive control model that utilized a predictive digital twin trained on participants' self-monitoring data, which provided individualized feedback and recommendations, demonstrating improvements in daily steps and dietary intake for T2DM patients. While these de- velopments are promising, they also bring to light the challenges and need for ongoing research to fully realize the beneﬁts of AI and ML in diabetes care. 5.4. Synergies between therapeutic advances and AI The synergies between therapeutic advances and AI in theﬁeld of T2DM care are rapidly transforming the landscape of diabetes management. AI's integration into diabetes care promises enhanced blood glucose control, reduced complications, and improved patient satisfaction. This integration spans various do- mains, including automated retinal screening, clinical decision support, predictive population risk stratiﬁcation, and patient self- Fig. 2. Detailed workﬂow of an artiﬁcial intelligence (AI)-powered closed-loop system for continuous glucose monitoring (CGM) and automated insulin delivery, highlighting the calibration, data processing, and model application phases. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 7 management tools [97]. One notable area where AI is making sig- niﬁcant inroads is patient education, revolutionizing how in- dividuals receive information and guidance related to diabetes management. Through personalized and adaptive learning sys- tems, AI contributes to tailoring educational content based on in- dividual needs, fostering a more effective and engaging learning experience for patients. The impact of AI on improving clinical decision-making is evident in the emergence of CDSS for T2DM based on predictive analytics. However, caution is advised based on studies that highlight a gap between the potential of ML to revo- lutionise diabetes diagnosis and management and the current lack of sufﬁcient evidence to seamlessly integrate these algorithms into routine clinical practice [98]. While there are challenges and bar- riers"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:013", "title": "46a2bb5d", "text": "on predictive analytics. However, caution is advised based on studies that highlight a gap between the potential of ML to revo- lutionise diabetes diagnosis and management and the current lack of sufﬁcient evidence to seamlessly integrate these algorithms into routine clinical practice [98]. While there are challenges and bar- riers to overcome, the potential beneﬁts of AI in enhancing patient care, treatment efﬁcacy, and healthcare efﬁciency in T2DM are immense. 5.5. Integrating pharmacotherapy with AI The integration of pharmacotherapy with AI in T2DM care is emerging as a transformative approach, although it is still in the nascent stages of development [99]. Developments in this area include the creation of AI-driven CDSS. These systems utilize pre- dictive analytics to generate treatment pathways, thereby improving chronic disease care and demonstrating potential applicability to other chronic conditions [5]. Lee et al. [100] also highlighted the effectiveness of an integrated digital healthcare platform with AI- driven dietary management, resulting in better glycemic control and more weight loss in adults with T2DM. Wu et al. [101]d i s c u s s e d the potential of an AI-based health education program to improve self-management abilities and blood glucose control in primary healthcare settings. Overall, the integration of pharmacotherapy with AI in T2DM care is a burgeoningﬁeld, with studies indicating its potential to enhance diabetes management through improved decision-making, patient education, and personalized care. 5.6. Big data analysis and ML in T2DM The intersection of big data analysis and ML has revolutionized the management and prediction of T2DM. By using extensive data from EHR genomics, lifestyle factors, and glucose monitoring, these technologies provide valuable insights into disease progression and patient behavior. ML algorithms, capable of learning from complex datasets and improving over time, are particularly well-suited for analyzing the intricate patterns within big data [102]. Navazi et al. [103] highlighted the use of hybrid meta-heuristic ML algorithms for early diagnosis, demonstrating that integrating ML techniques with big data signiﬁcantly enhances diagnostic accuracy. Similarly, Zhang et al. [104] showed that ML models could effectively predict T2DM development using only self-reported information, under- scoring the accessibility and utility of such data in predictive ana- lytics. Theseﬁndings illustrate the critical role of big data and ML in facilitating early diagnosis and timely intervention in T2DM. Beyond early diagnosis, big data and ML have also shown promise in predicting complications and personalizing treatment plans for T2DM patients. Studies like those by Abhari et al. [4]a n dS u b - ramaniyan et al. [105] emphasise the necessity of using large data- sets to achieve accurate and generalizable predictive models. Fig. 3. Overview of artiﬁcial intelligence (AI) applications in diabetes management, illustrating a cyclicﬂow of data among wearable health devices, smartphones, telemedicine platforms, social media, and AI systems for integrated care and personalized insights. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 8 Fregoso-Aparicio et al. [106] highlighted that integrating clinical data with ML enhances the predictive power of diabetes management systems. Moreover,"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:014", "title": "46a2bb5d", "text": "smartphones, telemedicine platforms, social media, and AI systems for integrated care and personalized insights. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 8 Fregoso-Aparicio et al. [106] highlighted that integrating clinical data with ML enhances the predictive power of diabetes management systems. Moreover, Nibareke and Laassiri [107], and Tigga and Garg [108] demonstrated the utility of multiple ML tools and classiﬁcation methods in improving diabetes prediction and management. These advancements not only enable healthcare providers to tailor treat- ment plans based on individual patient proﬁles but also facilitate the early identiﬁcation of potential complications, thereby improving patient outcomes and reducing healthcare costs. Overall, the inte- gration of big data and ML in T2DM care represents a signiﬁcant leap forward in personalized medicine and predictive healthcare. Deep learning has emerged as a powerful tool for predicting complications associated with T2DM. CNNs have demonstrated exceptional capabilities in the early detection of diabetic retinopathy through retinal image analysis, outperforming traditional diagnostic methods in accuracy and sensitivity [86]. These models excel at identifying microaneurysms and other subtle retinal changes that may not be apparent to human evaluators. Similarly, advanced neural network architectures are being utilized to predict diabetic nephropathy by analyzing a combination of clinical, biochemical, and imaging data. These models enable the identiﬁcation of high-risk individuals and facilitate early interventions to prevent or mitigate kidney damage. Integrating such deep learning techniques into routine care provides an unprecedented opportunity for precision diagnostics, allowing for timely and targeted management of diabetes-related complications [109]. 5.7. Future directions and implications for use of AI The future directions and implications of integrating AI in T2DM care are multifaceted, offering exciting prospects for enhancing pa- tient care and management. While speciﬁc studies focusing solely on T2DM are limited, the broader implications in diabetes care and AI applications provide valuable insights. The effectiveness of AI in obesity management, a common comorbidity in T2DM, suggests potential collaborative opportunities. Hinchliffe et al. [110] noted the role of digital health technologies, including ML and AI, in auto- mating and personalizing interventions in obesity care. An essential area of future exploration is the potential for AI-enhanced technol- ogies to support individuals with diabetes during signiﬁcant life transitions, such as moving from home to university for young adults. Researchﬁndings consistently point to the pivotal intersection where technological innovation converges with the personalized needs and experiences of individuals grappling with the management of T1D. This critical juncture highlights the potential for technology to be tailored and responsive to the diverse and unique requirements of those navigating the complexities of T1D [87]. Identifying and ana- lysing factors that inﬂuence the usability of these applications is crucial for their effective implementation in diabetes care [85]. Stein and Brooks [111] investigated the effectiveness of a standalone, fully automated text-based mobile coaching service in promoting weight loss and related health behaviours, demonstrating the potential of AI to increase access to compassionate health care via mobile health platforms. By providing personalized insights, real-time feedback,"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:015", "title": "46a2bb5d", "text": "in diabetes care [85]. Stein and Brooks [111] investigated the effectiveness of a standalone, fully automated text-based mobile coaching service in promoting weight loss and related health behaviours, demonstrating the potential of AI to increase access to compassionate health care via mobile health platforms. By providing personalized insights, real-time feedback, and actionable recommendations, the combination of an AI digital coach and a consumer-friendly glucose meter encourages individuals to make informed decisions and adopt healthier lifestyle choices [112]. The consistent decrease in HbA1C levels reﬂects not only the efﬁcacy of this integrated approach but also hints at the trans- formative impact on the long-term health outcomes of individuals with diabetes. This shift in self-management practices signiﬁ es a departure from conventional approaches, highlighting the potential of technology-driven interventions to enhance the effectiveness of diabetes care. The future directions in AI and T2DM care are geared towards enhancing patient support through technology, improving data usability and interpretation, and exploring novel ways to manage diabetes more effectively. 5.8. Potential barriers and challenges in the use of AI Implementing AI in the care of individuals with T2DM en- counters numerous potential barriers and challenges, necessitating thoughtful solutions to unlock its maximum beneﬁts. Research indicates that complex technological concerns, the active engage- ment of patients, ethical considerations, safeguarding data privacy, health disparities, reservations among clinicians, regulatory con- straints and the requirement for well-balanced strategies and collaborative research initiatives emerge as pivotal challenges that require careful attention and resolution [113]. Goldstein et al. [114] further emphasise that hurdles such as regulatory approval, reim- bursement processes, updates to quality measures, and the local- ised optimisation of clinical workﬂows pose additional challenges in integrating AI into diabetes care [115]. The conceptualisation and development of a prototype for virtual assistant software designed to facilitate self-care among older adults managing T2DM under- score a crucial aspect of healthcare innovation. In recognising the diversity within the T2DM patient population, particularly among older adults, the prototype highlights the importance of moving beyond one-size-ﬁts-all solutions. By tailoring virtual assistant software to cater speciﬁcally to the distinct requirements of older adults, the approach becomes more personalized and attuned to the unique challenges and preferences prevalent in this de- mographic [116]. Furthermore, patient perceptions of AI applications in health- care play a crucial role. The research conducted by Esmaeilzadeh and colleagues indicates that the medical condition and the clinical interaction affect factors such as privacy worries, trust dilemmas, communication obstacles, apprehensions about regulatory norms, liability hazards, and the willingness to utilize services. This un- derscores the importance of building trust and ensuring trans- parency in AI applications [117]. Another challenge identiﬁed by Dvey-Aharon and Huhtinen [118]i s ﬁnding reliable and conve- nient methods for screening diabetic retinopathy using AI algo- rithms, which is crucial for early detection and treatment. The lack of transparency and potential for bias in AI and ML applications are signiﬁcant concerns, necessitating using Bayesian methods to fos- ter trust in medical AI/ML applications [119]. Shah et al. [120] highlight the accessibility"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:016", "title": "46a2bb5d", "text": "diabetic retinopathy using AI algo- rithms, which is crucial for early detection and treatment. The lack of transparency and potential for bias in AI and ML applications are signiﬁcant concerns, necessitating using Bayesian methods to fos- ter trust in medical AI/ML applications [119]. Shah et al. [120] highlight the accessibility of diabetic retinopathy screening in pri- mary care settings as a barrier, emphasising the need for wide- spread and accessible screening methods. The future implementation of AI in T2DM care is laden with challenges related to technology, ethics, regulation, patient engagement, and trust. Addressing these barriers requires multidisciplinary efforts, regu- latory framework development, patient-centric approaches, and continuous research and innovation. 6. Bridging the gap between AI and therapeutics in T2DM management Integrating AI into managing T2DM can revolutionise patient care by enhancing diagnostic accuracy, personalizing treatment plans, and improving overall health outcomes. However, despite AI's promising capabilities, signiﬁcant barriers impede its seamless incorporation into therapeutic strategies. Addressing these chal- lenges through interdisciplinary collaboration, education, and robust regulatory frameworks is crucial for harnessing the full potential of AI in diabetes care. This section explores the multi- faceted challenges of integrating AI with therapeutics in T2DM management and proposes comprehensive solutions to bridge these gaps [6]. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 9 6.1. Challenges in integration Integrating AI into T2DM management presents numerous technological, ethical, and practical challenges. One primary chal- lenge is data standardisation and integration. AI systems require vast amounts of high-quality data to function effectively, but the data used in healthcare often comes from disparate sources and in various formats. This lack of standardisation makes compiling and analysing data efﬁciently tricky [87]. Additionally, data quality can vary signiﬁcantly, with issues such as missing information or inaccurate entries further complicating the integration process [117]. Ethical concerns also pose signiﬁcant barriers. AI systems in healthcare must navigate the complex landscape of patient privacy and data security. Ensuring that AI applications comply with reg- ulations like the General Data Protection Regulation (GDPR) and the Health Insurance Portability and Accountability Act (HIPAA) is crucial to maintaining patient trust and protecting sensitive health information [118]. There are also concerns about bias in AI algo- rithms, which can result from biased data sets or algorithmic design, potentially leading to unequal treatment outcomes among different patient populations [119]. From a practical standpoint, healthcare providers' acceptance and adoption of AI technologies can be slow. Clinicians may be sceptical about the reliability of AI systems or may lack the necessary training to use these tools effectively. Furthermore, integrating AI into existing healthcare workﬂows requires signiﬁ- cant changes in infrastructure and processes, which can be resource-intensive and disruptive [120]. Financial constraints also play a role, as developing and implementing AI technologies in- volves substantial investment, which may not be feasible for all healthcare settings [121]. Integrating AI into diabetes management faces several chal- lenges that hinder its seamless adoption and widespread applica- tion. One signiﬁcant barrier is the lack"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:017", "title": "46a2bb5d", "text": "Financial constraints also play a role, as developing and implementing AI technologies in- volves substantial investment, which may not be feasible for all healthcare settings [121]. Integrating AI into diabetes management faces several chal- lenges that hinder its seamless adoption and widespread applica- tion. One signiﬁcant barrier is the lack of data standardization, as healthcare data often originates from disparate sources and for- mats. Developing standardized data-sharing protocols is essential for efﬁcient AI model training and application. Another critical issue is ensuring patient privacy, as AI systems require access to sensitive health information. Solutions like advanced encryption techniques and federated learning frameworks can mitigate privacy concerns while maintaining robust data utilization. Furthermore, integrating AI into clinical work ﬂows requires comprehensive training programs for clinicians to enhance their understanding and usability of AI tools. By addressing these challenges through technological advancements and education, AI can achieve its full potential in improving diabetes care. 6.2. Potential solutions To overcome these challenges, a multi-faceted approach involving interdisciplinary collaboration, education and training, standardisation and regulation, and patient-centric approaches is necessary. 6.2.1. Interdisciplinary collaboration Effective integration of AI into T2DM management requires collaboration between diverseﬁelds, including computer science, endocrinology, data science, and ethics. Such interdisciplinary collaboration can ensure that AI systems are designed with a comprehensive understanding of both the technological possibil- ities and the clinical realities. For instance, collaboration between data scientists and clinicians can help identify relevant clinical variables to include in AI models, improving their accuracy and utility [84]. Additionally, involving ethicists in the development process can help address potential biases and ensure ethical considerations are incorporated from the outset [113]. 6.2.2. Education and training To effectively embrace AI technologies in healthcare, we must prioritize comprehensive education and training for healthcare providers. This investment will empower them to leverage these advancements conﬁdently and improve patient care. Training programs should focus on enhancing the digital literacy of clini- cians, helping them understand how AI tools work, how to inter- pret AI-generated insights, and how to integrate these tools into their clinical practice. Continuous education initiatives can also help clinicians stay updated with the latest advancements in AI and its applications in diabetes care [100]. Furthermore, fostering a culture of openness to technological innovation within healthcare institutions can help mitigate resistance to adopting new technol- ogies [111]. 6.2.3. Standardisation and regulation Standardisation of data formats and protocols is crucial for the seamless integration of AI into healthcare. Establishing typical data collection, storage, and sharing standards can facilitate the devel- opment of robust AI models that can be applied across different healthcare settings. Regulatory frameworks should also be adapted to address AI's unique challenges in healthcare. This includes developing guidelines for the ethical use of AI, ensuring trans- parency in AI decision-making processes, and implementing mechanisms for monitoring and evaluating the performance of AI systems [120]. Regulatory bodies need to work closely with AI developers, healthcare providers, and patients to create regulations that protect patients while encouraging innovation [97]. 6.2.4. Patient-centric approaches Incorporating patient perspectives"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:018", "title": "46a2bb5d", "text": "AI, ensuring trans- parency in AI decision-making processes, and implementing mechanisms for monitoring and evaluating the performance of AI systems [120]. Regulatory bodies need to work closely with AI developers, healthcare providers, and patients to create regulations that protect patients while encouraging innovation [97]. 6.2.4. Patient-centric approaches Incorporating patient perspectives into the design and imple- mentation of AI technologies is essential for ensuring these tools meet the needs of those they are intended to help. Engaging pa- tients in the development process can provide valuable insights into their preferences, concerns, and needs, leading to the creation of more user-friendly and effective AI applications. Moreover, educating patients about the beneﬁts and limitations of AI can help build trust and encourage them to participate actively in their care [101]. Personalized AI-driven tools that provide tailored recom- mendations and support can enhance patient engagement and adherence to treatment plans, ultimately improving health out- comes [92]. 7. AI-driven CDSS AI-driven CDSS have revolutionized the management of T2DM by enhancing predictive analytics, risk stratiﬁcation, and person- alized treatment recommendations. These systems leverage ML algorithms to analyse vast amounts of patient data, identifying patterns and trends that enable the prediction of health outcomes such as hypoglycemia and hyperglycemia events. This predictive capability allows healthcare providers to intervene proactively, adjusting treatment plans before adverse events occur, thereby improving patient safety and outcomes. AI-CDSS can categorise patients into different risk levels, prioritising high-risk individuals for more intensive management, which is crucial for preventing complications associated with T2DM, such as cardiovascular dis- ease and diabetic nephropathy. Moreover, AI-CDSS generates personalized treatment recommendations by considering many factors, including genetic data, lifestyle choices, and comorbid conditions. This tailored approach enhances treatment adherence and efﬁcacy, aligning closely with patients' needs and preferences. AI-CDSS can optimize insulin therapy by continuously monitoring A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 10 glucose levels and other relevant parameters, suggesting precise insulin dosages and timing, thus reducing the risk of errors and enhancing glucose management. These systems also facilitate shared decision-making by providing options and potential out- comes, empowering patients to actively participate in their care, which has been shown to improve satisfaction and adherence [122]. However, the implementation of AI-CDSS in diabetes care faces signiﬁcant challenges. Data standardisation and integration with existing healthcare infrastructure are critical issues that must be addressed to ensure seamless interoperability. Additionally, there are concerns about data privacy and security, as AI systems require access to sensitive patient information. Ensuring robust safeguards and compliance with regulatory standards like GDPR and HIPAA is essential. Furthermore, the acceptance and trust of AI among healthcare providers can be hindered by a lack of understanding or scepticism about the accuracy of these systems. Education and training pro- grams are crucial to build con ﬁdence and familiarity with AI technologies. Finally, continuous evaluation and validation of AI- CDSS are necessary to ensure their reliability and effectiveness in real-world settings [123]. Addressing these issues through robust regulatory frame- works, interdisciplinary"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:019", "title": "46a2bb5d", "text": "the accuracy of these systems. Education and training pro- grams are crucial to build con ﬁdence and familiarity with AI technologies. Finally, continuous evaluation and validation of AI- CDSS are necessary to ensure their reliability and effectiveness in real-world settings [123]. Addressing these issues through robust regulatory frame- works, interdisciplinary collaboration, and continuous evaluation is essential for maximising the potential of AI-CDSS in diabetes care. Studies have demonstrated that AI-CDSS can signiﬁcantly enhance clinical decision-making, improve glycemic control, and reduce complications, promising a transformative impact on diabetes management. As AI technologies continue to evolve, they hold the potential to further revolutionise diabetes care by enabling more precise, proactive, and personalized management strategies [124]. 8. Predictive modelling for complication prevention Predictive modelling has become crucial in managing T2DM by enabling early identiﬁcation and preventing complications. These models use ML algorithms to analyse extensive patient data, identifying patterns and risk factors associated with diabetes- related complications such as cardiovascular disease, nephropa- thy, retinopathy, and neuropathy. Early detection through predic- tive modelling allows healthcare providers to implement timely interventions, signi ﬁcantly improving patient outcomes and reducing healthcare costs. By incorporating variables like de- mographic data, clinical parameters, and lifestyle factors, predictive models can assess the risk of complications, enabling personalized treatment plans. For example, patients at high risk for diabetic nephropathy can be monitored more closely and advised on life- style changes, thereby enhancing treatment adherence and efﬁcacy [125]. However, implementing predictive models faces several challenges, including data quality, privacy concerns, and the need for continuous model validation. Ensuring robust data protection and compliance with regulations like HIPAA is essential for main- taining patient trust. Additionally, integrating predictive models with EHR systems enhances their utility by providing real-time data analysis and risk assessment, facilitating prompt and informed decision-making. Despite these challenges, the future of predictive modelling in T2DM management looks promising, with advancements expected to incorporate a broader range of data sources, including wearable devices and genomic data. These developments could further enhance the precision and utility of predictive models, paving the way for more proactive and personalized diabetes care, ultimately transforming T2DM management by enabling early intervention and reducing complications [126]. 9. Conclusion In conclusion, integrating AI in managing T2DM presents a paradigm shift with vast potential to improve patient outcomes. This article has highlighted key ﬁndings that emphasise the trans- formative impact of AI in various aspects of T2DM care, including predictive analytics, personalized treatment regimens, patient self- management, and the enhancement of clinical decision-making processes. The key ﬁndings underscore AI's capability to analyse complex health data, offering more accurate predictions and personalized care plans. AI-driven predictive models can forecast disease progression and treatment responses, aiding early in- terventions. In pharmacotherapy, AI algorithms optimize drug dos- ages and reduce adverse effects, while AI-powered lifestyle management tools provide tailored dietary and exercise recom- mendations. However, the implementation of AI in T2DM care is not without challenges. Issues such as data privacy and security, po- tential biases in AI algorithms, and the need"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:020", "title": "46a2bb5d", "text": "AI algorithms optimize drug dos- ages and reduce adverse effects, while AI-powered lifestyle management tools provide tailored dietary and exercise recom- mendations. However, the implementation of AI in T2DM care is not without challenges. Issues such as data privacy and security, po- tential biases in AI algorithms, and the need for clinician education and acceptance have been identiﬁed as signiﬁcant barriers. Future research should focus on improving the quality and diversity of data used in AI systems, ensuring that these technologies are represen- tative of and effective for diverse patient populations. Ethical con- siderations, particularly regarding data privacy and algorithmic bias, must be a central focus, ensuring that AI-driven healthcare advances ethically and equitably. Clinically, there is a need for a concerted effort to integrate AI tools into healthcare workﬂows seamlessly. This integration requires technological advancements and a focus on educating healthcare providers about AI capabilities and limitations. Additionally, healthcare systems must address accessibility and affordability issues to ensure that the beneﬁts of AI in T2DM care are available to all patients, regardless of socioeconomic status or geographical location. As research and development in thisﬁeld continue to advance, the collaborative efforts of scientists, clinicians, and policymakers will be crucial in harnessing the full potential of AI for improving the lives of individuals living with T2DM. CRediT authorship contribution statement Aniruddha Sen:Writing e review & editing, Writinge original draft, Validation, Supervision, Methodology, Investigation, Formal analysis, Data curation, Conceptualization.Palani Selvam Mohan- raj: Writing e original draft, Supervision, Methodology, Formal analysis. Vijaya Laxmi:Writing e original draft, Visualization, Su- pervision, Methodology, Formal analysis, Data curation. Sumel Ashique: Writing e original draft, Visualization, Supervision, Methodology, Formal analysis.Rajalakshimi Vasudevan:Writing e original draft, Visualization, Methodology, Funding acquisition, Formal analysis.Afaf Aldahish: Writing e original draft, Supervi- sion, Methodology, Funding acquisition, Formal analysis.Anupriya Velu: Writing e review & editing, Writinge original draft, Visuali- zation, Supervision, Methodology, Formal analysis. Arani Das: Writing e review & editing, Writinge original draft, Supervision, Methodology, Formal analysis.Iman Ehsan: Writing e review & editing, Writinge original draft, Visualization, Supervision, Meth- odology, Formal analysis.Anas Islam:Writing e review & editing, Supervision, Methodology, Formal analysis.Sabina Yasmin:Writing e review & editing, Visualization, Supervision, Methodology, Funding acquisition, Formal analysis.Mohammad Yousuf Ansari: Writing e review & editing, Writinge original draft, Supervision, Methodology, Investigation, Formal analysis, Conceptualization. Declaration of competing interest The authors declare that there are no conﬂicts of interest. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 11 Acknowledgments The authors extend their appreciation to the Deanship of Research and Graduate Studies at King Khalid University of Saudi Arabia for funding this work through Large Research Project (Grant No.: RGP 2/402/45). The authors would also like to express grati- tude to Ibne Seena College of Pharmacy at Azmi Vidya Nagri, Anjhi Shahabad, Hardoi, India for providing necessary facilities. Allﬁg- ures are created by usingBioRender.com. References [1] D. Vasdeki, T. Koufakis, G. Tsamos, et al., Remission as an emerging thera- peutic target in type 2 diabetes in the era of new glucose-lowering agents: Beneﬁts,"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:021", "title": "46a2bb5d", "text": "College of Pharmacy at Azmi Vidya Nagri, Anjhi Shahabad, Hardoi, India for providing necessary facilities. Allﬁg- ures are created by usingBioRender.com. References [1] D. Vasdeki, T. Koufakis, G. Tsamos, et al., Remission as an emerging thera- peutic target in type 2 diabetes in the era of new glucose-lowering agents: Beneﬁts, challenges, and treatment approaches, Nutrients 14 (2022), 4801. [2] A. Artasensi, A. Mazzolari, A. Pedretti, et al., Obesity and type 2 diabetes: Adiposopathy as a triggering factor and therapeutic options, Molecules 28 (2023), 3094. [3] J. Iglesies-Grau, V. Dionne, Latour, et al., The short-term impact and sus- tainability of multiple lifestyle interventions on metabolic health and remission of prediabetes and type 2 diabetes: A two-year experience, Eur. J. Prev. Cardiol. 29 (2022), zwac056.192. [4] S. Abhari, S.R. Niakan Kalhori, M. Ebrahimi, et al., Artiﬁcial intelligence ap- plications in type 2 diabetes mellitus care: Focus on machine learning methods, Healthc. Inform. Res. 25 (2019) 248e261. [5] S. Tarumi, W. Takeuchi, G. Chalkidis, et al., Leveraging artiﬁcial intelligence to improve chronic disease care: Methods and application to pharmacotherapy decision support for type-2 diabetes mellitus, Methods Inf. Med. 60 (2021) e32ee43. [6] F. Tahir, M. Farhan, Exploring the progress of artiﬁcial intelligence in man- aging type 2 diabetes mellitus: A comprehensive review of present in- novations and anticipated challenges ahead, Front. Clin. Diabetes Healthc. 4 (2023), 1316111. [7] X. Zhang, J. Xie, X. You, et al., Risk factors and drug discovery for cognitive impairment in type 2 diabetes mellitus using artiﬁcial intelligence inter- pretation and graph neural networks, Front. Endocrinol. (Lausanne) 14 (2023), 1213711. [8] B. Zhao, X. Su, Y. Yang, et al., Regulation-aware graph learning for drug repositioning over heterogeneous biological network, Inf. Sci. 686 (2025), 121360. [9] B. Zhao, L. Wang, P. Hu, et al., Fusing higher and lower-order biological in- formation for drug repositioning via graph representation learning, IEEE Trans. Emerg. Top. Comput. 12 (2024) 163e176. [10] X. Su, P. Hu, H. Yi, et al., Predicting drug-target interactions over heteroge- neous information network, IEEE J. Biomed. Health Inform. 27 (2023) 562e572. [11] A.D. Association, Diagnosis and classiﬁcation of diabetes mellitus, Diabetes Care 32 (2009) S62eS67. [12] E. Eyth, H. Basit, C.J. Swift, Glucose Tolerance Test.http://www.ncbi.nlm.nih. gov/books/NBK532915/. (Accessed 15 June 2024). [13] C. Florkowski, HbA1c as a diagnostic test for diabetes mellitus - reviewing the evidence, Clin. Biochem. Rev. 34 (2013) 75e83. [14] A. Chaudhury, C. Duvoor, V.S. Reddy Dendi, et al., Clinical Review of Anti- diabetic Drugs: Implications for Type 2 Diabetes Mellitus Management, Front. Endocrinol. 8 (2017), 6. [15] N. Kumar, B. Kumar, S. Ashique, et al., A critical review on SGLT2 inhibitors for diabetes mellitus, renal health, and cardiovascular conditions, Diabetes Res. Clin. Pract. 221 (2025), 112050. [16] S.E. Inzucchi, R.M. Bergenstal, J.B. Buse, et al., Management of hyper- glycaemia in type 2 diabetes: A patient-centered approach. position state- ment of the American diabetes association (ADA) and the European association for the study of diabetes (EASD), Diabetologia 55 (2012) 1577e1596. [17] S.E. Inzucchi, R.M. Bergenstal, J.B. Buse, et"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:022", "title": "46a2bb5d", "text": "S.E. Inzucchi, R.M. Bergenstal, J.B. Buse, et al., Management of hyper- glycaemia in type 2 diabetes: A patient-centered approach. position state- ment of the American diabetes association (ADA) and the European association for the study of diabetes (EASD), Diabetologia 55 (2012) 1577e1596. [17] S.E. Inzucchi, R.M. Bergenstal, J.B. Buse, et al., Management of hyperglycemia in type 2 diabetes, 2015: A patient-centered approach: Update to a position statement of the American diabetes association and the European associa- tion for the study of diabetes, Diabetes Care 38 (2015) 140e149. [18] D.M. Nathan, J.B. Buse, M.B. Davidson, et al., Medical management of hy- perglycemia in type 2 diabetes: A consensus algorithm for the initiation and adjustment of therapy: A consensus statement of the American Diabetes Association and the European Association for the Study of Diabetes, Diabetes Care 32 (2009) 193e203. [19] G. Zhou, R. Myers, Y. Li, et al., Role of AMP-activated protein kinase in mechanism of metformin action, J. Clin. Invest. 108 (2001) 1167e1174. [20] F.P. Cappuccio, D. Cooper, L. D’Elia, et al., Sleep duration predicts cardio- vascular outcomes: A systematic review and meta-analysis of prospective studies, Eur. Heart J. 32 (2011) 1484e1492. [21] National Institutes of Health, National Diabetes Education Program releases Guiding Principles for diabetes care. https://www.nih.gov/news-events/ news-releases/national-diabetes-education-program-releases-guiding- principles-diabetes-care. (Accessed 7 June 2023). [22] A.J. Garber, M.J. Abrahamson, J.I. Barzilay, et al., Consensus statement by the American association of clinical endocrinologists and American college of endocrinology on the comprehensive type 2 diabetes management algo- rithme2017 executive summary, Endocr. Pract. 23 (2017) 207e238. [23] J. McNeil,/C19E. Doucet, J.P. Chaput, Inadequate sleep as a contributor to obesity and type 2 diabetes, Can. J. Diabetes 37 (2013) 103e108. [24] H. An, L. He, Current understanding of metformin effect on the control of hyperglycemia in diabetes, J. Endocrinol. 228 (2016) 97e106. [25] D.R. Alessi, K. Sakamoto, J.R. Bayascas, LKB1-dependent signaling pathways, Annu. Rev. Biochem. 75 (2006) 137e163. [26] H.J. Kim, S. Lee, K.H. Chun, et al., Metformin reduces the risk of cancer in patients with type 2 diabetes: An analysis based on the Korean National Diabetes Program Cohort, Medicine (Baltimore) 97 (2018), e0036. [27] M. Abe, K. Okada, M. Soma, Antidiabetic agents in patients with chronic kidney disease and end-stage renal disease on dialysis: Metabolism and clinical practice, Curr. Drug Metab. 12 (2011) 57e69. [28] C.C. Kao, P. Wu, C.H. Wu, et al., Risk of liver injury after a-glucosidase in- hibitor therapy in advanced chronic kidney disease patients, Sci. Rep. 6 (2016), 18996. [29] S. Del Prato, A.H. Barnett, H. Huisman, et al., Effect of linagliptin mono- therapy on glycaemic control and markers ofb-cell function in patients with inadequately controlled type 2 diabetes: A randomized controlled trial, Diabetes Obes. Metab. 13 (2011) 258e267. [30] J.J. Marín-Pe~nalver, I. Martín-Tim/C19on, C. Sevillano-Collantes, et al., Update on the treatment of type 2 diabetes mellitus, World J. Diabetes 7 (2016) 354e395. [31] R. Eldor, I. Raz, Diabetes therapy: Focus on Asia: Second-line therapy debate: Insulin/secretagogues, Diabetes Metab. Res. Rev. 28 (2012) 85e89. [32] S. Genuth, Should sulfonylureas remain"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:023", "title": "46a2bb5d", "text": "J.J. Marín-Pe~nalver, I. Martín-Tim/C19on, C. Sevillano-Collantes, et al., Update on the treatment of type 2 diabetes mellitus, World J. Diabetes 7 (2016) 354e395. [31] R. Eldor, I. Raz, Diabetes therapy: Focus on Asia: Second-line therapy debate: Insulin/secretagogues, Diabetes Metab. Res. Rev. 28 (2012) 85e89. [32] S. Genuth, Should sulfonylureas remain an acceptableﬁrst-line add-on to metformin therapy in patients with type 2 diabetes?No, it’s time to move on, Diabetes Care 38 (2015) 170e175. [33] T.P. Wycherley, M. Noakes, P.M. Clifton, et al., A high-protein diet with resistance exercise training improves weight loss and body composition in overweight and obese patients with type 2 diabetes, Diabetes Care 33 (2010) 969e976. [34] E. Ferrannini, R.A. DeFronzo, Impact of glucose-lowering drugs on cardio- vascular disease in type 2 diabetes, Eur. Heart J. 36 (2015) 2288e2296. [35] A.S. Gangji, T. Cukierman, H.C. Gerstein, et al., A systematic review and meta- analysis of hypoglycemia and cardiovascular events: A comparison of gly- buride with other secretagogues and with insulin, Diabetes Care 30 (2007) 389e394. [36] P.C. Lim, C.P. Chong, What’s next after metformin? focus on sulphonylurea: Add-on or combination therapy, Pharm. Pract. (Granada) 13 (2015), 606. [37] L.J. Scott, Repaglinide: A review of its use in type 2 diabetes mellitus, Drugs 72 (2012) 249e272. [38] M.A. Nauck, Update on developments with SGLT2 inhibitors in the man- agement of type 2 diabetes, Drug Des. Devel. Ther. 8 (2014) 1335e1380. [39] O. Marsenic, Glucose control by the kidney: An emerging target in diabetes, Am. J. Kidney Dis. 53 (2009) 875e883. [40] W.T. Cefalu, L.A. Leiter, K.H. Yoon, et al., Efﬁcacy and safety of canagliﬂozin versus glimepiride in patients with type 2 diabetes inadequately controlled with metformin (CANTATA-SU): 52 week results from a randomised, double- blind, phase 3 non-inferiority trial, Lancet 382 (2013) 941e950. [41] H. Zheng, M. Liu, S. Li, et al., Sodium-glucose co-transporter-2 inhibitors in non-diabetic adults with overweight or obesity: A systematic review and meta-analysis, Front. Endocrinol. (Lausanne) 12 (2021), 706914. [42] AstraZeneca, AstraZeneca and Bristol-Myers Squibb resubmit dapagliﬂozin New Drug Application for the treatment of type 2 diabetes in the U.S.https:// www.astrazeneca.com/media-centre/press-releases/2013/astrazeneca- bristol-myers-squibb-dapagliﬂozin-type-2-diabetes-treatment-25072013. html. (Accessed 19 June 2023). [43] E. Ferrannini, S.J. Ramos, A. Salsali, et al., Dapagliﬂozin monotherapy in type 2 diabetic patients with inadequate glycemic control by diet and exercise: A randomized, double-blind, placebo-controlled, phase 3 trial, Diabetes Care 33 (2010) 2217e2224. [44] S. Sha, D. Devineni, A. Ghosh, et al., Pharmacodynamic effects of canagli- ﬂozin, a sodium glucose co-transporter 2 inhibitor, from a randomized study in patients with type 2 diabetes, PLoS One 9 (2014), e105638. [45] P. Ruggenenti, E.L. Porrini, F. Gaspari, et al., Glomerular hyperﬁltration and renal disease progression in type 2 diabetes, Diabetes Care 35 (2012) 2061e2068. [46] K. Jiang, Y. Xu, D. Wang, et al., Cardioprotective mechanism of SGLT2 in- hibitor against myocardial infarction is through reduction of autosis, Protein Cell 13 (2022) 336e359. [47] L.L. Lipscombe, Thiazolidinediones: Do harms outweigh beneﬁts? CMAJ 180 (2009) 16e17. [48] F. Chiarelli, D. Di Marzio, Peroxisome proliferator-activated receptor-gamma agonists and diabetes: Current"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:024", "title": "46a2bb5d", "text": "Y. Xu, D. Wang, et al., Cardioprotective mechanism of SGLT2 in- hibitor against myocardial infarction is through reduction of autosis, Protein Cell 13 (2022) 336e359. [47] L.L. Lipscombe, Thiazolidinediones: Do harms outweigh beneﬁts? CMAJ 180 (2009) 16e17. [48] F. Chiarelli, D. Di Marzio, Peroxisome proliferator-activated receptor-gamma agonists and diabetes: Current evidence and future perspectives, Vasc. Health Risk Manag. 4 (2008) 297e304. [49] C.E. Quinn, P.K. Hamilton, C.J. Lockhart, et al., Thiazolidinediones: Effects on insulin resistance and the cardiovascular system, Br. J. Pharmacol. 153 (2008) 636e645. [50] K.K. Ryan, B. Li, B.E. Grayson, et al., A role for central nervous system PPAR- g A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 12 in the regulation of energy balance, Nat. Med. 17 (2011) 623e626. [51] Y. Guan, C. Hao, D.R. Cha, et al., Thiazolidinediones expand bodyﬂuid volume through PPARgamma stimulation of ENaC-mediated renal salt absorption, Nat. Med. 11 (2005) 861e866. [52] K.R. Feingold, S.F. Ahmed, B. Anawalt, Oral and injectable (non-insulin) pharmacological agents for the treatment of type 2 diabetes.http://www. ncbi.nlm.nih.gov/books/NBK279141/. (Accessed 16 June 2024). [53] L. Collins, R.A. Costello, Glucagon-like peptide-1 receptor agonists.http:// www.ncbi.nlm.nih.gov/books/NBK551568/. (Accessed 16 June 2024). [54] B. Willms, J. Werner, J.J. Holst, et al., Gastric emptying, glucose responses, and insulin secretion after a liquid test meal: Effects of exogenous glucagon-like peptide-1 (GLP-1)-(7-36) amide in type 2 (noninsulin-dependent) diabetic patients, J. Clin. Endocrinol. Metab. 81 (1996) 327e332. [55] K. Horvath, K. Jeitler, A. Berghold, et al., Long-acting insulin analogues versus NPH insulin (human isophane insulin) for type 2 diabetes mellitus, Cochrane Database Syst. Rev. (2007), CD005613. [56] L. Heinemann, R. Linkeschova, K. Rave, et al., Time-action proﬁle of the long- acting insulin analog insulin glargine (HOE901) in comparison with those of NPH insulin and placebo, Diabetes Care 23 (2000) 644e649. [57] R.E. Ratner, S.L. Gough, C. Mathieu, et al., Hypoglycaemia risk with insulin degludec compared with insulin glargine in type 2 and type 1 diabetes: A pre-planned meta-analysis of phase 3 trials, Diabetes Obes. Metab. 15 (2013) 175e184. [58] B. Zinman, A. Philis-Tsimikas, B. Cariou, et al., Insulin degludec versus insulin glargine in insulin-naive patients with type 2 diabetes: A 1-year, random- ized, treat-to-target trial (BEGIN Once Long), Diabetes Care 35 (2012) 2464e2471. [59] Y. Seino, K.W. Min, E. Niemoeller, et al., Randomized, double-blind, placebo- controlled trial of the once-daily GLP-1 receptor agonist lixisenatide in Asian patients with type 2 diabetes insufﬁciently controlled on basal insulin with or without a sulfonylurea (GetGoal-L-Asia), Diabetes Obes. Metab. 14 (2012) 910e917. [60] M.C. Riddle, T. Forst, R. Aronson, et al., Adding once-daily lixisenatide for type 2 diabetes inadequately controlled with newly initiated and continu- ously titrated basal insulin glargine: A 24-week, randomized, placebo- controlled study (GetGoal-Duo 1), Diabetes Care 36 (2013) 2497e2503. [61] R.M. Bergenstal, C. Wysham, L. Macconell, et al., Efﬁcacy and safety of exe- natide once weekly versus sitagliptin or pioglitazone as an adjunct to met- formin for treatment of type 2 diabetes (DURATION-2): A randomised trial, Lancet 376 (2010) 431e439. [62] T."}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:025", "title": "46a2bb5d", "text": "(GetGoal-Duo 1), Diabetes Care 36 (2013) 2497e2503. [61] R.M. Bergenstal, C. Wysham, L. Macconell, et al., Efﬁcacy and safety of exe- natide once weekly versus sitagliptin or pioglitazone as an adjunct to met- formin for treatment of type 2 diabetes (DURATION-2): A randomised trial, Lancet 376 (2010) 431e439. [62] T. Blevins, J. Pullman, J. Malloy, et al., DURATION-5: Exenatide once weekly resulted in greater improvements in glycemic control compared with exe- natide twice daily in patients with type 2 diabetes, J. Clin. Endocrinol. Metab. 96 (2011) 1301e1310. [63] M. Diamant, L. Van Gaal, S. Stranks, et al., Once weekly exenatide compared with insulin glargine titrated to target in patients with type 2 diabetes (DURATION-3): An open-label randomised trial, Lancet 375 (2010) 2234e2243. [64] D.J. Drucker, J.B. Buse, K. Taylor, et al., Exenatide once weekly versus twice daily for the treatment of type 2 diabetes: A randomised, open-label, non- inferiority study, Lancet 372 (2008) 1240e1250. [65] D.M. Williams, H. Jones, J.W. Stephens, Personalized type 2 diabetes man- agement: An update on recent advances and recommendations, Diabetes Metab. Syndr. Obes. 15 (2022) 281e295. [66] F. Sugandh, M. Chandio, F. Raveena, et al., Advances in the management of diabetes mellitus: A focus on personalized medicine, Cureus 15 (2023), e43697. [67] J.P. Frías, M.J. Davies, J. Rosenstock, et al., Tirzepatide versus semaglutide once weekly in patients with type 2 diabetes, N. Engl. J. Med. 385 (2021) 503e515. [68] J.P. Frias, S. Hsia, S. Eyde, et al., Efﬁcacy and safety of oral orforglipron in patients with type 2 diabetes: A multicentre, randomised, dose-response, phase 2 study, Lancet 402 (2023) 472e483. [69] B. Zhang, Z. Cheng, J. Chen, et al., Efﬁcacy and safety of mazdutide in Chinese patients with type 2 diabetes: A randomized, double-blind, placebo- controlled phase 2 trial, Diabetes Care 47 (2024) 160e168. [70] W. Yang, D. Zhu, S. Gan, et al., Dorzagliatin add-on therapy to metformin in patients with type 2 diabetes: A randomized, double-blind, placebo- controlled phase 3 trial, Nat. Med. 28 (2022) 974e981. [71] P. Theurey, C. Thang, V. Pirags, et al., Phase 2 trial with imeglimin in patients with Type 2 diabetes indicates effects on insulin secretion and sensitivity, Endocrinol, Diabetes Metab. 5 (2022), e371. [72] The National Diabetes Education Program, Guiding Principles for the Care of People With or at Risk for Diabetes. https://www.niddk.nih.gov/health- information/professionals/clinical-tools-patient-management/diabetes/ guiding-principles-care-people-risk-diabetes. (Accessed 23 May 2023). [73] M. Uusitupa, T.A. Khan, E. Viguiliouk, et al., Prevention of type 2 diabetes by lifestyle changes: A systematic review and meta-analysis, Nutrients 11 (2019), 2611. [74] K.N.J. Burger, J.W.J. Beulens, Y.T. van der Schouw, et al., Dietaryﬁber, car- bohydrate quality and quantity, and mortality risk of individuals with dia- betes mellitus, PLoS One 7 (2012), e43127. [75] M.L. Wheeler, S.A. Dunbar, L.M. Jaacks, et al., Macronutrients, food groups, and eating patterns in the management of diabetes: A systematic review of the literature, 2010, Diabetes Care 35 (2012) 434e445. [76] P.R. Larsen, H.M. Kronenberg, S. Melmed, et al., Williams Textbook of Endocrinology, 10th edition, J. Pediatr. Adolesc. Gynecol. 17"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:026", "title": "46a2bb5d", "text": "Wheeler, S.A. Dunbar, L.M. Jaacks, et al., Macronutrients, food groups, and eating patterns in the management of diabetes: A systematic review of the literature, 2010, Diabetes Care 35 (2012) 434e445. [76] P.R. Larsen, H.M. Kronenberg, S. Melmed, et al., Williams Textbook of Endocrinology, 10th edition, J. Pediatr. Adolesc. Gynecol. 17 (2004) 217e218. [77] R. Estruch, E. Ros, J. Salas-Salvad/C19o, et al., Primary prevention of cardiovas- cular disease with a Mediterranean diet supplemented with extra-virgin olive oil or nuts, N. Engl. J. Med. 378 (2018), e34. [78] American Diabetes Association, Standards of medical care in diabetese2015: summary of revisions, Diabetes Care 38 (2015), S4. [79] A. Chudyk, R.J. Petrella, Effects of exercise on cardiovascular risk factors in type 2 diabetes: A meta-analysis, Diabetes Care 34 (2011) 1228 e1237. [80] E. Phielix, R. Meex, E. Moonen-Kornips, et al., Exercise training increases mitochondrial content and ex vivo mitochondrial function similarly in pa- tients with type 2 diabetes and in control individuals, Diabetologia 53 (2010) 1714e1721. [81] S. Balducci, G. Iacobellis, L. Parisi, et al., Exercise training can modify the natural history of diabetic peripheral neuropathy, J. Diabetes Complications 20 (2006) 216e223. [82] R.J. Sigal, G.P. Kenny, D.H. Wasserman, et al., Physical activity/exercise and type 2 diabetes: A consensus statement from the American Diabetes Asso- ciation, Diabetes Care 29 (2006) 1433e1438. [83] R.J. Sigal, M.J. Armstrong, et al., Canadian Diabetes Association Clinical Practice Guidelines Expert Committee, Physical activity and diabetes, Can. J. Diabetes 37 (2013) S40eS44. [84] Z. Guan, H. Li, R. Liu, et al., Artiﬁcial intelligence in diabetes management: Advancements, opportunities, and challenges, Cell Rep. Med 4 (2023), 101213. [85] R. Singla, A. Singla, Y. Gupta, et al., Artiﬁcial intelligence/machine learning in diabetes care, Indian J. Endocrinol. Metab. 23 (2019) 495e497. [86] J. Huang, A.M. Yeung, D.G. Armstrong, et al., Artiﬁcial intelligence for pre- dicting and diagnosing complications of diabetes, J. Diabetes Sci. Technol. 17 (2023) 224e238. [87] S.C. MacKenzie, C.A.R. Sainsbury, D.J. Wake, Diabetes and artiﬁcial intelli- gence beyond the closed loop: A review of the landscape, promise and challenges, Diabetologia 67 (2024) 223e235. [88] M. Khalifa, M. Albadawy, Artiﬁcial intelligence for diabetes: Enhancing pre- vention, diagnosis, and effective management, Comput. Meth. Programs Biomed. Update 5 (2024), 100141. [89] H. Taherdoost, A. Ghofrani, AI’s role in revolutionizing personalized medicine by reshaping pharmacogenomics and drug therapy, Intell. Pharm. 2 (2024) 643e650. [90] K.B. Johnson, W. Wei, D. Weeraratne, et al., Precision medicine, AI, and the future of personalized health care, Clin. Transl. Sci. 14 (2021) 86e93. [91] E.P.K. Bondzie, K. Amarteyﬁo, Y. Jahan, et al., Impact of health systems in- terventions in primary health settings on type 2 diabetes care and health outcomes among adults in West Africa: A systematic review, PLoS One 20 (2025), e0319478. [92] A. Nayak, S. Vakili, K. Nayak, et al., Use of voice-based conversational artiﬁcial intelligence for basal insulin prescription management among patients with type 2 diabetes: A randomized clinical trial, JAMA Netw. Open 6 (2023), e2340232. [93] A. Lim, A. Singh, J. Chiam, et al., Machine learning"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:027", "title": "46a2bb5d", "text": "20 (2025), e0319478. [92] A. Nayak, S. Vakili, K. Nayak, et al., Use of voice-based conversational artiﬁcial intelligence for basal insulin prescription management among patients with type 2 diabetes: A randomized clinical trial, JAMA Netw. Open 6 (2023), e2340232. [93] A. Lim, A. Singh, J. Chiam, et al., Machine learning approaches for type 2 diabetes prediction and care management, arXiv. 2021.https://arxiv.org/abs/ 2104.07820. [94] L. Lin, K. Liu, H. Feng, et al., Glucose trajectory prediction by deep learning for personal home care of type 2 diabetes mellitus: Modelling and applying, Math. Biosci. Eng. 19 (2022) 10096e10107. [95] J. Pettus, R. Roussel, F. Liz Zhou, et al., Rates of hypoglycemia predicted in patients with type 2 diabetes on insulin glargine 300 U/ml versusﬁrst- and second-generation basal insulin analogs: The real-world LIGHTNING study, Diabetes Ther 10 (2019) 617e633. [96] S.H.A. Faruqui, A. Alaeddini, Y. Du, et al., Nurse-in-the-loop artiﬁcial intelli- gence for precision management of type 2 diabetes in a clinical trial utilizing transfer-learned predictive digital twin, arXiv. 2024. https://arxiv.org/abs/ 2401.02661. [97] I. Dankwa-Mullan, M. Rivo, M. Sepulveda, et al., Transforming diabetes care through artiﬁcial intelligence: The future is here, Popul, Health Manag 22 (2019) 229e242. [98] E.B. Sloane, R.J. Silva, Artiﬁcial intelligence in medical devices and clinical decision support systems, in: E. Iadanza (Ed.), Clinical Engineering Hand- book, second ed., Elsevier, 2020, pp. 556e568. Chapter 83. [99] X. Zou, Y. Liu, L. Ji, Review: Machine learning in precision pharmacotherapy of type 2 diabetes-a promising future or a glimpse of hope?Digit, Health 9 (2023), 20552076231203879. [100] Y.B. Lee, G. Kim, J.E. Jun, et al., An integrated digital health care platform for diabetes management with AI-based dietary management: 48-week results from a randomized controlled trial, Diabetes Care 46 (2023) 959e966. [101] Y. Wu, H. Min, M. Li, et al., Effect of artiﬁcial intelligence-based health education accurately linking system (AI-HEALS) for type 2 diabetes self-management: Protocol for a mixed-methods study, BMC Public Health 23 (2023), 1325. [102] S.M. Ganie, M.B. Malik, T. Arif, Performance analysis and prediction of type 2 diabetes mellitus based on lifestyle data using machine learning approaches, J. Diabetes Metab. Disord. 21 (2022) 339e352. [103] F. Navazi, Y. Yuan, N. Archer, An examination of the hybrid meta-heuristic machine learning algorithms for early diagnosis of type II diabetes using big A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 13 data feature selection, Healthc. Anal. 4 (2023), 100227. [104] L. Zhang, X. Shang, S. Sreedharan, et al., Predicting the development of type 2 diabetes in a large Australian cohort using machine-learning techniques: Longitudinal survey study, JMIR Med, Inform 8 (2020), e16850. [105] S. Subramaniyan, R. Regan, T. Perumal, et al., Semi-supervised machine learning algorithm for predicting diabetes using big data analytics, in: A. Haldorai, A. Ramu, S.A.R. Khan (Eds.), Bus. Business Intelligence for En- terprise Internet of Things, Springer International Publishing, Cham, 2020, pp. 139e149. [106] L. Fregoso-Aparicio, J. Noguez, L. Montesinos, et al., Machine learning and deep learning predictive models for type 2 diabetes: A systematic"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:028", "title": "46a2bb5d", "text": "using big data analytics, in: A. Haldorai, A. Ramu, S.A.R. Khan (Eds.), Bus. Business Intelligence for En- terprise Internet of Things, Springer International Publishing, Cham, 2020, pp. 139e149. [106] L. Fregoso-Aparicio, J. Noguez, L. Montesinos, et al., Machine learning and deep learning predictive models for type 2 diabetes: A systematic review, Diabetol. Metab. Syndr. 13 (2021), 148. [107] T. Nibareke, J. Laassiri, Using Big Data-machine learning models for diabetes prediction and ﬂight delays analytics, J. Big Data 7 (2020), 78. [108] N.P. Tigga, S. Garg, Prediction of type 2 diabetes using machine learning classiﬁcation methods, Procedia Comput. Sci. 167 (2020) 706e716. [109] V. Mayya, S. Kamath S․, U. Kulkarni, Automated microaneurysms detection for early diagnosis of diabetic retinopathy: A Comprehensive review, Com- put. Meth. Programs Biomed. Update 1 (2021), 100013. [110] N. Hinchliffe, M.S. Capehorn, M. Bewick, et al., The potential role of digital health in obesity care, Adv. Ther. 39 (2022) 4397e4412. [111] N. Stein, K. Brooks, A fully automated conversational artiﬁcial intelligence for weight loss: Longitudinal observational study among overweight and obese adults, JMIR Diabetes 2 (2017), e28. [112] K.R. Azelton, A.P. Crowley, N. Vence, et al., Digital health coaching for type 2 diabetes: Randomized controlled trial of healthy at home, Front. Digit. Health 3 (2021), 764735. [113] M.M. Alvarado, H.C. Kum, K. Gonzalez Coronado, et al., Barriers to remote health interventions for type 2 diabetes: A systematic review and proposed classiﬁcation scheme, J. Med. Internet Res. 19 (2017), e28. [114] J. Goldstein, D. Weitzman, M. Lemerond, et al., Determinants for scalable adoption of autonomous AI in the detection of diabetic eye disease in diverse practice types: key best practices learned through collection of real-world data, Front. Digit. Health 5 (2023), 1004130. [115] R.P. Singh, G.L. Hom, M.D. Abramoff, et al., Current challenges and barriers to real-world artiﬁcial intelligence adoption for the healthcare system, pro- vider, and the patient, Transl. Vis. Sci. Technol. 9 (2020), 45. [116] J. Balsa, I. F/C19elix, A.P. Cl/C19audio, et al., Usability of an intelligent virtual assistant for promoting behavior change and self-care in older people with type 2 diabetes, J. Med. Syst. 44 (2020), 130. [117] P. Esmaeilzadeh, T. Mirzaei, S. Dharanikota, Patients' perceptions toward human-artiﬁcial intelligence interaction in health care: Experimental study, J. Med. Internet Res. 23 (2021), e25856. [118] Z. Dvey-Aharon, P. Huhtinen, Screening for diabetic retinopathy in endo- crinology clinics by using handheld cameras and applying artiﬁcial intelli- gence algorithms, J. Endocr. Soc. 5 (2021) A419eA420 . [119] B. Khan, H. Fatima, A. Qureshi, et al., Drawbacks of artiﬁcial intelligence and their potential solutions in the healthcare sector, Biomed. Mater. Devices (2023) 1e8. [120] A. Shah, W. Clarida, R. Amelon, et al., Validation of automated screening for referable diabetic retinopathy with an autonomous diagnostic artiﬁcial in- telligence system in a Spanish population, J. Diabetes Sci. Technol. 15 (2021) 655e663. [121] G. Krishnan, S. Singh, M. Pathania, et al., Artiﬁcial intelligence in clinical medicine: Catalyzing a sustainable global healthcare paradigm, Front. Artif. Intell. 6 (2023), 1227091. [122] M. Elhaddad, S. Hamam,"}
{"doc_id": "46a2bb5d", "page": 0, "chunk_id": "46a2bb5d:029", "title": "46a2bb5d", "text": "with an autonomous diagnostic artiﬁcial in- telligence system in a Spanish population, J. Diabetes Sci. Technol. 15 (2021) 655e663. [121] G. Krishnan, S. Singh, M. Pathania, et al., Artiﬁcial intelligence in clinical medicine: Catalyzing a sustainable global healthcare paradigm, Front. Artif. Intell. 6 (2023), 1227091. [122] M. Elhaddad, S. Hamam, AI-driven clinical decision support systems: An ongoing pursuit of potential, Cureus 16 (2024), e57728. [123] Z. Chen, N. Liang, H. Zhang, et al., Harnessing the power of clinical decision support systems: Challenges and opportunities, Open Heart 10 (2023), e002432. [124] I. Contreras, J. Vehi, Artiﬁcial intelligence for diabetes management and decision support: Literature review, J. Med. Internet Res. 20 (2018), e10775. [125] F. Mohsen, H.R.H. Al-Absi, N.A. Yousri, et al., A scoping review of artiﬁcial intelligence-based methods for diabetes risk prediction, NPJ Digit. Med. 6 (2023), 197. [126] C. Mennella, U. Maniscalco, G. De Pietro, et al., Ethical and regulatory chal- lenges of AI technologies in healthcare: A narrative review, Heliyon 10 (2024), e26297. A. Sen, P.S. Mohanraj, V. Laxmi et al. Journal of Pharmaceutical Analysis 15 (2025) 101305 14"}
