{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:000", "title": "mRNA Vaccine Tech", "text": "Leong et al. Virology Journal (2025) 22:71 https://doi.org/10.1186/s12985-025-02645-6 REVIEW Open Access © The Author(s) 2025, corrected publication 2025. Open Access This article is licensed under a Creative Commons Attribution-NonCom- mercial-NoDerivatives 4.0 International License, which permits any non-commercial use, sharing, distribution and reproduction in any medium or format, as long as you give appropriate credit to the original author(s) and the source, provide a link to the Creative Commons licence, and indicate if you modified the licensed material. You do not have permission under this licence to share adapted material derived from this article or parts of it. The images or other third party material in this article are included in the article’s Creative Commons licence, unless indicated otherwise in a credit line to the material. If material is not included in the article’s Creative Commons licence and your intended use is not permitted by statutory regulation or exceeds the permitted use, you will need to obtain permission directly from the copyright holder. To view a copy of this licence, visit http:// creat iveco mmons. org/ licen ses/ by- nc- nd/4. 0/. Virology Journal Revolutionizing immunization: a comprehensive review of mRNA vaccine technology and applications Kai Yuan Leong1, Seng Kong Tham1 and Chit Laa Poh1* Abstract Messenger RNA (mRNA) vaccines have emerged as a transformative platform in modern vaccinology. mRNA vaccine is a powerful alternative to traditional vaccines due to their high potency, safety, and efficacy, coupled with the abil- ity for rapid clinical development, scalability and cost-effectiveness in manufacturing. Initially conceptualized in the 1970s, the first study about the effectiveness of a mRNA vaccine against influenza was conducted in 1993. Since then, the development of mRNA vaccines has rapidly gained significance, especially in combating the COVID- 19 pandemic. Their unprecedented success during the COVID-19 pandemic, as demonstrated by the Pfizer-BioNTech and Moderna vaccines, highlighted their transformative potential. This review provides a comprehensive analysis of the mRNA vaccine technology, detailing the structure of the mRNA vaccine and its mechanism of action in induc- ing immunity. Advancements in nanotechnology, particularly lipid nanoparticles (LNPs) as delivery vehicles, have revolutionized the field. The manufacturing processes, including upstream production, downstream purification, and formulation are also reviewed. The clinical progress of mRNA vaccines targeting viruses causing infectious dis- eases is discussed, emphasizing their versatility and therapeutic potential. Despite their success, the mRNA vaccine platform faces several challenges, including improved stability to reduce dependence on cold chain logistics in trans- port, enhanced delivery mechanisms to target specific tissues or cells, and addressing the risk of rare adverse events. High costs associated with encapsulation in LNPs and the potential for unequal global access further complicate their widespread adoption. As the world continues to confront emerging viral threats, overcoming these challenges will be essential to fully harness the potential of mRNA vaccines. It is anticipated that mRNA vaccines will play a major role in defining and shaping the future of global health. Keywords MRNA vaccine, Lipid nanoparticles (LNPs), Multi-epitope mRNA design, Immunogenicity, MRNA vaccine against infectious disease Introduction Vaccination"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:001", "title": "mRNA Vaccine Tech", "text": "these challenges will be essential to fully harness the potential of mRNA vaccines. It is anticipated that mRNA vaccines will play a major role in defining and shaping the future of global health. Keywords MRNA vaccine, Lipid nanoparticles (LNPs), Multi-epitope mRNA design, Immunogenicity, MRNA vaccine against infectious disease Introduction Vaccination is one of the most effective approaches to prevent and control infectious diseases. Vaccination has long been recognized as one of the most impactful pub - lic health interventions, dramatically reducing morbidity and mortality from communicable diseases [1]. Vaccines have progressed from live attenuated and inactivated pathogens to subunit-based ones containing protein components to stimulate the immune response. Devel - oping recombinant viral-vector, virus-like particle, or protein-based vaccines is a significant advance in vaccine platforms [2]. These traditional vaccines have paved the way for controlling infectious diseases such as influenza, dengue, Japanese encephalitis, rabies virus, varicella (chickenpox), mumps, rotavirus, rubella, poliomyelitis, *Correspondence: Chit Laa Poh profpoh@alpsmedical.com 1 MyGenome, ALPS Global Holding Berhad, Kuala Lumpur, Malaysia Page 2 of 19Leong et al. Virology Journal (2025) 22:71 human papillomavirus (HPV), tetanus, measles, and diphtheria [3]. Although current vaccines have demonstrated their effectiveness, significant advancements are still needed to develop new vaccines or improve the efficacy of cur - rent vaccines. Traditional platforms, such as live attenu - ated and inactivated vaccines, remain widely utilized due to their stability and durability. However, live attenuated vaccines raise safety concerns, as they involve whole pathogens, which could revert to wild types. Subunit vac- cines offer improved safety and stability but require adju- vants to elicit strong immune responses. However, these conventional approaches usually require lengthy develop- ment timelines, involving costly processes and extensive optimizations, which could limit their responsiveness to emerging threats [4]. Epidemic outbreaks such as SARS and Ebola, and more recently the COVID-19 pandemic, have shown the limitations of existing vaccine technolo - gies, particularly their inability to provide rapid, cost- effective, and scalable solutions in response to emerging threats. To address these challenges, innovative vaccine technologies are essential for improving outbreak pre - paredness and ensuring global vaccine accessibility. The need for adaptable and rapid vaccine technologies has developed in response to concerns such as pandemics, caused by emerging zoonotic pathogens. The ideal vac - cine would combine efficacy, safety, stability, and broad protection across antigenic variants. While traditional methods continue to play a vital role, novel platforms like nucleic acid-based vaccines such as mRNA vaccines, have emerged as transformative innovations. Though the idea of effective in vitro transcribed mRNA vaccines in epitope presentation was first proposed in the early 1970s, it was not until the late 1990s that the mRNA vaccines were confirmed [2]. mRNA vaccines are nucleic acid-based vaccines that induce immune responses. Antigen-encoding mRNA is transported into a cell and translated into an antigenic protein in the cyto- plasm. Since the mRNA can elicit both humoral and cellular immunity by presenting an mRNA-encoded anti- gen, it has been regarded as a powerful vaccine system. The primary advantage of mRNA"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:002", "title": "mRNA Vaccine Tech", "text": "induce immune responses. Antigen-encoding mRNA is transported into a cell and translated into an antigenic protein in the cyto- plasm. Since the mRNA can elicit both humoral and cellular immunity by presenting an mRNA-encoded anti- gen, it has been regarded as a powerful vaccine system. The primary advantage of mRNA vaccines is their sig - nificantly shorter development timeline than traditional inactivated vaccines such as influenza which are typically produced using embryonated eggs and take 6–8 months. The COVID-19 pandemic acted as a proving ground for mRNA vaccine technology, catalyzing the rapid devel - opment of the Pfizer-BioNTech (BNT162b2) and Mod - erna (mRNA-1273) vaccines. The FDA approved the mRNA vaccines against COVID-19 under an Emer - gency Use Authorization less than one year after identi - fying the sequence of the spike protein of SARS-CoV-2 [5]. COVID-19 mRNA vaccines relied on the spike (S) protein of COVID-19 as the antigen, demonstrating high efficacy and safety profiles, heralding a new era of vac - cine design and development. The in vitro transcribed (IVT) reaction used to produce the antigenic protein is easy, and quick and produces mRNA transcripts with high yield. Beyond COVID-19, the versatility of mRNA vaccines offers immense potential for addressing a wide range of infectious diseases. mRNA vaccines offer several significant advantages over traditional vaccine platforms. These advantages include safety, as mRNA is non-infectious and does not integrate into the host DNA. They also exhibit high effi - cacy due to the selection of the antigen and epitope opti - mization that enhances stability and effectiveness while minimizing undesired immunogenicity. Furthermore, mRNA vaccines are produced in cell-free systems, which enable rapid, scalable, and cost-efficient production pro - cesses. Additionally, mRNA vaccines have the exceptional ability to encode multiple antigens, thereby enhancing immune responses against highly resilient pathogens [2]. The mRNA technology still faces significant hurdles, including instability due to degradation by RNases, ineffi- cient delivery, poor adaptive immune responses and elic - iting adverse inflammatory reactions. However, advances in chemical modifications of nucleotide components of mRNA, utilizing optimized delivery vehicles such as lipid nanoparticles (LNPs), and improved manufacturing pro - cesses have addressed these challenges, setting the stage for developing new vaccines with real-world applications. This review investigates scientific underpinnings, cur - rent applications, and potential future developments of mRNA vaccines, highlighting their transformative impact on modern medicine. mRNA vaccines Structure and design of mRNA mRNA vaccines rely on synthetic messenger RNA mole - cules designed to mimic natural mRNA. These molecules are engineered to encode specific antigenic proteins from the target pathogen, typically a viral surface protein. The structure of mRNA vaccines closely resembles that of eukaryotic mRNA, consisting of a single-stranded mole - cule featuring a 5′ cap, a 3′ poly(A) tail, and an open read- ing frame (ORF) flanked by untranslated regions (5′ and 3′ UTRs) as illustrated in Fig. 1. Structurally, mRNA vac- cines are optimize to ensure stability and efficient trans - lation. Five functional regions characterize the mRNA. 5′ Cap structure"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:003", "title": "mRNA Vaccine Tech", "text": "a 5′ cap, a 3′ poly(A) tail, and an open read- ing frame (ORF) flanked by untranslated regions (5′ and 3′ UTRs) as illustrated in Fig. 1. Structurally, mRNA vac- cines are optimize to ensure stability and efficient trans - lation. Five functional regions characterize the mRNA. 5′ Cap structure The 5′ Cap Structure is a chemically modified cap that facilitates efficient ribosome binding during transla - tion and can enhance stability of the mRNA. The cap is located at the 5′ end of the mRNA with different degrees Page 3 of 19 Leong et al. Virology Journal (2025) 22:71 of methylation. The 5′ end of the mRNA contains a cap with a 7-methylguanosine (m7G) moiety, followed by a triphosphate moiety connected to the first nucleotide (m7GpppN). The cap protects mRNA from exonucle - ase cleavage, regulates pre-mRNA splicing and initiates mRNA translation. Post-translational modifications such as 2′-O-methylation at position 2 of the ribose ring at the first nucleotide of Cap 0 give rise to Cap 1 which can increase translation efficiency and protein production [6]. Two primary methods are used to add a 5′ cap to mRNA molecules, which can enhance mRNA stabil - ity, translation efficiency, and reduce immunogenicity. The first approach involves a two-step multi-enzymatic reaction, where separate capping enzymes process an uncapped IVT mRNA [7]. While effective, this method is labor-intensive and time-consuming and may result in variable capping efficiency. The second and more advanced approach is a co-transcriptional method using CleanCap AG technology in combination with T7 RNA polymerase [8]. This method incorporates the cap struc - ture during mRNA synthesis, eliminating the need for any additional enzymatic steps. CleanCap AG technology achieves remarkable efficiency, producing mRNA after IVT reactions with concentrations up to 5 mg/ml and a high proportion (94%) of the desired cap 1 structure which is critical for enhanced stability and translational activity. Compared to first-generation cap analogues, such as mCap and ARCA, which predominantly result in the cap 0 structure, the CleanCap approach offers several advan - tages. Cap 0 structures, characterized by the absence of a methyl group at the 2′-O position of the ribose, are less effective in promoting robust protein translation and evading innate immune recognition [7]. In contrast, cap 1 structures provide enhanced protection against degra - dation by exonucleases and improved engagement with the translation machinery, which significantly boosts the overall efficacy of the mRNA vaccine. Cap 1 structure can be modified to yield the Cap 2 structure by additional methylation in the 2′-O position of the second nucleo - tide [9]. It has a significant impact on mRNA stability and translation efficiency. It can also reduce the activation of the innate immune response. Cap 1 analogues such as those with hydrophobic tags [10] and benzylated caps analogues m7GpppBn6AmpG were shown to enhance translation in vitro and in vivo besides facilitating easier mRNA purification [11]. Untranslated region structure The 5′ and 3′ untranslated regions (UTRs) of mRNA play essential roles in protein expression by regulating sta"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:004", "title": "mRNA Vaccine Tech", "text": "analogues such as those with hydrophobic tags [10] and benzylated caps analogues m7GpppBn6AmpG were shown to enhance translation in vitro and in vivo besides facilitating easier mRNA purification [11]. Untranslated region structure The 5′ and 3′ untranslated regions (UTRs) of mRNA play essential roles in protein expression by regulating sta - bility and translational efficiency. The 5′ UTR primarily facilitates the initiation of translation, while the 3′ UTR affects the stability and half-life of mRNA. The length, sequence and secondary structure of the 5′UTR were reported to play important roles in mRNA translation [12]. UTR sequences can be sourced from human alpha- globin or beta-globin genes to enhance their functionality in mRNA constructs. The 5′-UTR of mRNA plays an important function in protein translation. The choice of 5′-UTR sequence is critical, as it directly influences the efficacy of ribosome interaction with mRNA and the initiation of protein translation. The length of 5′-UTR can vary from 53 to 218 nucleotides [13]. The most common choice of 5′-UTRs are sequences derived from highly expressed human genes, such as alpha-globin or β-globin genes, which have proven their ability to produce good protein expres- sion levels [14]. The 5′ -UTR facilitates transcriptome assembly, and its sequence can either enhance or hinder transla - tion. This process begins during in vitro transcription (IVT), where the 5′ -UTR is transcribed as part of the full mRNA construct. Eukaryotic translation initiation starts with the assembly of the 43S pre-initiation com - plex (PIC), which includes methionyl initiation tRNA (Met-tRNAi) in complex with eukaryotic initiation fac - tor 2 (elF2) [15]. eIFs 1, 1A, 3, and 5 will bind to the PIC, where the mRNA will be recruited via the eIF4F complex which recognizes the 5′ cap structure [16]. This eIF4F complex comprises eIF4A, eIF4G, eIF4E, and the poly(A)-binding protein (PABP). The PIC scans the mRNA from the 5′ to 3 ′ end until it identifies an AUG start codon complementary to Met-tRNAi. The pairing of Met-tRNAi with the AUG codon signals the binding of the 60S ribosomal subunit, thus completing the assembly of the 80S ribosome, which is ready for protein synthesis [17]. During transcript assembly, structural features like internal ribosome entry sites (IRES) may be incorporated to improve mRNA stability and allow Fig. 1 Schematic diagram of an mRNA primary structure (5′ cap, untranslated regions, antigen coding region, 3′ poly-A tail) suitable for in vitro transcription (IVT). This figure is created by BioRender.com Page 4 of 19Leong et al. Virology Journal (2025) 22:71 cap-independent translation in specific contexts [15]. The 5′-UTR is capped with a Cap 1 structure using co- transcriptional methods like CleanCap technology [8 ]. This cap plays a pivotal role in recruiting the transla - tion initiation machinery while protecting the mRNA from degradation by exonucleases. The precise engi - neering of the 5′ -UTR ensures optimal interaction with the ribosome and translation factors, enabling robust protein synthesis while minimizing innate immune activation. Lengthy or highly structured 5′ UTR can prevent ribosome binding"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:005", "title": "mRNA Vaccine Tech", "text": "transla - tion initiation machinery while protecting the mRNA from degradation by exonucleases. The precise engi - neering of the 5′ -UTR ensures optimal interaction with the ribosome and translation factors, enabling robust protein synthesis while minimizing innate immune activation. Lengthy or highly structured 5′ UTR can prevent ribosome binding to the cap which can reduce mRNA translation efficiency. For optimal translation, GC-rich secondary structures in the 5′ UTR should be avoided. The incorporation of β-globin in the 5′ -UTR which resulted in the highest HIVgp145 expression was recently reported by Ma et al. [18]. The 3′-UTR located at the 3′ end of mRNA plays a vital role in mRNA localization, stability, and trans - lation efficiency, making it a key element in design - ing IVT mRNA. In IVT mRNA design, the 3′ -UTR is typically between 130 and 280 nucleotides, as shorter or longer 3′ -UTR can influence protein expression lev - els. Longer 3′ -UTRs generally have shorter half-lives, while shorter ones tend to reduce translation efficiency [19]. 3′ -UTR sequences can be sourced from human alpha-globin (HBA) or β-globin (HBB) genes as they function to enhance mRNA synthesis. It was reported that two repeats of the human β-globin at the 3′ -UTR (2hBg) of the HA gene in the mRNA vaccine construct were able to improve mRNA stability and increase pro - tein production, establishing it as a gold standard for IVT mRNA synthesis [20]. Zhuang et al. [21] reported that 5′ and 3′ -UTR incorporating β-globin produced higher levels of HA protein from IVT-mRNA. Besides, the incorporation of the human HSDI7B4 gene in the 5′-UTR and the human PSMB3 gene in the 3′ -UTR of CureVac AG’s second-generation mRNA SARS-CoV-2 vaccine resulted in higher protein expression, leading to improved immunogenicity and protective efficacy [22, 23]. Designing IVT mRNA should avoid AU-rich regions in the 3′ -UTR, as they shorten mRNA half-life [24]. Open reading frame (ORF) The open reading frame (ORF) is a critical determinant of the immunogenicity and translational efficiency of the mRNA vaccines. The coding sequence for the target antigen is meticulously optimized to facilitate optimum protein folding and translation efficiency regulation, with codon optimization playing a pivotal role. This process introduces functional peptides and ensures compatibil - ity with the human translation machinery, enhancing the translational process. To further protect the mRNA from exonuclease degradation, guanine and cytosine (GC) content is strategically increased, avoiding the inclusion of rare codons within the ORF [25]. Additionally, modifications to the mRNA nucleotides significantly improve its performance. Natural mRNA molecules are composed of four primary nucleotides: ATP , CTP , GTP , and UTP . Modified nucleotides such as N1-methyl pseudouridine (N1mѱ-UTP) and 5-methyl - cytidine have been shown to increase translational efficiency and lead to the effectiveness and safety of mRNA vaccines. For instance, mRNA incorporating N (1)-methyl-1-pseudouridine (m1ѱ) demonstrated up to 44-fold higher reporter gene expression when compared to pseudouridine (ѱ) modification upon transfection in several cell lines [26, 27]. These modified nucleotides can"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:006", "title": "mRNA Vaccine Tech", "text": "have been shown to increase translational efficiency and lead to the effectiveness and safety of mRNA vaccines. For instance, mRNA incorporating N (1)-methyl-1-pseudouridine (m1ѱ) demonstrated up to 44-fold higher reporter gene expression when compared to pseudouridine (ѱ) modification upon transfection in several cell lines [26, 27]. These modified nucleotides can be incorporated during in vitro transcription (IVT) to enhance mRNA functionality. While non-modified mRNA offers certain advantages, incorporating modified nucleotides provides significant benefits. These modi - fications help the IVT mRNA evade detection by the innate immune system, thus reducing the risk of adverse immune responses. Additionally, they enhance the trans - lation efficiency of the mRNA, ensuring more effective production of the desired antigen [28]. This enhancement reduces innate immune recogni - tion and improves mRNA stability, enabling robust and sustained protein expression, essential for eliciting a strong immune response. The functional properties of an mRNA vaccine can be enhanced by including a signal peptide of up to 30 amino acids long. It will determine the localization of the synthesized protein. The fusion of the MHC Class I trafficking signal to the C-terminus of the antigen significantly increases antigen presentation efficiency in human and murine dendritic cells. Efficient expansion of AG-specific CD8+ and CD4+ T-cells with improved effector functions was observed [29]. Poly(A) tail The poly (A) tail of mRNA is characterized by the pres - ence of 10–250 adenine ribonucleotide units at the 3′ end. The addition of the poly (A) tail ensures efficient translation and confers stability to the mRNA, aids in the export of the mRNA to the cytosol and is involved in the formation of a translation-competent ribonucleoprotein (RNP). Their length helps to regulate mRNA translation efficacy, stability and protein expression by reducing the RNA exonuclease activity. The 3′ end of the poly-A tail combines the polyA binding protein (PABPs) which sub - sequently interacts with the 5′ cap via eukaryotic trans - lation initiation factors elfG and elfE. Such interaction is responsible for promoting a closed-loop structure and increasing the affinity to the mRNA cap. At least 30–40 adenosines are necessary to inhibit the 5′ to 3 ′ and 3′ to Page 5 of 19 Leong et al. Virology Journal (2025) 22:71 5′ mRNA degradation pathways. An approved mRNA vaccine such as mRNA-1273 (Moderna) carries a homog- enous poly(A) tail comprising 100 adenosines. Besides a homogenous poly(A) tail, a segmented poly(A) contain - ing a specific linker sequence such as GCA UAU GACU was employed in the development of the BNT162b2 mRNA vaccine (Pfizer-BioNTech) [3]. Substitution of non-A nucleotides showed that cytosine (C) when added within the 3′ poly(A) tail was also effec - tive in enhancing and prolonging protein expression both in vitro and in vivo [30]. Two main strategies can be used for in vitro synthesis of poly(A) tails. One uses enzymes such as poly(A) polymerase to synthesize poly(A) tails after completion of mRNA transcription and the other uses co-transcriptional synthesis where poly(A) sequence which is already present on the plasmid DNA"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:007", "title": "mRNA Vaccine Tech", "text": "and in vivo [30]. Two main strategies can be used for in vitro synthesis of poly(A) tails. One uses enzymes such as poly(A) polymerase to synthesize poly(A) tails after completion of mRNA transcription and the other uses co-transcriptional synthesis where poly(A) sequence which is already present on the plasmid DNA is directly transcribed [32]. In vitro transcription (IVT) In vitro transcription (IVT)-based systems are used to synthesize mRNA, by transcribing the gene of interest in a DNA plasmid [33]. IVT produces mRNA by com - bining a linearized DNA template, bacteriophage T7 or SP6 RNA polymerase, NTPs, and a Cap analogue for co- transcription (Fig. 2). A polymerase chain reaction (PCR) can yield a DNA template. By including the T7 or SP6 RNA polymerase recognition site in the forward primer, PCR may convert the DNA fragment into a transcription template. The RNA polymerase promoter must be the upstream sequence of the DNA of interest to ensure suc - cessful transcription. To construct the IVT template plasmid, the process of designing and cloning the gene coding sequence (CDS) involves several critical steps to ensure accurate and efficient expression of the target protein. Constructing the IVT template plasmid The first step is to obtain the DNA sequence that will be translated into the protein with the inclusion of the start and stop codons. Optimization of codons is needed for the target antigen as this will signifi - cantly minimize the immunogenicity by incorporat - ing pseudo-UTPs and adjusting uridine (U) frequency. Additionally, the CDS must be checked for the pres - ence of restriction sites. If such sites are detected in the CDS, the codons will need to be modified while pre - serving the amino acid sequence, ensuring the needed codons will not be cut. Forward and reverse primers are designed with 15-base in-fusion sequences at their 5′ ends. The CDS is then amplified through PCR using these primers. The amplification will be performed to ensure the correct size and adequate quantity of the fragment. To get the maximum transcription yields, mRNA and the transcription medium must be free of impurities such as RNases, proteins and salts. Preparation of template DNA for IVT The preparation of template DNA for IVT can be achieved through linearization of the plasmid carrying the gene of interest. Linearization of the plasmid tem - plate involves the use of a restriction enzyme to cut the plasmid at a site that produces either a 5′ overhang or a blunt end. It is important to avoid leaving extra bases beyond the poly(A) tail, as this can compromise trans - lation efficiency. This approach results in a clean, high- quality DNA template essential for efficient IVT and downstream mRNA synthesis. Delivery systems for mRNA mRNA vaccine molecules are large (104–106 Da) and are negatively charged. One major challenge for mRNA vac - cines is the rapid degradation of naked mRNA which is inherently unstable and is highly susceptible to degrada - tion by extracellular ribonucleases (RNases). For the vac"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:008", "title": "mRNA Vaccine Tech", "text": "synthesis. Delivery systems for mRNA mRNA vaccine molecules are large (104–106 Da) and are negatively charged. One major challenge for mRNA vac - cines is the rapid degradation of naked mRNA which is inherently unstable and is highly susceptible to degrada - tion by extracellular ribonucleases (RNases). For the vac - cine to be effective, mRNA must be successfully recruited to ribosomes to be translated into a protein. Enhance - ments through mRNA engineering have been shown to increase and extend the functional half-life of mRNA substantially. To overcome this, mRNA vaccines are delivered into the cells by a transfecting agent or formu - lated with delivery vehicles, most commonly lipid nano - particles (LNPs) (Fig. 3). Recent advancements in LNP technology have dra - matically improved the delivery and efficacy of mRNA vaccines. Innovations in lipid chemistry have intro - duced biodegradable and biocompatible materials, reduced potential toxicity while maintained high delivery Fig. 2 In vitro transcription (IVT) of mRNA. This figure is created by BioRender.com Page 6 of 19Leong et al. Virology Journal (2025) 22:71 efficiency [34]. Emerging designs focus on tissue-specific targeting, such as delivering mRNA to antigen-present - ing cells (APCs) for a stronger immune response [35]. These advancements collectively enable more potent, safe, and tailored mRNA vaccines, marking a transforma- tive leap in vaccine delivery systems. Lipid nanoparticles (LNPs) LNPs have been approved for human use and are the only drug delivery system with clinical effectiveness. Nano - technology is rapidly emerging in the drug delivery sec - tor as it displays exceptional potential for in vivo delivery of biomolecules, drugs and vaccines [36]. These nano - particulate systems can overcome the limitations inher - ent in conventional formulations [37]. A particle size of approximately 50 nm for vaccines will lead to highly effi - cient delivery, irrespective of its chemical composition. LNPs act as protective shields for small molecules against enzymatic degradation, effectively minimizing vaccine protein degradation, phagocytic clearance and prolonged circulation time of the vaccines, allowing precise target - ing while reducing off-target effects [38]. LNPs also play a crucial role in enhancing cellular uptake by promoting endocytosis and efficient delivery of mRNA to target tis - sues, such as antigen-presenting cells (APCs). In addition to their targeted delivery capabilities, LNPs offer several other advantages. They are relatively easy to formulate and enable scale-up for large-scale production, exhibit a highly efficient transfection capacity, and possess a low toxicity profile, making them an ideal delivery system for mRNA vaccines [39]. These attributes collectively con - tribute to the effectiveness and practicality of LNPs in advanced vaccine development. Cationic lipids Advancements in lipid design have significantly enhanced the effectiveness of lipid nanoparticles (LNPs) for mRNA vaccine delivery. LNPs are composed of four key components: cationic lipids, ionizable lipids, choles - terol, and polyethylene glycol (PEG)-lipids, which create a stable and efficient delivery system. Ionizable lipids are now engineered to facilitate superior endosomal escape, ensuring efficient cytoplasmic release of mRNA and max- imizing protein translation [3]."}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:009", "title": "mRNA Vaccine Tech", "text": "vaccine delivery. LNPs are composed of four key components: cationic lipids, ionizable lipids, choles - terol, and polyethylene glycol (PEG)-lipids, which create a stable and efficient delivery system. Ionizable lipids are now engineered to facilitate superior endosomal escape, ensuring efficient cytoplasmic release of mRNA and max- imizing protein translation [3]. The charge of the LNP plays an essential role in transporting mRNA vaccines across biological membranes. Cationic lipids represent the first generation of lipids developed for mRNA vaccine delivery. These lipids contain a quaternary nitrogen atom, which confers a permanent positive charge. This positive charge allows cationic lipids to interact ionically with the negatively charged mRNA, forming a stable lipid-mRNA complex. Cationic lipids such as DOTMA, DOPE, and DOGS have been extensively utilized in mRNA delivery, demonstrating their effectiveness in facilitating efficient transfection [39]. The cationic liposome will interact with the anionic cell surface and endosomal membrane to release the mRNA cargo. The ideal pKa range for delivery of LNPs via the intravenous route is between 6.2 and 6.6 [2]. These lipids are also tailored for rapid biodegradability, reducing potential toxicity and improving patient safety. PEG‑lipid The composition of mRNA-LNP vaccines contributes to their stability. Using stealth-based nanomaterials is a common strategy for enhancing the stability and prolong- ing the circulation duration of mRNA molecules [40]. In this context, poly (ethylene glycol) (PEG) emerges as the gold standard for nanoparticle formation due to the hydrophilic nature of PEG, low cellular toxicity, and high biocompatibility [41]. The concept of PEGylation encom- passes the modification of biological molecules through covalent conjugation with PEG. PEGylation modifies the physical and chemical properties of the mRNA com - pounds, including their conformation, electrostatic bind - ing, and hydrophobicity [42]. This modification results in an improvement in the pharmacokinetic behavior and aqueous solubility of the molecule. The PEGylated lipid component in LNPs is linked to an anchoring lipid. PEG present in the LNP can improve the colloidal stability of LNPs in biological fluids. As PEG dissociates from the LNP surface, it decreases the circulation time of LNPs and delivers the mRNA cargo to its targeted cells. A few parameters of the PEG-Lipids can be adjusted to improve the encapsulation efficiency. For example, the amount of PEG is inversely proportional to the size of the LNP , hence, the higher the PEG content, the smaller the Fig. 3 mRNA encapsulated in Lipid nanoparticle. This figure is created by BioRender.com Page 7 of 19 Leong et al. Virology Journal (2025) 22:71 size of the LNP . A higher molecular weight of PEG and a longer lipid chain can increase the circulation time of the LNPs in the biological system. Cholesterol The main function of helper lipids in the formulation of LNPs lies in supporting their stability during storage and in vivo circulation. Helper lipids are glycerolipids and non-cationic. Sterols and phospholipids are the most used helper lipids. Including phospholipids as structural lipids in LNP formulations (account for 10–20% of total lipids) can help boost encapsulation while increasing cel"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:010", "title": "mRNA Vaccine Tech", "text": "formulation of LNPs lies in supporting their stability during storage and in vivo circulation. Helper lipids are glycerolipids and non-cationic. Sterols and phospholipids are the most used helper lipids. Including phospholipids as structural lipids in LNP formulations (account for 10–20% of total lipids) can help boost encapsulation while increasing cel - lular delivery. Cholesterol is usually incorporated in LNP formulation to maintain stability and it will affect the effi- cacy of LNP delivery. It helps by fusion with the endoso - mal membrane during the cellular uptake of LNPs. Polymeric nanoparticles Recent advancements in controlled release systems have highlighted the benefits of using polymer-based encap - sulations. Polymeric nanoparticles are submicron-sized colloidal particles that have become a versatile platform for incorporating, encapsulating, or adsorbing therapeu - tic agents onto their polymeric surface [43] (Fig. 4). These nanoparticles display exceptional potential for in vivo delivery of vaccines, biomolecules and drugs [36]. These carriers are composed of natural or synthetic polymers with a diameter of 1–1000 nm [44]. Polymer-based delivery systems, commonly known as polyplexes, are formed through electrostatic interac - tions between positively charged polymers and negatively charged nucleic acids. This interaction creates a protec - tive barrier around mRNA, shielding it from degradation and facilitating efficient cellular delivery [3]. The nucleic acid-polymer complexes protect nucleic acids from deg - radation by nucleases, enhancing the stability and effi - ciency of nucleic acid delivery, prolonging the circulation time of the nucleic acids, and allowing precise targeting while reducing off-target effects [38]. Polymers like poly - esters, poly (amino acids), and polyethyleneimine (PEI) have attracted significant interest due to their versatility in chemical modifications, enabling precise control over mRNA release profiles and biodegradability [3]. PEI, a cationic polymer, has been widely used in nucleic acid delivery systems because of its ability to form complexes via electrostatic interactions with negatively charged molecules [45]. However, their non-degradability and relatively poor biocompatibility limited their clinical application. The notable biocompatibility and biodeg - radability of polyesters have been used for mRNA deliv - ery. For example, poly(d-l-lactide-co-glycolide) (PLGA) offers a novel approach to overcoming physiological and pathological challenges, showing potential for efficient transfection and controlled release of the mRNA [46]. Poly (amino acids) (PAAs) have long been utilized for nucleic acid delivery. PAAs contain amphiphilic blocks of copolymers and thus can generate a core–shell structure [47]. The distinctive characteristics of PAAs include rapid metabolism, biodegradability and high selectivity for spe- cific targets, making them attractive candidates for func - tional and structural polymers [48]. PAAs are intriguing for biological applications because of their capacity to self-assemble into ordered and stable nanostructures, especially as vehicles for controlled drug delivery [49]. Other promising mRNA delivery systems While LNPs are the most established delivery system for mRNA vaccines, several other promising platforms are being developed to address specific challenges such as targeted delivery, reduced immunogenicity, and improved stability. Lipid-polymer hybrids combine the stability of polymers with the biocompatibility of lipids, enhancing cellular uptake and reducing toxicity [50]. Exosomes, naturally"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:011", "title": "mRNA Vaccine Tech", "text": "are the most established delivery system for mRNA vaccines, several other promising platforms are being developed to address specific challenges such as targeted delivery, reduced immunogenicity, and improved stability. Lipid-polymer hybrids combine the stability of polymers with the biocompatibility of lipids, enhancing cellular uptake and reducing toxicity [50]. Exosomes, naturally occurring extracellular vesicles, have emerged as a potential delivery system due to their innate ability to transport mRNA across biological barriers with minimal immune activation [51]. Peptide-based carriers leverage cell-penetrating peptides (CPPs) for efficient intracellular delivery and endosomal escape [52]. Addi - tionally, inorganic nanoparticles such as gold and silica nanoparticles have shown high stability and the potential for functionalization to target specific cell types [53]. Mechanism of the mRNA vaccines: cellular uptake and antigen production The mechanism of mRNA in promoting the adaptive immune response begins with its endocytosis of mRNA- LNP , followed by an endosomal escape to the cytosol after endocytosis-mediated internalization [15]. Intra - muscular injection leads to the transfection of muscle Fig. 4 The structure of polymeric nanoparticles encapsulated with biomolecules. This figure is created by BioRender.com Page 8 of 19Leong et al. Virology Journal (2025) 22:71 cells and tissue-resident antigen-presenting cells (APC) such as dendritic cells and macrophages. Once in the cytoplasm, the mRNA is translated by ribosomes into the target antigen. When a portion of the synthesized antigen is trans - ported on the surface of the antigen-presenting cells (APCs) and presented to B-lymphocytes, they differen - tiate into plasma cells that produce antibodies against the antigen. Through their receptors, B-cells can rec - ognize the antigen on the antigen-presenting cells, thus enabling their activation and initiating the production of pathogen-specific antibodies [54]. However, there is a clear reduction of anti-spike IgG against SARS-CoV-2 after 30 days [55]. Memory B-cells and long-lived plasma cells which secrete neutralizing antibodies are needed. Research efforts to elucidate how mRNA vaccines induce human germinal center (GC) responses [56] and extra - follicular (EF) B-cell pathways may lead to second-gen - eration mRNA platforms [57]. Another fraction of the antigen is secreted into the extracellular space, which can be taken up by other APCs and degraded in the phago - lysosome. These degraded antigens are then presented on the APC surface via MHC class II molecules [15]. Some of the antigens that have been synthesized are degraded into peptides by the proteasome within the same APC. These peptides are then displayed on the cell surface as part of the MHC class I molecules [58]. The humoral and cellular immune responses were elicited in response to mRNA vaccination. After the mRNA enters the cell, the polyA binding pro- tein (PABP) binds to the polyA tail and interacts with the eukaryotic translation initiation factor 4E (elF4E). elF4E interacts with 5′ cap, UTRs, PABP , initiator methionyl tRNA and 40 s ribosomal subunit, rendering the circula - tion of the mRNA and initiation complex formation [59]. After the 40 s ribosomal subunit scans the transcription initiation codon, the 60 s ribosomal"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:012", "title": "mRNA Vaccine Tech", "text": "eukaryotic translation initiation factor 4E (elF4E). elF4E interacts with 5′ cap, UTRs, PABP , initiator methionyl tRNA and 40 s ribosomal subunit, rendering the circula - tion of the mRNA and initiation complex formation [59]. After the 40 s ribosomal subunit scans the transcription initiation codon, the 60 s ribosomal subunit attaches elF4E are freed and amino acids are added to the growing chain. Once delivered to the target tissue, the mRNA-LNP complex is internalized into cells primarily through endocytosis, which engulfs extracellular materials into vesicles. Inside the cell, the mRNA-LNP complex faces its first critical challenge: endosomal escape. LNPs play a pivotal role here by destabilizing the endosomal mem - brane, often through the proton sponge effect or lipid fusion, which releases the mRNA into the cytoplasm [60]. Once in the cytoplasm, the mRNA is ready for transla - tion, where ribosomes recognize and bind to it, thus syn - thesizing the encoded antigenic protein. This antigenic protein undergoes further processing depending on its intended role. The protein is broken down into smaller peptides representing intracellular antigens which are then loaded onto major histocompat - ibility complex (MHC) class I molecules and presented on the cell surface [61]. This presentation activates cyto - toxic T cells, a crucial step in cellular immunity. Some of the IVT synthesized proteins are released extracellularly as secreted antigens where they can recruit and activate other immune cells, such as B-cells and helper T-cells, further amplifying the immune response [5]. This dual mechanism—cell surface antigen presentation and extra - cellular antigen secretion—ensures a strong and multi- faceted immune activation, making mRNA vaccines highly effective in stimulating both humoral and cellular immunity (Fig. 5). mRNA manufacturing mRNA vaccine against SARS-CoV-2 was the first trans - formative vaccine technology approved by both the FDA and EMA as a prophylactic vaccine. Currently, there are at least 41 COVID-19 mRNA vaccines in clinical tri - als worldwide [62]. Three typical stages are involved in mRNA vaccine manufacturing. Upstream production of mRNA The mRNA transcript is generated from the recombinant plasmid containing the gene(s) of interest. The reaction is known as in vitro transcription reaction (IVT). IVT enzy- matic reaction relies on RNA polymerase, enzymes such as inorganic pyrophosphatase (IPP), Cap 2′-O-methyl - transferase, poly(A) tail polymerase, guanylyltransferase, nucleotides (A, G, C and UTPs), magnesium-containing buffer and RNase inhibitors for the IVT reaction. Alter - natively, the co-transcriptional addition of a 5′ cap can be performed using CleanCap® Reagent AG [63]. Downstream purification mRNA produced by the IVT reaction is then isolated and purified by multiple purification steps in downstream processing. The IVT reaction mixture contains impuri - ties such as residual NTPs, enzymes, incorrectly formed mRNAs, double-stranded RNA and DNA plasmid tem - plates. Lab-scale purification of IVT mRNA can be achieved by DNA removal using DNase 1 digestion, fol - lowed by lithium chloride (LiCl) precipitation [64]. How - ever, the lab-based methods do not allow the complete removal of species such as dsRNA and truncated RNA"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:013", "title": "mRNA Vaccine Tech", "text": "and DNA plasmid tem - plates. Lab-scale purification of IVT mRNA can be achieved by DNA removal using DNase 1 digestion, fol - lowed by lithium chloride (LiCl) precipitation [64]. How - ever, the lab-based methods do not allow the complete removal of species such as dsRNA and truncated RNA fragments. The removal of these impurities is critical to obtaining a pure mRNA product with increased transla - tion efficiency and an no adverse immunostimulatory profile. Purifying modified mRNA through reverse-phase HPLC before delivering it to dendritic cells significantly increased mRNA transfection efficiency and related pro - tein production by 10- to 1000-fold [65]. Page 9 of 19 Leong et al. Virology Journal (2025) 22:71 Large-scale generation of mRNA by IVT under current good manufacturing practice (cGMP) conditions can be challenging. Specialized components of the IVT must be free of animal components and meet GMP-grade. The availability of large amounts of IVT components can incur high costs and the supply is limited. This is espe - cially true when referring to enzymes used for translation and the supply of CleanCap® Reagents AG. Following synthesis by IVT, the mRNA must be puri - fied from the reaction mixture by utilizing multiple puri - fication columns to attain clinical purity standards. The impurities include enzymes, residual NTPs, DNA tem - plates, dsRNA and truncated mRNAs. DNase 1 diges - tion and lithium chloride (LiCl) precipitation does not completely remove the dsRNA and truncated RNA fragments. Downstream processing for the purification of mRNA employs multiple chromatography processes. Size exclu - sion chromatography (SEC) was the first published large- scale purification approach for synthetically produced RNA oligonucleotides [66]. Despite having advantages such as selectivity, scalability and low cost, SEC cannot remove impurities such as dsRNA [67]. Ion pair reverse- phase chromatography (IPC) has proven to be an excel - lent approach for removing dsRNA impurities. However, IPC poses a challenge for large-scale processing as it uses toxic reagents such as acetonitrile for elution and is costly to scale up [68]. Cellulose-based chromatogra - phy columns can remove up to 90% of dsRNA and yield greater than 65% of mRNA, but it requires an optimum concentration of ethanol for binding [69]. Ion-exchange chromatography (IEC) can be used to perform large- scale purification of mRNA as it is cost-effective and scal- able. Weak anion exchange chromatography can resolve T7 RNA polymerase and unincorporated NTPs which do not bind to the columns. Affinity-based separation uti - lizes a single-stranded deoxythymidine (dT) to capture the mRNA. The OligodT binds to the poly(A) tails of the single-stranded mRNA and retains the mRNA target on the stationary phase while impurities are eluted from the column. IVT reagents, the DNA template and dsRNA can be removed. However, drawbacks include low bind - ing capacities and less cost-effectiveness. The use of mag- netic OligodT beads has been reported by Green and Sambrook [70] to improve the isolation of mRNA. Most column chromatography approaches are not cost-effec - tive. Tangential flow filtration has"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:014", "title": "mRNA Vaccine Tech", "text": "and dsRNA can be removed. However, drawbacks include low bind - ing capacities and less cost-effectiveness. The use of mag- netic OligodT beads has been reported by Green and Sambrook [70] to improve the isolation of mRNA. Most column chromatography approaches are not cost-effec - tive. Tangential flow filtration has emerged fast and effi - cient method for large-scale production of IVT [4]. The number of chromatography steps used in large scale pro - duction of mRNA can affect the stability and subsequent recovery of the mRNA vaccine product. Fig. 5 Schematic representation of the mRNA mechanism of action in promoting the adaptive immune response. This figure is created by BioRender.com Page 10 of 19Leong et al. Virology Journal (2025) 22:71 Emerging innovations in mRNA vaccine technology against viral pathogens COVID‑19 The success of mRNA vaccines during the COVID-19 pandemic has catalyzed a wave of innovations in the field, broadening the scope of mRNA vaccine applications and refining their design for enhanced efficacy. Early COVID-19 vaccines primarily targeted the full-length spike (S) protein of SARS-CoV-2, which proved effec - tive in eliciting robust immune responses. The mRNA vaccine BNT162b2 developed by Pfizer-BioNTech offered protection against severe COVID-19 disease by eliciting both humoral and cellular immunity against SARS-CoV-2. However, effective humoral and cellular immunity against SARS-CoV-2 was found to wane after six months. New waves of SARS-CoV-2 infections are caused by changes in the spike protein (S) which substan- tially decreases the efficacy of vaccines [71]. Vaccination with BNT162b2 was observed to modulate the innate immune responses which was reflected by higher IL-1/ IL-6 release and decreased IFN-ɣ production [72]. There was also a lack of neutralizing capacity against the omi - cron variant after six months. To overcome the lack of broad protection, a bivalent COVID-19 was developed and Li et al. [31] reported that mice immunized with Delta/ BA.5 mRNA vaccine were able to provide broad protection against Wuhan-Hu-1, Delta and Omicron variants, addressing antigenic drift and ensuring broader protection against evolving strains. Further advancements have included the development of multivalent mRNA-LNP vaccines targeting full-length spike proteins from various variants. Trivalent vaccines (WT + BA.5 + XBB1.5), pentavalent vaccines (WT + BA .5 + XBB1.5 + BQ1.1 + CH1.1), and even octavalent vac - cines (WT + BA.5 + XBB1.5 + BQ1.1 + CH1.1 + Alpha + Delta + BA.2) have been created to enhance immune response across a wider spectrum of variants. The pen - tavalent vaccine designed by Kumari et al. [73] showed superior protection against all tested variants. How - ever, with the emergence of new variants of concern like Omicron EG5.1, the pentavalent formulation was revised to include additional strains (WT + EG5.1 + X BB1.16 + Delta + BA.5), as reported by Yadav et al. [74]. This adjustment in the vaccine composition aims to pro - vide moderate protection against recent Omicron VOCs, demonstrated by pseudovirus-based neutralization stud - ies in mice. Influenza The mRNA vaccine platform has shown great promise in the development"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:015", "title": "mRNA Vaccine Tech", "text": "BB1.16 + Delta + BA.5), as reported by Yadav et al. [74]. This adjustment in the vaccine composition aims to pro - vide moderate protection against recent Omicron VOCs, demonstrated by pseudovirus-based neutralization stud - ies in mice. Influenza The mRNA vaccine platform has shown great promise in the development of vaccines against infectious diseases, it has also been used to develop universal mRNA vac - cines against influenza. The successful employment of the SARS-CoV-2 mRNA vaccine further accelerated the research and development of universal influenza mRNA vaccines. Two methods are being used for the devel - opment of universal influenza mRNA vaccines, using combined antigens or conserved antigens. Combined nucleoside-modified mRNA influenza vaccines including antigens from 20 different subtypes have shown promise as universal influenza vaccines. Freyn et al. [75] designed a multi-targeting nucleoside- modified mRNA influenza virus vaccine encapsulated in LNPs to target multiple conserved influenza antigens. These include hemagglutinin (HA) stalk, neuraminidase (NA), matrix protein 2 (M2), and nucleoprotein (NP). The nucleoside-modified mRNA-LNP vaccine elicited strong antigen-specific antibodies in mice, capable of neutralizing multiple influenza strains and the mice were protected against diverse heterotypic influenza viruses, including pre-pandemic H1N1 and avian-origin strains like H5N8 and cH6/1N5 [75]. Its ability to deliver multi - ple antigens in a single formulation enhanced the breadth of immunity, addressing challenges posed by antigenic variability. In comparison to the study reported by Freyn et al. [75] which incorporated multiple conserved influenza anti - gens, van de Ven et al. [76] designed a universal influenza mRNA vaccine targeting only the conserved internal proteins of the influenza virus, based on the nucleopro - tein (NP), matrix protein 1 (M1), and polymerase basic protein 1 (PB1). These proteins are critical for T-cell responses and offer protection against various hetero - subtypic influenza strains [76]. This approach provides a promising solution to mitigate the impact of seasonal influenza and potential pandemics caused by emerg - ing strains. Future research should focus on optimizing delivery routes and evaluating their efficacy in humans to accelerate their clinical translation. mRNA vaccine development against influenza has taken significant strides with the use of antigens derived from 20 different hemagglutinin (HA) proteins repre - senting both seasonal and pre-pandemic strains. Arevalo et al. [77] developed a multivalent nucleoside-modified mRNA vaccine encoding hemagglutinin (HA) antigens from all 18 known influenza A subtypes and 2 influenza B subtypes. The vaccine elicited robust and cross-reac - tive antibody responses in mice and ferrets, protect - ing against matched and mismatched viral strains. This protection was mediated primarily by neutralizing and non-neutralizing antibodies, including those capable of antibody-dependent cellular cytotoxicity (ADCC) [77]. The vaccine maintained long-lasting immunity without significant immunodominance biases. The study dem - onstrated the feasibility of mRNA vaccines in addressing Page 11 of 19 Leong et al. Virology Journal (2025) 22:71 the antigenic diversity of influenza viruses, paving the way for the development of universal influenza vaccines. Dengue Dengue viruses cause the most widely transmitted arbo - viral disease in subtropical and"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:016", "title": "mRNA Vaccine Tech", "text": "onstrated the feasibility of mRNA vaccines in addressing Page 11 of 19 Leong et al. Virology Journal (2025) 22:71 the antigenic diversity of influenza viruses, paving the way for the development of universal influenza vaccines. Dengue Dengue viruses cause the most widely transmitted arbo - viral disease in subtropical and tropical regions of the world. Annually, 390 million people are infected and 96 million display clinical manifestations [78]. The latest developed live-attenuated dengue vaccine, TAK-003, has an overall efficacy of 80.2% but dropped to 66.2% in den - gue-naïve and 76.1% in dengue-exposed individuals after 18 months [79]. However, in seronegative participants, vaccine efficacy was demonstrated against DENV-1 and DENV-2 but was not effective against DENV-3. Low inci- dence of DENV-4 infection in test sites precluded evalu - ations against DENV-4. Long-term efficacy and safety against DENV-3 and DENV-4 will need to be further monitored [80]. Recent advancements in mRNA vaccine research have significantly improved the stability of mRNA and the efficacy of delivery systems. These developments have paved the way for the use of mRNA vaccine technology in addressing infectious diseases such as HIV, Zika, Ebola fever, Lassa fever, Influenza and RSV viruses (Table 1). Zhang et al. [81] developed a DENV mRNA vac - cine targeting the DENV-2 strain 16,681 and each vac - cine candidate incorporated the prME, E80 or the NS-1 mRNA. Each coding sequence carried UTP modified with N1mѱ-UTP and Cap 1 was added by using the vaccinia capping system and an mRNA Cap 2′-O-meth - yltransferase. The mRNA was encapsulated in the LNP formulation comprising four lipids—D-Lin-MC3-DMA, DSPC, cholesterol, and PEG-lipid. mRNA vaccine can - didates carrying either the prME, E80 or NS1 pro - teins showed that all these three vaccine antigens were immunogenic. Vaccination with E80-mRNA alone or in combination with NS1-mRNA could induce high lev - els of neutralizing antibodies and antigen-specific T-cell responses. The mRNA vaccine was able to confer com - plete protection against the DENV-2 challenge in immu - nocompetent mice. These data paved the way to develop a tetravalent DENV vaccine based on mRNA technology. An mRNA-LNP vaccine encoding the prM and E pro - teins of the DENV-1 strain 16,007 encapsulated in LNP was developed by Wollner et al. [82]. The mRNA was transcribed in vitro using a T7 polymerase promoter, with a 5′ cap-1 structure and a 3′ poly(A) tail added. mRNA fragment length has been reported to affect mRNA sta - bility. A significant improvement in stability of was evi - dent in second generation Moderna COVID-19 mRNA vaccine with shorten N-terminal and S protein. The improved mRNA-1283 had an increase extension in shelf life from 6 to 12 months at 2–8 °C [83]. A two-dose vacci- nation protocol in AG129 mice elicited high neutralizing antibody titers and activation of CD4+ and CD8+ T-cells, comparable to natural infection. Immunocompromised AG129 mice vaccinated with the prM/E mRNA-LNP for- mulation showed no morbidity or mortality, maintained Table 1 Overview of mRNA Vaccine Candidates, Clinical Trial Stages,"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:017", "title": "mRNA Vaccine Tech", "text": "A two-dose vacci- nation protocol in AG129 mice elicited high neutralizing antibody titers and activation of CD4+ and CD8+ T-cells, comparable to natural infection. Immunocompromised AG129 mice vaccinated with the prM/E mRNA-LNP for- mulation showed no morbidity or mortality, maintained Table 1 Overview of mRNA Vaccine Candidates, Clinical Trial Stages, and Advantages, for Targeted Pathogens Pathogen Clinical Trial Phase Advantages References Ebola fever Pre-clinical Demonstrates the ability to induce durable antibody responses and T-cell immunity against key Ebola glycoproteins in animal models, with potential for rapid deployment during outbreaks. mRNA vaccines against EBOV elicited robust expression of IFN-γ and IL-2 by CD8+ and CD4+ T-cells [115, 135] Lassa fever Pre-clinical Induces robust neutralizing antibody responses targeting the Lassa virus glycoprotein and elicits cross-reactive immunity across multiple strains in preclinical studies [116, 117] HIV I Successfully elicits broadly neutralizing antibodies and CD8+ T-cell responses targeting conserved regions of the virus, with early results showing promise for overcoming strain variability [118, 119] Chikungunya I Safe and well-tolerated; induces high titers of neutralizing antibodies that correlate with pro- tection and show durability up to 12 months post-vaccination in early trials [120–122] Zika II Nucleoside-modified mRNA-LNP demonstrates rapid and robust induction of neutralizing antibodies that protect against Zika virus challenge in animal models and provide cross- protection with related flaviviruses in humans [123–126] Influenza A & B II Achieves strain-specific antibody responses and significant cross-reactivity across different influenza strains; offers the potential for universal flu vaccine development [75, 84, 127, 128] Respiratory syncytial virus (RSV) III 83.7% effective in a late-stage trial at preventing at least two symptoms of the cold-like disease caused by the virus in adults aged 60 years and over [129, 130] SARS-CoV-2 IV Highly effective (up to 95% efficacy in preventing symptomatic COVID-19); robust cellular and humoral responses, with significant protection against severe disease and hospitaliza- tions [85, 131–134] Page 12 of 19Leong et al. Virology Journal (2025) 22:71 stable weight post-infection and there was 100% survival. This mRNA-based vaccine elicited only serotype-specific immune responses and did not trigger antibody-depend - ent enhancement (ADE). Despite advancements in the development of live atten- uated vaccines, there remains a pressing need to develop a DENV vaccine which can elicit a robust and balanced immune response against all four serotypes. Address - ing this challenge, He et al. [84] developed a multi-target mRNA-LNP vaccine to confer protection across all 4 DENV serotypes. They developed a modified mRNA vac - cine encoding a chimeric antigen E carrying the immu - nodominant region of DENV-1 (E-DIII, 303–395 aa) and the DENV-2 non-structural protein 1 (NS1,1–302 aa). A second mRNA vaccine was constructed to carry E-DIII (DENV-4) + NS1 (DENV-3). A modified mRNA vaccine candidate encoding a type 1 (N7mGpppAm) cap, the N-terminal tissue plasminogen activator (tPA) signal sequence and a c-terminal vesicular stomatitis virus (VSV) G protein transmembrane region and the cytoplasmic domain (VSV-G TM + CD) [84]. 5′ and 3′ UTRs and an optimized targeted E-DIII and NS1 were constructed and formulated in LNPs."}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:018", "title": "mRNA Vaccine Tech", "text": "a type 1 (N7mGpppAm) cap, the N-terminal tissue plasminogen activator (tPA) signal sequence and a c-terminal vesicular stomatitis virus (VSV) G protein transmembrane region and the cytoplasmic domain (VSV-G TM + CD) [84]. 5′ and 3′ UTRs and an optimized targeted E-DIII and NS1 were constructed and formulated in LNPs. A robust immune response and high neutralizing antibodies that could block all four DENV serotypes in vitro, with - out significant ADE was observed in vitro. There was a bias towards a Th1 than a Th2 response. Intramuscular immunization was able to reduce transmission of DENV in vivo and vascular leakage was eliminated. Further testing in larger animal models is required before clinical trials, with future efforts focusing on developing a tetravalent vaccine that induces both humoral and cellular immunity without ADE effects. Challenges, future opportunities, and prospects Advancing mRNA vaccine design There are still issues in mRNA vaccines eliciting poor antibody response, hence innovative approaches to enhance the efficacy of mRNA vaccines need to be fur - ther explored. The potential of integrating enveloped virus-like particle (eVLP) technology to strengthen mRNA vaccine efficacy and adaptability in combat - ing SARS-CoV-2 infections has been reported by Hoff - mann et al. [85]. By engineering the SARS-CoV-2 spike cytoplasmic tail to carry a short amino acid sequence, comprising an endosomal sorting complex required for transport (ESCRT) and an ALG-2-interacting protein X [ALIX]-binding region or EABR, it was able to recruit the ESCRT-associated proteins to form eVLPs. Hoffmann et al. [85] reported the formation of eVLPs that mimic the structural properties of the virus. These eVLPs, expressed through mRNA delivery, demonstrated significantly improved immunogenicity in preclinical models, eliciting higher neutralizing antibody titers and robust T-cell responses compared to conventional spike-encoding mRNA vaccines. This strategy addresses a critical chal - lenge in mRNA vaccine design by enhancing optimum antigen presentation and immune recognition, offering a versatile platform for developing next-generation mRNA vaccines against SARS-CoV-2 and other pathogens. Immunoinformatics and vaccine development Traditional vaccine development has historically depended on empirical methods, requiring significant time, labor, and resources. However, the advent of immu- noinformatic approaches has ushered in a new era of vac- cine design that is more precise, efficient, and adaptable [86]. These advanced methods leverage computational tools and structural biology to overcome challenges and broaden the scope of vaccine applications. Recent efforts have focused on developing vaccines targeting multi - ple viral pathogens. Recently, Rcheulishvili et al. [87] demonstrated the application of the immunoinformatic approach to design a novel multi-epitope mRNA vaccine candidate for monkeypox, smallpox, and vaccinia virus in silico. In silico-designed multi-epitope vaccines have shown remarkable efficacy, eliciting robust immune responses against pathogens like Epstein-Barr Virus (EBV) [89]. These findings underscore the potential of immunoin - formatic-designed vaccines to revolutionize the field by identifying highly conserved epitopes that can offer broad protection by predicting high immunogenicity, minimizing allergenicity, and eliminating potential toxic - ity [90]. Computational approaches, such as antigenicity prediction, molecular docking, and structural modeling of viral proteins, play a"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:019", "title": "mRNA Vaccine Tech", "text": "the potential of immunoin - formatic-designed vaccines to revolutionize the field by identifying highly conserved epitopes that can offer broad protection by predicting high immunogenicity, minimizing allergenicity, and eliminating potential toxic - ity [90]. Computational approaches, such as antigenicity prediction, molecular docking, and structural modeling of viral proteins, play a pivotal role in identifying optimal epitopes for vaccine design [91]. Recent studies reported by Mukhtar et al. [92], Alsaiari et al. [93], and Ullah et al. [94], have demonstrated several modified mRNA-based vaccine constructs targeting pathogens like the four DENV serotypes using a computational approach. How - ever, the current research is still in the design phase and has yet to be validated. Multi‑epitope vaccine Most of the mRNA vaccines developed so far are based on whole proteins. This limits the incorporation of more proteins which can increase the immunogenicity of the mRNA vaccine. Incorporating numerous whole proteins as the vaccine raises the question of achieving equitable immunogenicity and increasing the cost of production. For example, Arevalo et al. [77] employed 18 HA-based mRNA against Influenza A strains. It is unknown if equi - table immune responses can be achieved against every strain and if similar protection can be afforded for each Page 13 of 19 Leong et al. Virology Journal (2025) 22:71 strain. If unequal protection is due to different levels of immune responses being elicited, the effectiveness of the 18 HA-mRNA-based vaccine can be affected. A key direction involves reducing whole proteins to only immu- nogenic peptides specifying B-cell, CD4+ T-cell, and CD8+T-cell epitopes responsible for translation in one mRNA molecule. This approach can substantially reduce the length of the mRNA and the IVT reaction can be more cost-effective while providing broad and durable immunity. Preclinical studies demonstrated that multi-target- based mRNA vaccines elicited strong humoral and cel - lular responses, improving cross-serotype protection of dengue [84]. Multi-target vaccines designed from multi - ple genes of a virus aim to broaden the immune response by incorporating conserved antigens from diverse viral proteins, increasing the likelihood of neutralizing the virus effectively. These vaccines target key functional regions which are conserved across the viral genome, such as structural and non-structural proteins, ensuring comprehensive protection even if the gene encoding one antigen mutates. This approach holds immense potential for addressing global health threats posed by emerging viral variants, offering a scalable, adaptable, and effective solution for preventing highly mutable genomes. Expanding this approach, multi-epitope vaccines take advantage of immunogenic regions from different viral genes to create a mosaic of epitopes, selected for their ability to elicit robust T-cell and B-cell responses. Advances in multi-epitope mRNA vaccines have revolu - tionized the approach to combating complex and highly variable pathogens. By including conserved epitopes from multiple strains, multi-epitope-based mRNA vac - cines address antigenic drift and shift which are com - mon challenges facing the development of influenza, SARS-CoV-2, dengue, and other viral diseases [95]. This approach shows promising effects in eliciting compre - hensive and long-lasting immunity. An example of a"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:020", "title": "mRNA Vaccine Tech", "text": "conserved epitopes from multiple strains, multi-epitope-based mRNA vac - cines address antigenic drift and shift which are com - mon challenges facing the development of influenza, SARS-CoV-2, dengue, and other viral diseases [95]. This approach shows promising effects in eliciting compre - hensive and long-lasting immunity. An example of a multi-epitope mRNA construct for a universal influenza vaccine was designed by Rcheulishvili et al. [88]. The multi-epitope vaccine separates the epitopes by link - ers (Fig. 6). Commonly used linkers include EAAAK, GPGPG, GGGGS, KK, and AAY [15]. The flexibility of mRNA platforms allows for rapid design to incorporate conserved epitopes from multiple strains or serotypes, thus enhancing the breadth of vaccine coverage [88]. Rare adverse effects associated with mRNA‑LNP vaccines Immune-related side effects associated with COVID-19 mRNA vaccines, such as allergic reactions and autoim - mune responses, have been reported [96]. Autoimmune responses may occur when the immune system mistak - enly identifies the antigens translated mRNA-LNP vac - cine as self-antigens, potentially leading to the activation of autoreactive B- or T-cells [96]. This phenomenon could result in the development of conditions such as myocarditis, autoimmune thrombocytopenia, or other inflammatory diseases [97]. While LNP technology is widely recognized for its effi - ciency and versatility in delivering mRNA, its use has raised concerns due to potential adverse effects linked to proinflammatory responses. A key component of LNP formulations, polyethylene glycol (PEG), plays an essen - tial role in preventing aggregation and stabilizing the par- ticles through steric hindrance. However, PEG has been identified as a possible source of allergenicity [98]. PEG has been implicated in anaphylaxis and pseudo-allergic reactions following mRNA vaccine administration [99]. Notably, most of these reactions are not classic type-1 IgE-mediated allergies but may involve IgE-independent pseudo-allergic pathways, such as complement activa - tion-related pseudo-allergy (CARPA) [100]. Additionally, widespread exposure to PEG in everyday products, such as cosmetics and pharmaceuticals, likely contributes to the development of pre-existing anti-PEG antibodies in some individuals. Hence, the immuno - genic potential of PEG is a critical concern, as repeated systemic exposure to PEG-containing products can lead Fig. 6 Schematic illustration of a multi-epitope mRNA construct, comprising of a 5’ Cap, 5’-UTR, signal peptide, adjuvant, His-Tag, 3′-UTR and poly(A) tails. B-cell epitopes are linked using KK amino acids; CD8+ T-cell epitopes are linked by the GPGPG amino acids; CD4+ T-cell epitopes are linked with AAY amino acids; signal peptide and adjuvant uses the EAAK amino acid linkers Page 14 of 19Leong et al. Virology Journal (2025) 22:71 to the formation of anti-PEG antibodies, which may trig - ger anaphylactoid reactions, including CARPA. This pre- existing immunity could explain some of the immediate allergic reactions observed following the first dose of mRNA-LNP vaccines [101]. Despite these concerns, the overall benefits of LNP- based mRNA vaccines far outweigh the risks, prompting ongoing research to better understand and mitigate these rare adverse events while enhancing the safety and effi - cacy of mRNA vaccine platforms. AI‑driven design of ionizable lipids for mRNA therapeutics"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:021", "title": "mRNA Vaccine Tech", "text": "mRNA-LNP vaccines [101]. Despite these concerns, the overall benefits of LNP- based mRNA vaccines far outweigh the risks, prompting ongoing research to better understand and mitigate these rare adverse events while enhancing the safety and effi - cacy of mRNA vaccine platforms. AI‑driven design of ionizable lipids for mRNA therapeutics Despite extensive research efforts, the current design of ionizable lipids for LNP delivery systems explores only a fraction of the immense diversity of potential chemi - cal structures. The integration of computer-aided design (CAD) and artificial intelligence (AI) in the development of ionizable lipids for mRNA-LNP formulations is revo - lutionizing the field. CAD is essential for LNP modifi - cation due to the complexity and diversity of structural features that influence mRNA delivery, stability, and effi - cacy. Traditional experimental methods of lipid design and screening are time-consuming and resource-inten - sive, limiting the exploration of vast chemical spaces, but AI-driven approaches offer the ability to rapidly evaluate and predict the performance of lipid candidates [102]. AI-driven tools streamline this process by identifying critical lipid properties and predicting their performance, enabling the rational design of LNPs tailored to specific therapeutic needs. This approach not only accelerates innovation but also enhances the scalability and precision of LNP formulations, critical for advancing next-genera - tion mRNA vaccines and therapies. Machine learning (ML) algorithms, such as artifi - cial neural networks (ANN) and LightGBM, have been employed to optimize lipid libraries by identifying critical structural features that enhance delivery efficiency. For example, Maharjan et al. [103] used ANN-DOE models to design superior mRNA-LNP vaccines, while Metwally et al. [104] demonstrated the efficacy of ML in predicting in vivo performance of siRNA-LNPs. AI-guided platforms like AGILE have further acceler - ated the screening process, evaluated thousands of lipid candidates, and produced experimentally validated hits [105]. These technologies facilitate the rational design of ionizable lipids tailored to specific delivery needs, such as targeting tissues or enhancing stability. Although the field is still nascent, the use of AI promises to streamline lipid development, enabling the creation of more effec - tive and scalable LNP formulations for diverse biomedi - cal applications, including vaccines, cancer therapies, and gene editing. Establishing comprehensive, open-access databases will be critical to harnessing the full potential of AI in lipid design and advancing mRNA vaccines and therapeutics. Storage and cold chain management Despite these AI advancements, challenges remain. Effi - cient delivery systems capable of targeting specific cells or tissues are still under development, with LNPs lead - ing the field. Innovations in LNP delivery systems sup - port the efficient expression of mRNA while minimizing exonuclease degradation. Most FDA-approved mRNA vaccines require storing mRNA-LNPs at low (− 20 °C) or ultra-low temperatures (− 80 °C), complicating the dis - tribution of mRNA vaccines in resource-limited settings [106]. As a result, the stringent requirements for cold chain logistics and storage of these vaccines significantly limit the clinical application and distribution of mRNA vaccines, due to the lack of transport links, refrigeration"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:022", "title": "mRNA Vaccine Tech", "text": "ultra-low temperatures (− 80 °C), complicating the dis - tribution of mRNA vaccines in resource-limited settings [106]. As a result, the stringent requirements for cold chain logistics and storage of these vaccines significantly limit the clinical application and distribution of mRNA vaccines, due to the lack of transport links, refrigeration facilities, or stable power supplies [102]. The instability of mRNA-LNPs during storage is predominantly caused by chemical degradation through hydrolysis and oxida - tion reactions [102]. When mRNAs are kept in an aque - ous environment for an extended time, the backbone of the mRNA will be cleaved, disrupting its secondary structure. To overcome this challenge, lyophilization has emerged as a promising strategy for improving mRNA- LNP stability and enabling storage at higher tempera - tures, for example in ambient temperatures or 4 °C. Moderna’s lyophilized cytomegalovirus (CMV) mRNA vaccine (mRNA-1647) is currently in phase 3 clinical tri - als and has ensured a shelf life of up to 18 months when stored at 5 °C. Research by Gerhardt et al. [107] revealed that mRNA-1647 remains stable for over 8 months at room temperature and more than 21 months when stored at 4 °C. Ai et al. [108] demonstrated that lyophilized and reconstituted mRNA-LNP vaccines provide comparable protection against the COVID-19 Omicron variant in mice when compared to freshly prepared mRNA-LNP formulations, even after 6 months of storage at 4 °C or 25 °C. Notably, long-term storage of the lyophilized mRNA-LNPs did not result in any significant changes in key parameters, including nanoparticle size, polydisper - sity index (PDI), encapsulation efficiency (EE), mRNA integrity, or lipid stability. This finding underscores the potential of lyophilization as a transformative approach to extend mRNA vaccine shelf life, minimize reliance on cold chain logistics, and facilitate global vaccine distri - bution, particularly in regions with limited refrigeration infrastructure. Lyophilization involves freeze-drying the mRNA- LNPs with cryoprotectants to prevent structural damage caused by ice crystal formation. The most common cryo - protectants are sugars as they form protective matrices around the microparticles and maintain stability [102]. Page 15 of 19 Leong et al. Virology Journal (2025) 22:71 Pfizer-BioNTech and Moderna Covid-19 mRNA-LNP formulations include sugars like sucrose to maintain LNP integrity during freezing [25]. Li et al. [109] showed that the cryoprotectant mixture—comprising 8.8% sucrose, 2% trehalose, and 0.04% mannitol—could enhance the structural integrity of mRNA-LNPs, enabling them to withstand temperature fluctuations better while signifi - cantly reducing lyophilization time. These findings high - light the potential of lyophilization as a critical strategy to address mRNA-LNP instability, enhance long-term sta - bility, and eliminate reliance on cold chain logistics. Such advancements are pivotal for the widespread distribution and implementation of mRNA-LNPs, particularly for global disease management initiatives that require scal - able and durable vaccine solutions. Another approach that can be implemented to improve mRNA stability and efficiency is self-amplifying mRNAs (saRNAs), and circular mRNAs (circRNAs). Both saR - NAs and circRNAs hold significant potential for the future of mRNA technology. SaRNAs are derived from"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:023", "title": "mRNA Vaccine Tech", "text": "management initiatives that require scal - able and durable vaccine solutions. Another approach that can be implemented to improve mRNA stability and efficiency is self-amplifying mRNAs (saRNAs), and circular mRNAs (circRNAs). Both saR - NAs and circRNAs hold significant potential for the future of mRNA technology. SaRNAs are derived from alphavirus genomes and contain replication machinery to amplify the mRNA payload, enabling lower doses to achieve therapeutic effects, reducing production costs, and improving scalability [110]. This amplification ability makes them particularly advantageous for mass immu - nization efforts. CircRNAs, unlike linear mRNAs, lack 5′ and 3′ ends, rendering them highly resistant to exonucle - ase-mediated degradation and offering superior stability and prolonged protein expression [111]. Their covalently closed ring structure further enhances their inherent stability, making them especially promising for vaccines that need to endure variable storage conditions [112]. Supporting this potential, Qu et al. [112] demonstrated that LNP-encapsulated circRNAs encoding the receptor- binding domain (RBD) of the Omicron variant elicited stronger immune responses and maintained robust RBD expression after two weeks of storage at room tempera - ture (~ 25 °C) compared to conventional LNP-encapsu - lated linear mRNA vaccines. mRNA purification and quality control The purification and quality control of mRNA are criti - cal steps in ensuring the efficacy, stability, and safety of mRNA vaccines. Following IVT, mRNA products often contain impurities such as DNA templates, enzymes, and double-stranded RNA (dsRNA) byproducts, which can compromise stability and induce unwanted immune responses [113]. Various purification techniques, includ - ing size exclusion chromatography (SEC), hydropho - bic interaction chromatography (HIC), reverse-phase high-performance liquid chromatography (RP-HPLC), and affinity-based methods (e.g., oligo-dT columns), have been developed to address these challenges [102]. Notably, RP-HPLC has been shown to eliminate dsRNA impurities effectively, enhancing mRNA translation effi - ciency by up to 1000-fold [65]. Advanced enzymatic treatments and multimodal chromatographic meth - ods are also emerging to further improve purity and scalability [114]. High-efficiency purification not only ensures compliance with regulatory standards but also lays the foundation for future advancements in mRNA vaccine technology, enabling consistent production of high-purity mRNAs for next-generation vaccines and therapeutics. This is especially critical as mRNA vac - cines expand beyond infectious diseases to target non- communicable diseases such as cancer and rare genetic disorders, where precision and reliability are paramount. Conclusion mRNA vaccine technology represents a breakthrough in immunology and vaccinology. With its ability to elicit robust immune responses, rapid adaptability to emerg - ing pathogens, and scalable manufacturing processes, it offers solutions to challenges faced by traditional vaccine platforms. Advancements in delivery systems, especially lipid nanoparticles (LNPs), have significantly improved mRNA vaccine performance by enhancing their stabil - ity, facilitating efficient cellular uptake, and boosting immunogenicity. These innovations have expanded the potential applications of mRNA vaccines across diverse medical challenges. Furthermore, innovations in nucleo - tide modifications, 5′ and 3′ UTR engineering, and codon optimizations have significantly improved mRNA sta - bility and translational efficiency. Besides the mRNA vaccine for SARS-CoV-2, three recent Phase 3 trials"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:024", "title": "mRNA Vaccine Tech", "text": "These innovations have expanded the potential applications of mRNA vaccines across diverse medical challenges. Furthermore, innovations in nucleo - tide modifications, 5′ and 3′ UTR engineering, and codon optimizations have significantly improved mRNA sta - bility and translational efficiency. Besides the mRNA vaccine for SARS-CoV-2, three recent Phase 3 trials for cytomegalovirus, Influenza A and B and Respiratory syn - cytial virus can lead to new clinically applicable vaccines in the near future. While the success of mRNA vaccines against COVID-19 highlights their potential, ongoing research into optimizing formulations, expanding the range of target pathogens, improving stability of mRNA constructs and thermostability will ensure that mRNA vaccines continue to revolutionize global public health. Author contributions KYL and CLP conceptualised and drafted this manuscript. KYL, CLP , HC and SKT reviewed and revised the manuscript. Funding Not applicable. Availability of data and materials All the data and materials supporting the conclusions were included in the main paper. Page 16 of 19Leong et al. Virology Journal (2025) 22:71 Declarations Ethics approval and consent to participate Not applicable. Consent for publication Not applicable. Competing interests The authors declare that they have no competing interests. Received: 24 December 2024 Accepted: 30 January 2025 References 1. Ghattas M, Dwivedi G, Lavertu M, Alameh M-G. Vaccine technologies and platforms for infectious diseases: current progress, challenges, and opportunities. Vaccines. 2021;9(12):1490. 2. Gote V, Bolla PK, Kommineni N, Butreddy A, Nukala PK, Palakurthi SS, et al. A comprehensive review of mRNA vaccines. Int J Mol Sci. 2023;24(3):2700. 3. Wu Z, Sun W, Qi H. Recent advancements in mRNA vaccines: from target selection to delivery systems. Vaccines. 2024;12(8):873. 4. Rosa SS, Prazeres DMF, Azevedo AM, Marques MPC. mRNA vac- cines manufacturing: challenges and bottlenecks. Vaccine. 2021;39(16):2190–200. 5. Kwon S, Kwon M, Im S, Lee K, Lee H. mRNA vaccines: the most recent clinical applications of synthetic mRNA. Arch Pharmacal Res. 2022;45(4):245–62. 6. Kruse S, Zhong S, Bodi Z, Button J, Alcocer MJC, Hayes CJ, et al. A novel synthesis and detection method for cap-associated adenosine modi- fications in mouse mRNA. Sci Rep. 2011. https:// doi. org/ 10. 1038/ srep0 0126. 7. Ramanathan A, Robb GB, Chan S-H. mRNA capping: biological func- tions and applications. Nucleic Acids Res. 2016;44(16):7511–26. https:// doi. org/ 10. 1093/ nar/ gkw551. 8. Henderson JM, Ujita A, Hill E, Yousif-Rosales S, Smith C, Ko N, et al. Cap 1 messenger RNA synthesis with co-transcriptional CleanCap® analog by in vitro transcription. Curr Protoc. 2021;1(2):e39. 9. Paramasivam A. RNA 2′-O-methylation modification and its implication in COVID-19 immunity. Cell Death Discov. 2020;6(1):118. 10. Inagaki M, Abe N, Li Z, Nakashima Y, Acharyya S, Ogawa K, et al. Cap analogs with a hydrophobic photocleavable tag enable facile purifica- tion of fully capped mRNA with various cap structures. Nat Commun. 2023;14(1):2657. 11. Warminski M, Trepkowska E, Smietanski M, Sikorski PJ, Baranowski MR, Bednarczyk M, et al. Trinucleotide mRNA cap analogue N6-benzylated at the site of posttranscriptional m6Am mark facilitates mRNA purifica- tion and confers superior translational properties in vitro and in"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:025", "title": "mRNA Vaccine Tech", "text": "fully capped mRNA with various cap structures. Nat Commun. 2023;14(1):2657. 11. Warminski M, Trepkowska E, Smietanski M, Sikorski PJ, Baranowski MR, Bednarczyk M, et al. Trinucleotide mRNA cap analogue N6-benzylated at the site of posttranscriptional m6Am mark facilitates mRNA purifica- tion and confers superior translational properties in vitro and in vivo. J Am Chem Soc. 2024;146(12):8149–63. 12. Chulakasian S, Chang T, Tsai C, Wong M, Hsu W. Translational enhancing activity in 5′ UTR of peste des petits ruminants virus fusion gene. FEBS J. 2013;280(5):1237–48. https:// doi. org/ 10. 1111/ febs. 12115. 13. Leppek K, Das R, Barna M. Functional 5′ UTR mRNA structures in eukary- otic translation regulation and how to find them. Nat Rev Mol Cell Biol. 2018;19(3):158–74. 14. Linares-Fernández S, Moreno J, Lambert E, Mercier-Gouy P , Vachez L, Verrier B, et al. Combining an optimized mRNA template with a double purification process allows strong expression of in vitro transcribed mRNA. Mol Ther Nucleic Acids. 2021;26:945–56. 15. Perenkov AD, Sergeeva AD, Vedunova MV, Krysko DV. In vitro tran- scribed RNA-based platform vaccines: past, present, and future. Vac- cines. 2023;11(10):1600. 16. Hinnebusch AG, Ivanov IP , Sonenberg N. Tranlational con- trol by 5’-untranslated regions of eukaryotic mRNAs. Science. 2016;352(6292):1413–6. 17. Sonenberg N, Hinnebusch AG. Regulation of translation initiation in eukaryotes: mechanisms and biological targets. Cell. 2009;136(4):731– 45. https:// doi. org/ 10. 1016/j. cell. 2009. 01. 042. 18. Ma Q, Zhang X, Yang J, Li H, Hao Y, Feng X. Optimization of the 5ʹ untranslated region of mRNA vaccines. Sci Rep. 2024;14(1):19845. 19. Orlandini Von Niessen AG, Poleganov MA, Rechner C, Plaschke A, Kranz LM, Fesser S, et al. Improving mRNA-based therapeutic gene delivery by expression-augmenting 3′ UTRs identified by cellular library screen- ing. Mol Ther. 2019;27(4):824–36. https:// doi. org/ 10. 1016/j. ymthe. 2018. 12. 011. 20. Holtkamp S, Kreiter S, Selmi A, Simon P , Koslowski M, Huber C, et al. Modification of antigen-encoding RNA increases stability, transla- tional efficacy, and T-cell stimulatory capacity of dendritic cells. Blood. 2006;108(13):4009–17. https:// doi. org/ 10. 1182/ blood- 2006- 04- 015024. 21. Zhuang X, Qi Y, Wang M, Yu N, Nan F, Zhang H, et al. mRNA vaccines encoding the HA protein of influenza A H1N1 virus delivered by cati- onic lipid nanoparticles induce protective immune responses in mice. Vaccines. 2020;8(1):123. 22. Gebre MS, Rauch S, Roth N, Yu J, Chandrashekar A, Mercado NB, et al. Optimization of non-coding regions for a non-modified mRNA COVID- 19 vaccine. Nature. 2022;601(7893):410–4. 23. Roth N, Schön J, Hoffmann D, Thran M, Thess A, Mueller SO, et al. Optimised non-coding regions of mRNA SARS-CoV-2 vaccine CV2CoV improves homologous and heterologous neutralising antibody responses. Vaccines. 2022;10(8):1251. 24. Fang E, Liu X, Li M, Zhang Z, Song L, Zhu B, et al. Advances in COVID-19 mRNA vaccine development. Signal Transduct Target Ther. 2022;7(1):94. 25. Schoenmaker L, Witzigmann D, Kulkarni JA, Verbeke R, Kersten G, Jiskoot W, et al. mRNA-lipid nanoparticle COVID-19 vaccines: structure and stability. Int J Pharm. 2021;601: 120586. 26. Monroe J, Eyler DE, Mitchell L, Deb"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:026", "title": "mRNA Vaccine Tech", "text": "Zhu B, et al. Advances in COVID-19 mRNA vaccine development. Signal Transduct Target Ther. 2022;7(1):94. 25. Schoenmaker L, Witzigmann D, Kulkarni JA, Verbeke R, Kersten G, Jiskoot W, et al. mRNA-lipid nanoparticle COVID-19 vaccines: structure and stability. Int J Pharm. 2021;601: 120586. 26. Monroe J, Eyler DE, Mitchell L, Deb I, Bojanowski A, Srinivas P , et al. N1-Methylpseudouridine and pseudouridine modifications modulate mRNA decoding during translation. Nat Commun. 2024;15(1):8119. 27. Karikó K, Muramatsu H, Welsh FA, Ludwig J, Kato H, Akira S, et al. Incorporation of pseudouridine into mRNA yields superior nonim- munogenic vector with increased translational capacity and biological stability. Mol Ther. 2008;16(11):1833–40. https:// doi. org/ 10. 1038/ mt. 2008. 200. 28. Hertler J, Slama K, Schober B, Özrendeci Z, Marchand V, Motorin Y, et al. Synthesis of point-modified mRNA. Nucleic Acids Res. 2022;50(20):e115. 29. Kreiter S, Selmi A, Diken M, Sebastian M, Osterloh P , Schild H, et al. Increased antigen presentation efficiency by coupling antigens to MHC class I trafficking signals. J Immunol. 2008;180(1):309–18. 30. Li CY, Liang Z, Hu Y, Zhang H, Setiasabda KD, Li J, et al. Cytidine-contain- ing tails robustly enhance and prolong protein production of synthetic mRNA in cell and in vivo. Mol Ther Nucleic Acids. 2022;30:300–10. 31. Li J, Liu Q, Liu J, Fang Z, Luo L, Li S, et al. Development of bivalent mRNA vaccines against SARS-CoV-2 variants. Vaccines. 2022;10(11):1807. 32. Brouze A, Krawczyk PS, Dziembowski A, Mroczek S. Measuring the tail: methods for poly(A) tail profiling. WIREs RNA. 2023;14(1):e1737. 33. Ladak RJ, He AJ, Huang Y-H, Ding Y. The current landscape of mRNA vaccines against viruses and cancer—a mini review. Front Immunol. 2022;13:885371. 34. Ezike TC, Okpala US, Onoja UL, Nwike CP , Ezeako EC, Okpara OJ, et al. Advances in drug delivery systems, challenges and future directions. Heliyon. 2023;9(6): e17488. 35. Yuan M, Han Z, Liang Y, Sun Y, He B, Chen W, et al. mRNA nanodelivery systems: targeting strategies and administration routes. Biomater Res. 2023;27(1):90. 36. Mahapatro A, Singh DK. Biodegradable nanoparticles are excellent vehicle for site directed in-vivo delivery of drugs and vaccines. J Nano- biotechnol. 2011;9(1):55. 37. Adepu S, Ramakrishna S. Controlled drug delivery systems: current status and future directions. Molecules. 2021;26(19):5905. 38. Martinho N, Damgé C, Reis CP . Recent advances in drug delivery sys- tems. J Biomater Nanobiotechnol. 2011;02(05):510–26. 39. Zhang W, Jiang Y, He Y, Boucetta H, Wu J, Chen Z, et al. Lipid carriers for mRNA delivery. Acta Pharmaceutica Sinica B. 2023;13(10):4105–26. 40. Wen P , Ke W, Dirisala A, Toh K, Tanaka M, Li J. Stealth and pseudo-stealth nanocarriers. Adv Drug Deliv Rev. 2023;198: 114895. Page 17 of 19 Leong et al. Virology Journal (2025) 22:71 41. Srivastava A, Yadav T, Sharma S, Nayak A, Akanksha Kumari A, Mishra N. Polymers in drug delivery. J Biosci Med. 2016;04(01):69–84. 42. Veronese FM, Mero A. The impact of PEGylation on biological therapies. BioDrugs. 2008;22(5):315–29. 43. Zielińska A, Carreiró F, Oliveira AM, Neves A, Pires B, Venkatesh DN, et al. Polymeric nanoparticles: production,"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:027", "title": "mRNA Vaccine Tech", "text": "T, Sharma S, Nayak A, Akanksha Kumari A, Mishra N. Polymers in drug delivery. J Biosci Med. 2016;04(01):69–84. 42. Veronese FM, Mero A. The impact of PEGylation on biological therapies. BioDrugs. 2008;22(5):315–29. 43. Zielińska A, Carreiró F, Oliveira AM, Neves A, Pires B, Venkatesh DN, et al. Polymeric nanoparticles: production, characterization, toxicology and ecotoxicology. Molecules. 2020;25(16):3731. 44. Jawahar N, Meyyanathan SN. Polymeric nanoparticles for drug delivery and targeting: a comprehensive review. Int J Health Allied Sci. 2012;1:217. 45. Cai X, Dou R, Guo C, Tang J, Li X, Chen J, et al. Cationic polymers as transfection reagents for nucleic acid delivery. Pharmaceutics. 2023;15(5):1502. 46. Makadia HK, Siegel SJ. Poly lactic-co-glycolic acid (PLGA) as biodegrad- able controlled drug delivery carrier. Polymers. 2011;3(3):1377–97. https:// doi. org/ 10. 3390/ polym 30313 77. 47. Tkachenko V, Vidal L, Josien L, Schmutz M, Poly J, Chemtob A. Charac- terizing the core–shell architecture of block copolymer nanoparticles with electron microscopy: a multi-technique approach. Polymers. 2020;12(8):1656. 48. Numata K. Poly(amino acid)s/polypeptides as potential functional and structural materials. Polym J. 2015;47(8):537–45. 49. Khuphe M, Thornton PD. 7. Poly(amino acids). In: Parambath A, editor. Engineering of biomaterials for drug delivery systems. Cambridge: Woodhead Publishing; 2018. p. 199–228. 50. Sivadasan D, Sultan MH, Madkhali O, Almoshari Y, Thangavel N. Polymeric lipid hybrid nanoparticles (PLNs) as emerging drug delivery platform—a comprehensive review of their properties, preparation methods, and therapeutic applications. Pharmaceutics. 2021;13(8):1291. 51. Koh HB, Kim HJ, Kang S-W, Yoo T-H. Exosome-based drug delivery: translation from bench to clinic. Pharmaceutics. 2023;15(8):2042. 52. He Y, Li F, Huang Y. Chapter Six. Smart cell-penetrating peptide-based techniques for intracellular delivery of therapeutic macromolecules. In: Donev R, editor. Advances in protein chemistry and structural biology, vol. 112. New York: Academic Press; 2018. p. 183–220. 53. Janjua TI, Cao Y, Kleitz F, Linden M, Yu C, Popat A. Silica nanoparticles: a review of their safety and current strategies to overcome biological barriers. Adv Drug Deliv Rev. 2023;203: 115115. 54. Weissman D. mRNA transcript therapy. Expert Rev Vaccines. 2015;14(2):265–81. 55. Goel RR, Painter MM, Apostolidis SA, Mathew D, Meng W, Rosenfeld AM, et al. mRNA vaccines induce durable immune memory to SARS-CoV-2 and variants of concern. Science. 2021;374(6572):abm0829. 56. Turner JS, O’Halloran JA, Kalaidina E, Kim W, Schmitz AJ, Zhou JQ, et al. SARS-CoV-2 mRNA vaccines induce persistent human germinal centre responses. Nature. 2021;596(7870):109–13. 57. Jenks SA, Cashman KS, Woodruff MC, Lee FE, Sanz I. Extrafollicular responses in humans and SLE. Immunol Rev. 2019;288(1):136–48. 58. Sijts EJAM, Kloetzel P-M. The role of the proteasome in the genera- tion of MHC class I ligands and immune responses. Cell Mol Life Sci. 2011;68(9):1491–502. https:// doi. org/ 10. 1007/ s00018- 011- 0657-y. 59. Martineau Y, Derry MC, Wang X, Yanagiya A, Berlanga JJ, Shyu A-B, et al. Poly(A)-binding protein-interacting protein 1 binds to eukaryotic translation initiation factor 3 to stimulate translation. Mol Cell Biol. 2008;28(21):6658–67. 60. Parvin N, Joo SW, Mandal TK. Enhancing vaccine efficacy and stability: a review of the utilization of nanoparticles in mRNA vaccines. Biomol- ecules. 2024;14(8):1036."}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:028", "title": "mRNA Vaccine Tech", "text": "A, Berlanga JJ, Shyu A-B, et al. Poly(A)-binding protein-interacting protein 1 binds to eukaryotic translation initiation factor 3 to stimulate translation. Mol Cell Biol. 2008;28(21):6658–67. 60. Parvin N, Joo SW, Mandal TK. Enhancing vaccine efficacy and stability: a review of the utilization of nanoparticles in mRNA vaccines. Biomol- ecules. 2024;14(8):1036. 61. Apcher S, Manoury B, Fåhraeus R. The role of mRNA translation in direct MHC class I antigen presentation. Curr Opin Immunol. 2012;24(1):71–6. 62. World Health Organization: WHO R&D Blueprint Team. https:// www. who. int/ publi catio ns/m/ item/ draft- lands cape- of- covid- 19- candi date- vacci nes (2023). Accessed 13 Dec 2024. 63. Tusup M, French LE, De Matos M, Gatfield D, Kundig T, Pascolo S. Design of in vitro transcribed mRNA vectors for research and therapy. Chimia. 2019;73(5):391. 64. Kwon H, Kim M, Seo Y, Moon YS, Lee HJ, Lee K, et al. Emergence of synthetic mRNA: In vitro synthesis of mRNA and its applications in regenerative medicine. Biomaterials. 2018;156:172–93. 65. Karikó K, Muramatsu H, Ludwig J, Weissman D. Generating the optimal mRNA for therapy: HPLC purification eliminates immune activation and improves translation of nucleoside-modified, protein- encoding mRNA. Nucleic Acids Res. 2011;39(21):e142. https:// doi. org/ 10. 1093/ nar/ gkr695. 66. Lukavsky PJ, Puglisi JD. Large-scale preparation and purification of polyacrylamide-free RNA oligonucleotides. RNA. 2004;10(5):889–93. https:// doi. org/ 10. 1261/ rna. 52648 04. 67. McKenna SA, Kim I, Puglisi EV, Lindhout DA, Aitken CE, Marshall RA, et al. Purification and characterization of transcribed RNAs using gel filtration chromatography. Nat Protoc. 2007;2(12):3270–7. 68. Baronti L, Karlsson H, Marušič M, Petzold K. A guide to large-scale RNA sample preparation. Anal Bioanal Chem. 2018;410(14):3239–52. https:// doi. org/ 10. 1007/ s00216- 018- 0943-8. 69. Baiersdörfer M, Boros G, Muramatsu H, Mahiny A, Vlatkovic I, Sahin U, et al. A facile method for the removal of dsRNA contaminant from in vitro-transcribed mRNA. Mol Ther Nucleic Acids. 2019;15:26–35. https:// doi. org/ 10. 1016/j. omtn. 2019. 02. 018. 70. Green MR, Sambrook J. Isolation of poly(A)(+ ) messenger RNA using magnetic oligo(dT) beads. Cold Spring Harb Protoc. 2019;2019(10):pdb-prot101733. 71. Malik JA, Ahmed S, Mir A, Shinde M, Bender O, Alshammari F, et al. The SARS-CoV-2 mutations versus vaccine effectiveness: new oppor - tunities to new challenges. J Infect Public Health. 2022;15(2):228–40. 72. Föhse K, Geckin B, Zoodsma M, Kilic G, Liu Z, Röring RJ, et al. The impact of BNT162b2 mRNA vaccine on adaptive and innate immune responses. Clin Immunol. 2023;255: 109762. 73. Kumari M, Liang K-H, Su S-C, Lin H-T, Lu Y-F, Wu M-J, et al. Multivalent mRNA vaccine elicits broad protection against SARS-CoV-2 variants of concern. Vaccines. 2024;12(7):714. 74. Yadav S, Zaman K, Bashyal P , Bhatta R, Bhandari S, Mohanty A, et al. Newer emerging SARS-COV2 variant: omicron EG5. Ann Med Surg. 2023;85(12):5845–6. 75. Freyn AW, RamosDaSilva J, Rosado VC, Bliss CM, Pine M, Mui BL, et al. A multi-targeting, nucleoside-modified mRNA influenza virus vaccine provides broad protection in mice. Mol Ther. 2020;28(7):1569–84. 76. Van Ven K, Lanfermeijer J, Van Dijken H,"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:029", "title": "mRNA Vaccine Tech", "text": "al. Newer emerging SARS-COV2 variant: omicron EG5. Ann Med Surg. 2023;85(12):5845–6. 75. Freyn AW, RamosDaSilva J, Rosado VC, Bliss CM, Pine M, Mui BL, et al. A multi-targeting, nucleoside-modified mRNA influenza virus vaccine provides broad protection in mice. Mol Ther. 2020;28(7):1569–84. 76. Van Ven K, Lanfermeijer J, Van Dijken H, Muramatsu H, Vilas Boas De Melo C, Lenz S, et al. A universal influenza mRNA vaccine candidate boosts T cell responses and reduces zoonotic influenza virus disease in ferrets. Sci Adv. 2022;8(50):eadc9937. 77. Arevalo CP , Bolton MJ, Le Sage V, Ye N, Furey C, Muramatsu H, et al. A multivalent nucleoside-modified mRNA vaccine against all known influenza virus subtypes. Science. 2022;378(6622):899–904. 78. Soni S, Gill VJS, Anusheel, Singh J, Chhabra J, Gill GJS, et al. Dengue, Chikungunya, and Zika: The causes and threats of emerging and re- emerging arboviral diseases. Cureus. 2023;15(7):e41717 79. López-Medina E, Biswal S, Saez-Llorens X, Borja-Tabora C, Bravo L, Sirivichayakul C, et al. Efficacy of a dengue vaccine candidate (TAK- 003) in healthy children and adolescents 2 years after vaccination. J Infect Dis. 2022;225(9):1521–32. 80. Tricou V, Yu D, Reynales H, Biswal S, Saez-Llorens X, Sirivichayakul C, et al. Long-term efficacy and safety of a tetravalent dengue vaccine (TAK-003): 4· 5-year results from a phase 3, randomised, double-blind, placebo-controlled trial. Lancet Glob Health. 2024;12(2):e257–70. 81. Zhang M, Sun J, Li M, Jin X. Modified mRNA-LNP vaccines confer protection against experimental DENV-2 infection in mice. Mol Ther Methods Clin Dev. 2020;18:702–12. 82. Wollner CJ, Richner M, Hassert MA, Pinto AK, Brien JD, Richner JM. A dengue virus serotype 1 mRNA-LNP vaccine elicits protective immune responses. J Virol. 2021;95(12):10–1128. 83. Stewart-Jones GBE, Elbashir SM, Wu K, Lee D, Renzi I, Ying B, et al. Development of SARS-CoV-2 mRNA vaccines encoding spike N-terminal and receptor binding domains. 2022. 84. He L, Sun W, Yang L, Liu W, Li J. A multiple-target mRNA-LNP vaccine induces protective immunity against experimental multi-serotype DENV in mice. Virologica Sinica. 2022;37(5):746–57. 85. Hoffmann MAG, Yang Z, Huey-Tubman KE, Cohen AA, Gnanapra- gasam PNP , Nakatomi LM, et al. ESCRT recruitment to SARS-CoV-2 spike induces virus-like particles that improve mRNA vaccines. Cell. 2023;186(11):2380-91.e9. 86. Oli AN, Obialor WO, Ifeanyichukwu MO, Odimegwu DC, Okoyeh JN, Emechebe GO, et al. Immunoinformatics and vaccine development: an overview. ImmunoTargets Ther. 2020;9:13–30. Page 18 of 19Leong et al. Virology Journal (2025) 22:71 87. Rcheulishvili N, Mao J, Papukashvili D, Feng S, Liu C, Yang X, et al. Development of a multi-epitope universal mRNA vaccine candidate for monkeypox, smallpox, and vaccinia viruses: design and in silico analyses. Viruses. 2023;15(5):1120. 88. Rcheulishvili N, Mao J, Papukashvili D, Liu C, Wang Z, Zhao J, et al. Designing multi-epitope mRNA construct as a universal influenza vac- cine candidate for future epidemic/pandemic preparedness. Int J Biol Macromol. 2023;226:885–99. 89. Althurwi HN, Alharthy KM, Albaqami FF, Altharawi A, Javed MR, Muhseen ZT, et al. mRNA-based vaccine designing against Epstein- Barr virus to induce an immune response using immunoinformatic and molecular modelling approaches. Int J Environ Res"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:030", "title": "mRNA Vaccine Tech", "text": "influenza vac- cine candidate for future epidemic/pandemic preparedness. Int J Biol Macromol. 2023;226:885–99. 89. Althurwi HN, Alharthy KM, Albaqami FF, Altharawi A, Javed MR, Muhseen ZT, et al. mRNA-based vaccine designing against Epstein- Barr virus to induce an immune response using immunoinformatic and molecular modelling approaches. Int J Environ Res Public Health. 2022;19(20):13054. 90. Ma S, Zhu F, Zhang P , Xu Y, Zhou Z, Yang H, et al. Development of a novel multi-epitope subunit mRNA vaccine candidate to combat Acinetobacter baumannii. Sci Rep. 2025;15(1):1410. 91. Oladipo EK, Adeniyi MO, Ogunlowo MT, Irewolede BA, Adekanola VO, Oluseyi GS, et al. Bioinformatics designing and molecular model- ling of a universal mRNA vaccine for SARS-CoV-2 infection. Vaccines. 2022;10(12):2107. 92. Mukhtar M, Wajeeha AW, Zaidi NUSS, Bibi N. Engineering modified mRNA-based vaccine against dengue virus using computational and reverse vaccinology approaches. Int J Mol Sci. 2022;23(22):13911. 93. Alsaiari AA, Hakami MA, Alotaibi BS, Alkhalil SS, Hazazi A, Alkhorayef N, et al. Rational design of multi-epitope-based vaccine by exploring all dengue virus serotypes proteome: an immunoinformatic approach. Immunol Res. 2024;72(2):242–59. 94. Ullah H, Ullah S, Li J, Yang F, Tan L. An in silico design of a vaccine against all serotypes of the dengue virus based on virtual screening of B-cell and T-cell epitopes. Biology. 2024;13(9):681. 95. Herrera-Ong LR. Strategic construction of mRNA vaccine derived from conserved and experimentally validated epitopes of avian influenza type A virus: a reverse vaccinology approach. Clin Exp Vaccine Res. 2023;12(2):156. 96. Lee Y, Jeong M, Park J, Jung H, Lee H. Immunogenicity of lipid nanopar- ticles and its impact on the efficacy of mRNA vaccines and therapeu- tics. Exp Mol Med. 2023;55(10):2085–96. 97. Chen Y, Xu Z, Wang P , Li X, Shuai Z, Ye D, et al. New-onset autoim- mune phenomena post-COVID-19 vaccination. Immunology. 2022;165(4):386–401. 98. Moghimi SM. Allergic reactions and anaphylaxis to LNP-based COVID- 19 vaccines. Mol Ther. 2021;29(3):898–900. 99. Kozma GT, Mészáros T, Berényi P , Facskó R, Patkó Z, Oláh CZ, et al. Role of anti-polyethylene glycol (PEG) antibodies in the allergic reactions to PEG-containing Covid-19 vaccines: evidence for immunogenicity of PEG. Vaccine. 2023;41(31):4561–70. 100. Barta BA, Radovits T, Dobos AB, Tibor Kozma G, Mészáros T, Berényi P , et al. Comirnaty-induced cardiopulmonary distress and other symptoms of complement-mediated pseudo-anaphylaxis in a hyperimmune pig model: Causal role of anti-PEG antibodies. Vaccine X. 2024;19:100497. 101. Igyártó BZ, Jacobsen S, Ndeupen S. Future considerations for the mRNA-lipid nanoparticle vaccine platform. Curr Opin Virol. 2021;48:65–72. 102. Lu R-M, Hsu H-E, Perez SJLP , Kumari M, Chen G-H, Hong M-H, et al. Current landscape of mRNA technologies and delivery systems for new modality therapeutics. J Biomed Sci. 2024;31(1):89. 103. Maharjan R, Hada S, Lee JE, Han H-K, Kim KH, Seo HJ, et al. Compara- tive study of lipid nanoparticle-based mRNA vaccine bioprocess with machine learning and combinatorial artificial neural network-design of experiment approach. Int J Pharm. 2023;640: 123012. 104. Metwally AA, Nayel AA, Hathout RM. In silico prediction of siRNA ionizable-lipid nanoparticles in vivo efficacy: machine learning mod-"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:031", "title": "mRNA Vaccine Tech", "text": "KH, Seo HJ, et al. Compara- tive study of lipid nanoparticle-based mRNA vaccine bioprocess with machine learning and combinatorial artificial neural network-design of experiment approach. Int J Pharm. 2023;640: 123012. 104. Metwally AA, Nayel AA, Hathout RM. In silico prediction of siRNA ionizable-lipid nanoparticles in vivo efficacy: machine learning mod- eling based on formulation and molecular descriptors. Front Mol Biosci. 2022;9:1042720. 105. Xu Y, Ma S, Cui H, Chen J, Xu S, Gong F, et al. AGILE platform: a deep learning powered approach to accelerate LNP development for mRNA delivery. Nat Commun. 2024;15(1):6305. 106. Young RE, Hofbauer SI, Riley RS. Overcoming the challenge of long-term storage of mRNA-lipid nanoparticle vaccines. Mol Ther. 2022;30(5):1792–3. 107. Gerhardt A, Voigt E, Archer M, Reed S, Larson E, Van Hoeven N, et al. A flexible, thermostable nanostructured lipid carrier platform for RNA vaccine delivery. Mol Ther Methods Clin Dev. 2022;25:205–14. 108. Ai L, Li Y, Zhou L, Yao W, Zhang H, Hu Z, et al. Lyophilized mRNA-lipid nanoparticle vaccines with long-term stability and high antigenicity against SARS-CoV-2. Cell Discov. 2023;9(1):9. 109. Li M, Jia L, Xie Y, Ma W, Yan Z, Liu F, et al. Lyophilization process optimi- zation and molecular dynamics simulation of mRNA-LNPs for SARS- CoV-2 vaccine. NPJ Vaccines. 2023;8(1):153. 110. Maruggi G, Mallett CP , Westerbeck JW, Chen T, Lofano G, Friedrich K, et al. A self-amplifying mRNA SARS-CoV-2 vaccine candidate induces safe and robust protective immunity in preclinical models. Mol Ther. 2022;30(5):1897–912. 111. Kristensen LS, Andersen MS, Stagsted LVW, Ebbesen KK, Hansen TB, Kjems J. The biogenesis, biology and characterization of circular RNAs. Nat Rev Genet. 2019;20(11):675–91. 112. Qu L, Yi Z, Shen Y, Lin L, Chen F, Xu Y, et al. Circular RNA vaccines against SARS-CoV-2 and emerging variants. Cell. 2022;185(10):1728-44.e16. 113. Lenk R, Kleindienst W, Szabó GT, Baiersdörfer M, Boros G, Keller JM, et al. Understanding the impact of in vitro transcription byproducts and contaminants. Front Mol Biosci. 2024;11:1426129. 114. Jin L, Song H, Tropea JE, Needle D, Waugh DS, Gu S, et al. The molecular mechanism of dsRNA processing by a bacterial Dicer. Nucleic Acids Res. 2019;47(9):4707–20. https:// doi. org/ 10. 1093/ nar/ gkz208. 115. Zhuang Z, Zhuo J, Yuan Y, Chen Z, Zhang S, Zhu A, et al. Harnessing T-cells for enhanced vaccine development against viral infections. Vac- cines. 2024;12(5):478. 116. Warner BM, Safronetz D, Stein DR. Current perspectives on vaccines and therapeutics for Lassa Fever. Virol J. 2024;21(1):320. 117. Ronk AJ, Lloyd NM, Zhang M, Atyeo C, Perrett HR, Mire CE, et al. A Lassa virus mRNA vaccine confers protection but does not require neutralizing antibody in a guinea pig model of infection. Nat Commun. 2023;14(1):5603. 118. Van Gulck E, Vlieghe E, Vekemans M, Van Tendeloo VFI, Van De Velde A, Smits E, et al. mRNA-based dendritic cell vaccination induces potent antiviral T-cell responses in HIV-1-infected patients. AIDS. 2012;26(4):F1–12. 119. Zhang P , Narayanan E, Liu Q, Tsybovsky Y, Boswell K, Ding S, et al. A multiclade env–gag VLP mRNA vaccine elicits tier-2 HIV-1-neutralizing antibodies"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:032", "title": "mRNA Vaccine Tech", "text": "Tendeloo VFI, Van De Velde A, Smits E, et al. mRNA-based dendritic cell vaccination induces potent antiviral T-cell responses in HIV-1-infected patients. AIDS. 2012;26(4):F1–12. 119. Zhang P , Narayanan E, Liu Q, Tsybovsky Y, Boswell K, Ding S, et al. A multiclade env–gag VLP mRNA vaccine elicits tier-2 HIV-1-neutralizing antibodies and reduces the risk of heterologous SHIV infection in macaques. Nat Med. 2021;27(12):2234–45. 120. August A, Attarwala HZ, Himansu S, Kalidindi S, Lu S, Pajon R, et al. A phase 1 trial of lipid-encapsulated mRNA encoding a monoclonal antibody with neutralizing activity against Chikungunya virus. Nat Med. 2021;27(12):2224–33. 121. Shaw CA, August A, Bart S, Booth P-GJ, Knightly C, Brasel T, et al. A phase 1, randomized, placebo-controlled, dose-ranging study to evalu- ate the safety and immunogenicity of an mRNA-based chikungunya virus vaccine in healthy adults. Vaccine. 2023;41(26):3898–906. 122. Ge N, Sun J, Liu Z, Shu J, Yan H, Kou Z, et al. An mRNA vaccine encod- ing Chikungunya virus E2–E1 protein elicits robust neutralizing antibody responses and CTL immune responses. Virologica Sinica. 2022;37(2):266–76. 123. Pardi N, Hogan MJ, Pelc RS, Muramatsu H, Andersen H, DeMaso CR, et al. Zika virus protection by a single low-dose nucleoside-modified mRNA vaccination. Nature. 2017;543(7644):248–51. 124. Salgado BB, Maués FCDJ, Jordão M, Pereira RL, Toledo-Teixeira DA, Parise PL, et al. Antibody cross-reactivity and evidence of susceptibility to emerging Flaviviruses in the dengue-endemic Brazilian Amazon. Int J Infect Dis. 2023;129:142–51. 125. Salem GM, Galula JU, Wu S-R, Liu J-H, Chen Y-H, Wang W-H, et al. Antibodies from dengue patients with prior exposure to Japanese encephalitis virus are broadly neutralizing against Zika virus. Commun Biol. 2024;7(1):15. 126. Essink B, Chu L, Seger W, Barranco E, Le Cam N, Bennett H, et al. The safety and immunogenicity of two Zika virus mRNA vaccine candidates in healthy flavivirus baseline seropositive and seronegative adults: the results of two randomised, placebo-controlled, dose-ranging, phase 1 clinical trials. Lancet Infect Dis. 2023;23(5):621–33. Page 19 of 19 Leong et al. Virology Journal (2025) 22:71 127. Wang W-C, Sayedahmed EE, Sambhara S, Mittal SK. Progress towards the development of a universal influenza vaccine. Viruses. 2022;14(8):1684. 128. Mazunina EP , Gushchin VA, Kleymenov DA, Siniavin AE, Burtseva EI, Shmarov MM, et al. Trivalent mRNA vaccine-candidate against seasonal flu with cross-specific humoral immune response. Front Immunol. 2024;15:1381508. 129. Redondo E, Rivero-Calle I, Mascarós E, Ocaña D, Jimeno I, Gil Á, et al. Respiratory syncytial virus vaccination recommendations for adults aged 60 years and older: the NeumoExperts Prevention Group position paper. Arch Bronconeumol. 2024;60(3):161–70. 130. Espeseth AS, Cejas PJ, Citron MP , Wang D, Distefano DJ, Callahan C, et al. Modified mRNA/lipid nanoparticle-based vaccines expressing respira- tory syncytial virus F protein variants are immunogenic and protective in rodent models of RSV infection. Npj Vaccines. 2020;5(1):16. 131. Tregoning JS, Brown ES, Cheeseman HM, Flight KE, Higham SL, Lemm N-M, et al. Vaccines for COVID-19. Clin Exp Immunol. 2020;202(2):162–92. 132. Mulligan MJ, Lyke KE, Kitchin N, Absalon J, Gurtman A, Lockhart S, et al. Phase 1/2 Study to Describe"}
{"doc_id": "mRNA_Vaccine_Tech", "page": 0, "chunk_id": "mRNA_Vaccine_Tech:033", "title": "mRNA Vaccine Tech", "text": "rodent models of RSV infection. Npj Vaccines. 2020;5(1):16. 131. Tregoning JS, Brown ES, Cheeseman HM, Flight KE, Higham SL, Lemm N-M, et al. Vaccines for COVID-19. Clin Exp Immunol. 2020;202(2):162–92. 132. Mulligan MJ, Lyke KE, Kitchin N, Absalon J, Gurtman A, Lockhart S, et al. Phase 1/2 Study to Describe the Safety and Immunogenicity of a COVID-19 RNA Vaccine Candidate (BNT162b1) in Adults 18 to 55 Years of Age: Interim Report. medRxiv. 2020:2020.06.30.20142570. 133. Laczkó D, Hogan MJ, Toulmin SA, Hicks P , Lederer K, Gaudette BT, et al. A single immunization with nucleoside-modified mRNA vaccines elicits strong cellular and humoral immune responses against SARS-CoV-2 in mice. Immunity. 2020;53(4):724-32.e7. 134. Ralise AEG, Camargo TM, Marson FAL. Phase 4 clinical trials in the era of the Coronavirus Disease (COVID-19) pandemic and their importance to optimize the COVID-19 vaccination. Hum Vaccines Immunother. 2023;19(2):2234784. 135. Rauch S, Jasny E, Schmidt KE, Petsch B. New vaccine technologies to combat outbreak situations. Front Immunol. 2018. https:// doi. org/ 10. 3389/ fimmu. 2018. 01963. Publisher’s Note Springer Nature remains neutral with regard to jurisdictional claims in pub- lished maps and institutional affiliations."}
