{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:000", "title": "Stability mRNA Vaccines", "text": "Citation: Cheng, F.; Wang, Y.; Bai, Y.; Liang, Z.; Mao, Q.; Liu, D.; Wu, X.; Xu, M. Research Advances on the Stability of mRNA Vaccines. Viruses 2023, 15, 668. https://doi.org/ 10.3390/v15030668 Academic Editor: Caijun Sun Received: 16 February 2023 Revised: 27 February 2023 Accepted: 28 February 2023 Published: 2 March 2023 Copyright: © 2023 by the authors. Licensee MDPI, Basel, Switzerland. This article is an open access article distributed under the terms and conditions of the Creative Commons Attribution (CC BY) license (https:// creativecommons.org/licenses/by/ 4.0/). viruses Review Research Advances on the Stability of mRNA Vaccines Feiran Cheng 1,2,† , Yiping Wang3,† , Yu Bai 1,2,† , Zhenglun Liang 1,2 , Qunying Mao 1,2 , Dong Liu 1,2 , Xing Wu 1,2, * and Miao Xu 1,2, * 1 National Medical Products Administration Key Laboratory for Quality Research and Evaluation of Biological Products, Institute of Biological Products, National Institutes for Food and Drug Control, Beijing 102600, China 2 National Health Commission Key Laboratory of Research on Quality and Standardization of Biotech Products, National Institutes for Food and Drug Control, Beijing 102600, China 3 Center for Reference Materials and Standardization, National Institutes for Food and Drug Control, Beijing 102600, China * Correspondence: eastarwx@163.com (X.W.); xumiaobj@126.com (M.X.) † These authors contributed equally to this work. Abstract: Compared to other vaccines, the inherent properties of messenger RNA (mRNA) vaccines and their interaction with lipid nanoparticles make them considerably unstable throughout their life cycles, impacting their effectiveness and global accessibility. It is imperative to improve mRNA vaccine stability and investigate the factors inﬂuencing stability. Since mRNA structure, excipients, lipid nanoparticle (LNP) delivery systems, and manufacturing processes are the primary factors affecting mRNA vaccine stability, optimizing mRNA structure and screening excipients can effectively improve mRNA vaccine stability. Moreover, improving manufacturing processes could also prepare thermally stable mRNA vaccines with safety and efﬁcacy. Here, we review the regulatory guidance associated with mRNA vaccine stability, summarize key factors affecting mRNA vaccine stability, and propose a possible research path to improve mRNA vaccine stability. Keywords: mRNA; vaccines; stability; lipid nanoparticle; degradation 1. Introduction Vaccine stability refers to the ability of a vaccine to maintain its physical, chemical, microbiological, and biological properties during its shelf time. To ensure vaccine quality, it is necessary to study and monitor the stability of the vaccine over its full life cycle, including the bulk, the ﬁnal product, and the period of their transportation and storage until the end of its shelf life. Messenger RNA (mRNA) serves as a template for protein translation [1]. The coronavirus disease 2019 (COVID-19) pandemic has accelerated the development of mRNA vaccines. According to the World Health Organization (WHO), two COVID-19 mRNA vaccines have been approved and over forty have entered clinical trials. Currently, there are also mRNA vaccines entered in clinical trials for the prevention and control of infectious diseases, cancer and genetic diseases. Due to the instability of mRNA, the vaccine produced by Pﬁzer needs to be kept below −70 degrees Celsius, while Moderna’s vaccine only needs to"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:001", "title": "Stability mRNA Vaccines", "text": "entered clinical trials. Currently, there are also mRNA vaccines entered in clinical trials for the prevention and control of infectious diseases, cancer and genetic diseases. Due to the instability of mRNA, the vaccine produced by Pﬁzer needs to be kept below −70 degrees Celsius, while Moderna’s vaccine only needs to be kept below−20 degrees Celsius, which has restricted access to effective immunization for populations in underdeveloped countries and resulted in the discarding of a large number of prepared vaccines [2]. Thus, stability is a bottleneck for the development and application of mRNA vaccines. The stability of mRNA vaccines has been studied both in vivo and in vitro. In vivo stability is associated primarily with the inherent properties of mRNA, including the opti- mization of the regulatory region, coding sequence, 5′-cap, poly-A tail, and untranslated region of the mRNA. In vitro stability is associated primarily with critical quality attributes (CQAs), such as mRNA integrity, fragment length, lipid nanoparticle (LNP) particle size, Viruses 2023, 15, 668. https://doi.org/10.3390/v15030668 https://www.mdpi.com/journal/viruses Viruses 2023, 15, 668 2 of 16 and lipid composition. Factors including mRNA structure, LNP delivery systems, ex- cipients, and manufacturing processes could affect mRNA vaccine stability. Given the inherently unstable characteristics of mRNA vaccine components, improving stability is a key method to enhance the effectiveness of mRNA vaccines. To enhance and guide vaccine development and quality control, the WHO, Inter- national Council for Harmonization of Technical Requirements for Pharmaceuticals for Human Use (ICH), and various national drug regulatory authorities have issued regu- lations and guidelines for stability studies and introduced a new concept of risk-based stability prediction and statistical models for vaccine stability studies in recent years [3]. More importantly, exploring the mRNA vaccine degradation mechanisms and inﬂuencing factors could contribute to mRNA vaccine development in the future. 2. Regulatory Documents and Guidelines Related to Vaccine Stability The WHO published the document Stability of Vaccines in 1989 [4]. A 1998 revision emphasized the effect of temperature on vaccine stability [ 5]. The 1995 document, ICH Q5C Quality of Biotechnological Products: Stability Testing of Biotechnological/Biological Products, mentioned that studies on biological product stability are based on appropriate testing of biological activity [ 6]. In 2006, the WHO guidelines for stability evaluation of vaccines suggested that stability study parameters should be selected based on the characteristics of different vaccines [7]. The 2011 revision of these guidelines suggested that stability studies should examine environmental factors, such as temperature, light, freeze- thaw, and physical stress [8]. The United States Pharmacopeia, European Pharmacopoeia, Chinese Pharmacopoeia, and relevant regulatory authorities such as the United States Food and Drug Administration (FDA), European Medicines Agency (EMA), and Center for Drug Evaluation (CDE) of the National Medical Products Administration of the People’s Republic of China have also proposed requirements for vaccine stability studies [9,10]. For mRNA vaccines, the European Union issued the Investigational Medicinal Product Dossier document in 2006. The document stated that the CQAs of mRNA vaccine products include mRNA integrity, content, and potency [11]. In 2020, the CDE issued the"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:002", "title": "Stability mRNA Vaccines", "text": "Republic of China have also proposed requirements for vaccine stability studies [9,10]. For mRNA vaccines, the European Union issued the Investigational Medicinal Product Dossier document in 2006. The document stated that the CQAs of mRNA vaccine products include mRNA integrity, content, and potency [11]. In 2020, the CDE issued the Technical Guidelines on Research and Development of COVID-19 Prophylactic mRNA Vaccines (draft edition). These guidelines emphasized that mRNA vaccine stability studies and evaluations should follow the relevant guidelines for stability studies of biological products. In addition, conditions to be examined should include temperature, pH, light, humidity, and a number of freeze-thaw cycles. Finally, there should be a focus on physicochemical properties and expression efﬁciency, such as encapsulation efﬁciency, particle size, and active ingredient content [12]. In 2021, the WHO issued a guideline document stating that mRNA vaccine stability indicators include appearance, mRNA content, vaccine potency, mRNA integrity, encapsulation efﬁciency, particle size, polydispersity, and impurities associated with mRNA and lipids [13]. In addition, accelerated stability and stress studies must be carried out to support shelf-life prediction. An mRNA vaccine contains lipid nanoparticles and nucleic acids. The Liposomal Drug Products: Chemistry, Manufacturing, and Controls; Human Pharmacokinetic and Bioavail- ability; and Labeling Documentation document issued in 2018 by the FDA noted CQAs for liposome drug products, including particle size, size distribution, and morphology, and emphasized studying the physical, chemical, and microbiological stability of liposo- mal drugs, as well as the stability of lipid components in liposomal drugs and enclosed drugs [14]. In 2022, the CDE published the Technical Guidelines for the Pharmacological Study and Evaluation of In Vivo Gene Therapy Products (draft edition). The document lists the corresponding technical requirements for in vivo gene therapy products, such as nucleic acid-based products, and states that product design should consider elements such as the 5 ′-cap, poly-A tail, nucleic acid modiﬁcations, and delivery systems, which also affect mRNA stability [15]. The stability guidelines and regulations issued by the WHO and agencies in the U.S., Europe, and China all include results, statistics, and analysis of stability studies. Among Viruses 2023, 15, 668 3 of 16 them, the ICH Q1E is a comprehensive and speciﬁc guideline for the statistical analysis of stability data [16]. In addition, the document proposes a general framework for time-series regression analysis of quantitative indicators (e.g., content, degradation products) and conditions for combining different batches for shelf-life prediction. Analytical software predicts the expiration date by determining the earliest time at which the 95% conﬁdence limits of the mean values intersect with the proposed acceptable criteria. Statistical analysis of the stability results enables the identiﬁcation of ﬂuctuations in product stability and provides a scientiﬁc basis for setting the validity period (Table 1). Table 1. Regulations and guidelines related to vaccine stability. Issue Date Name of Regulation Issuing Agency /Country Reference 1989 Stability of vaccines (WHO/EPI/GEN/89.08) WHO [4] 1995 Stability testing of biotechnological/biological products—Scientiﬁc guideline (ICH Q5C) ICH [6] 1998 Thermostability of vaccines (WHO/GPV/98.07) WHO [5] 2003 Evaluation for Stability Data Q1E ICH [16] 2003"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:003", "title": "Stability mRNA Vaccines", "text": "Regulations and guidelines related to vaccine stability. Issue Date Name of Regulation Issuing Agency /Country Reference 1989 Stability of vaccines (WHO/EPI/GEN/89.08) WHO [4] 1995 Stability testing of biotechnological/biological products—Scientiﬁc guideline (ICH Q5C) ICH [6] 1998 Thermostability of vaccines (WHO/GPV/98.07) WHO [5] 2003 Evaluation for Stability Data Q1E ICH [16] 2003 Stability Testing of New Drug Substances and Products Q1A(R2) ICH [17] 2011 Guidelines on Stability Evaluation of Vaccines WHO [8] 2012 Controlled Temperature Chain (CTC) Guidelines WHO [18] 2013 Extended Controlled Temperature Conditions (ECTC) Guidelines WHO [19] 2015 Technical Guidelines for Stability Studies of Biological Products CDE/China [9] 2018 Liposomal Drug Products: Chemistry, Manufacturing, and Controls; Human Pharmacokinetic and Bioavailability; and Labeling Documentation FDA/USA [14] 2020 2020 Chinese Pharmacopoeia Section 4 Regulation 9402 Guidelines for stability testing of biological products Chinese Pharmacopoeia Commission /China [10] 2021 Evaluation of the quality, safety, and efﬁcacy of messenger RNA vaccines for the prevention of infectious diseases: regulatory considerations WHO [13] 2022 Technical Guidelines for the Pharmacological Study and Evaluation of In Vivo Gene Therapy Products (draft edition) CDE/China [15] 3. Advances in mRNA Vaccine Development The mRNA vaccine is a new type of vaccine that contains exogenous target gene sequences prepared through in vitro transcription and synthesis. The delivery of these sequences into somatic cells stimulates a speciﬁc immune response and confers immune protection by using the somatic cells to express protein. In recent years, key advances in mRNA modiﬁcation and delivery systems have improved the translation efﬁciency, stability, immunogenicity, and safety of mRNA. Compared to conventional vaccines, mRNA vaccines have three advantages. The ﬁrst is safety. mRNA and its delivery systems can be degraded through normal cellular metabolism and are not integrated into the genome of the somatic cells. The production process does not involve live viruses, and the biosafety risk is low. The second advantage is the short development cycle time. After sequence design and validation, mRNA can be transcribed directly in vitro. The third advantage is the high production capacity. With the ability to rapidly scale up production to billions of doses, the vaccination needs of new outbreaks of infectious diseases could be easily fulﬁlled. In 1989, Malone et al. [20] proposed the concept mRNA as a therapeutic drug and suc- cessfully transfected a variety of eukaryotic cells using mRNA encapsulated in liposomes. A 1990 paper by Wolff et al. [ 21] described the injection of naked mRNA Viruses 2023, 15, 668 4 of 16 synthesized in vitro directly into mouse skeletal muscle cells. The authors demonstrated that exogenous mRNA resulted in direct expression of the encoded protein in animal tissues. In 2005, Karikó et al. [22] reported that mRNA modiﬁcation reduced the level of innate immune response and decreased the release of inﬂammatory factors. On 23 August 2021, BNT162b2 (Comirnaty®, New York, NY, USA) was approved by the FDA as the ﬁrst ofﬁcially approved COVID-19 vaccine globally. To date, there are 41 COVID-19 mRNA vaccines in clinical trials worldwide [23] (Table 2). Table 2. Clinical trials of COVID-19 mRNA"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:004", "title": "Stability mRNA Vaccines", "text": "the release of inﬂammatory factors. On 23 August 2021, BNT162b2 (Comirnaty®, New York, NY, USA) was approved by the FDA as the ﬁrst ofﬁcially approved COVID-19 vaccine globally. To date, there are 41 COVID-19 mRNA vaccines in clinical trials worldwide [23] (Table 2). Table 2. Clinical trials of COVID-19 mRNA vaccines *. Name Developer Country Phase mRNA-1273 Moderna USA IV BNT162b2 Pﬁzer/BioNTech USA/Germany IV mRNA-1273.351 Moderna USA IV CVnCoV CureVac AG Germany III PTX-COVID19-B Providence Therapeutics Canada III SW-BIC-213 Shanghai East Hospital and Stemirna Therapeutics China III ARCoV Academy of Military Science (AMS) and Suzhou Abogen China III ARCT-154 Arcturus Therapeutics USA III LVRNA009 AIM Vaccine and Liverna Therapeutics China III mRNA-1273.214 Moderna USA III DS-5670a Daiichi Sankyo Co., Ltd. Japan II/III HDT-301 SENAI CIMATEC Brazil II/III mRNA-1273.211 Moderna USA II/III mRNA-1273.529 Moderna USA II/III mRNA GEMCOVAC-19 Gennova Biopharmaceuticals Limited India II/III ChulaCov19 mRNA vaccine Chulalongkorn University Thailand II MRT5500 Sanoﬁ Pasteur France II ARCT-021 Arcturus Therapeutics USA II SYS6006 CSPC ZhongQi Pharmaceutical Technology Co., Ltd. China II GLB-COV2-043 GreenLight Biosciences, Inc. USA I/II EXG-5003 Elixirgen Therapeutics, Inc USA I/II ARCT-165 Arcturus Therapeutics USA I/II ARCT-021 Arcturus Therapeutics USA I/II EG-COVID vaccine EyeGene Inc. South Korea I/II AAHI-SC2 and AAHI-SC3 ImmunityBio, Inc. USA I/II mRNA-1073 Moderna USA I/II CoV2 SAM(LNP) vaccine GlaxoSmithKline UK I LNP-nCoV saRNA Imperial College London UK I mRNA-1283 Moderna USA I LNP-nCOV saRNA-02 MRC/UVRI and LSHTM Uganda Research Unit UK I HDT-301 vaccine HDT Bio USA I VLPCOV-01 VLP Therapeutics Japan GK USA I CV2CoV CureVac AG Germany I MIPSCo-mRNA-RBD-1 University of Melbourne Australia I Lyophilized Vaccine Jiangsu Rec-Biotechnology Co., Ltd. China I Lyophilized Vaccine Wuhan Recogen Biotechnology Co., Ltd. China I RQ3013 Walvax Biotechnology; Shanghai RNACure Biopharma China I RVM-V001 RVAC Medicines Singapore I ABO1009-DP Suzhou Abogen Biosciences Co., Ltd. China I Self-Amplifying Vaccines Gritstone bio, Inc. USA I CV0501 GlaxoSmithKline USA I * Data source from World Health Organization. COVID-19 Vaccine Tracker and Landscape [Eb/Ol] (7 February 2023). “https://www.who.int/publications/m/item/draft-landscape-of-covid-19-candidate-vaccines (accessed on 8 February 2023)”. Viruses 2023, 15, 668 5 of 16 mRNA vaccines are currently undergoing clinical trials for the prevention and control of diseases other than COVID-19 vaccines, including vaccines for inﬂuenza [24], human immunodeﬁciency virus (NCT05001373), Zika virus (NCT04064905), respiratory syncytial virus (NCT04528719), and cytomegalovirus (NCT04232280). In cancer research, tumor vaccines are being developed for melanoma (NCT03897881), breast cancer (NCT02316457), ovarian cancer (NCT04163094), non-small cell lung cancer, and colorectal cancer (NCT03948763). In the treatment of genetic diseases, clinical trials are ongoing for mRNA vaccines for cystic ﬁbrosis [25], propionic acidemia [26], and transthyretin amyloidosis [27]. In addition to linear mRNA, circular RNA and self-amplifying RNA (saRNA) technolo- gies are rapidly progressing. The unique structure of circular RNA makes it more stable than linear RNA and suggests the potential for vaccine development. saRNA encodes RNA polymerase and uses its own RNA sequence as a template for replication, achieving protein expression levels comparable to those of conventional mRNA but at lower doses. 4. Mechanism of mRNA Vaccine Degradation 4.1. Degradation of mRNA The mRNA"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:005", "title": "Stability mRNA Vaccines", "text": "linear RNA and suggests the potential for vaccine development. saRNA encodes RNA polymerase and uses its own RNA sequence as a template for replication, achieving protein expression levels comparable to those of conventional mRNA but at lower doses. 4. Mechanism of mRNA Vaccine Degradation 4.1. Degradation of mRNA The mRNA molecule is naturally both physically and chemically unstable. The phys- ical instability of mRNA includes the loss of secondary or tertiary structure, as well as aggregation and precipitation, which affect the translation of mRNA molecules [28]. Com- pared to physical instability, chemical degradation has a greater impact on the stability of nucleic acids [29]. Chemical degradation includes hydrolysis and oxidation. Similarly, mRNA hydrolysis is affected by base sequence [30] and mRNA secondary structure [31,32]. mRNA molecules are degraded by protein-based nucleases, ribozymes, and acids and bases through similar mechanisms. Oxidation can lead to base breakage, strand breakage, and changes in mRNA sec- ondary structure [29]. However, hydrolysis is still considered the main factor leading to mRNA degradation. In addition, the degradation pattern of RNA molecules is consistent with the Arrhenius model [33]. 4.2. Degradation of LNPs In addition to mRNA as an active substance, components of LNP can interact with each other, thus affecting the stability of the product. LNP instability primarily manifests as physical and chemical instability. Physical instability can be categorized as aggregation, fu- sion, or content leakage. During storage, LNPs are prone to aggregation and fusion [34,35]. Polyethylene glycol (PEG) can prevent LNP aggregation and thus improve LNP stabil- ity [36]. In addition, physical degradation can also lead to leakage of mRNA, which affects the stability of the encapsulated product. Under normal conditions, the encapsulation efﬁciency of mRNA typically exceeds 90%. Naked mRNA cannot easily enter cells and is prone to degradation, resulting in translation failure. Chemical instability is primarily due to hydrolysis and oxidation of LNP lipids. For example, the carboxylic ester bonds in lipids, such as DSPC and the ionizable cationic lipids, are highly susceptible to temperature- and pH-dependent hydrolysis during storage. Impurities generated from LNP lipid oxidation are highly susceptible to interaction with nucleic acid molecules, which can lead to oxi- dation of encapsulated mRNA. For example, aldehydes can react with DNA bases [37,38] and mRNA [ 39]. Packer et al. found that ionizable lipids in the LNP component can produce aldehyde impurities through oxidation and hydrolysis pathways and can form covalent adducts with mRNA, thus affecting mRNA biological activity [ 39]. PEG lipids are an important potential source of hydroperoxides, which are often unstable and whose degradation can lead to chain reactions and catalyze the degradation of ionizable lipids. Lipid degradation products can also react with mRNA, leading to the formation of covalent mRNA-lipid adducts. Packer et al. [ 39] constructed a model for mRNA vaccine stability prediction by storing mRNA vaccines at −20, 5, 25, or 40 ◦C and using reversed-phase ion-pair high performance liquid chromatography (RP-IP HPLC) to detect the formation of adducts Viruses 2023, 15, 668 6 of 16 between"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:006", "title": "Stability mRNA Vaccines", "text": "mRNA-lipid adducts. Packer et al. [ 39] constructed a model for mRNA vaccine stability prediction by storing mRNA vaccines at −20, 5, 25, or 40 ◦C and using reversed-phase ion-pair high performance liquid chromatography (RP-IP HPLC) to detect the formation of adducts Viruses 2023, 15, 668 6 of 16 between mRNA molecules and lipid degradation products, which directly affect the level of mRNA translation and vaccine activity. Based on three consecutive months of assay data, the authors developed a kinetic model for mRNA vaccine expiration dates and used the model to predict expiration dates of mRNA vaccines. In 2021, a review on ICH Q1A(R2) and Q5C by McMahon et al. [3] stated that the use of stability models and risk-based predictive stability can guide the assignment of retest periods and shelf life for new products under long-term storage. According to an EMA document, a stability study of the Moderna COVID-19 vaccine mRNA-1273 found that the degradation pattern of the mRNA molecule also demonstrated Arrhenius behavior with ﬁrst order kinetics. In addition, the stability proﬁles in Moderna’s vaccine stability study were predictable and amendable to modeling, enabling a good understanding of the chemical degradation process. 5. Factors Affecting mRNA Vaccine Stability mRNA vaccine stability is closely associated with mRNA structure, excipients, and the LNP delivery system. In addition, the manufacturing process plays a key role in stability. This section focuses on the factors inﬂuencing mRNA vaccine stability. 5.1. mRNA Structure 5.1.1. Integrity and Length The integrity of the mRNA molecule, including the 5′cap, coding region, untranslated region (UTR) and poly A tail, is a CQA that affects mRNA vaccine stability and efﬁcacy. The deletion of mRNA fragments, such as stop codon deletion, has been shown to signiﬁcantly shorten the half-life of mRNA, leading to degradation and translation failure [40]. mRNA fragment length also affects mRNA stability. A negative correlation has been reported between mRNA length and half-life in yeast [41]. Under the same storage conditions, a signiﬁcant decrease in half-life occurred with increasing RNA length [ 31]. Guillaume et al. [ 42] reported that unlike the ﬁrst-generation mRNA-1273 vaccine en- coding the full-length sequence of the severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) S protein, the second-generation Moderna COVID-19 mRNA vaccine mRNA-1283 encoding the shorter N-terminal and receptor-binding domain of the S pro- tein had signiﬁcantly improved mRNA stability, with an extension in shelf life from 6 to 12 months at 2–8 ◦C. Onpattro® is an approved small interfering RNA (siRNA)-based gene product that uses an LNP delivery system with components similar to those of the two approved COVID-19 mRNA vaccines. It has a shelf life of 3 years at 2–8 ◦C with no signiﬁcant changes in the indicators during storage [35,43]. These ﬁndings also imply that the inherent stability of mRNA is a key factor in determining the shelf life of mRNA-LNP vaccines. 5.1.2. Sequence Optimization and Modiﬁcation Sequence optimization and mRNA modiﬁcation could be the major focus for improv- ing mRNA-LNP vaccine stability. Mature eukaryotic mRNAs include a 5′-cap,"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:007", "title": "Stability mRNA Vaccines", "text": "[35,43]. These ﬁndings also imply that the inherent stability of mRNA is a key factor in determining the shelf life of mRNA-LNP vaccines. 5.1.2. Sequence Optimization and Modiﬁcation Sequence optimization and mRNA modiﬁcation could be the major focus for improv- ing mRNA-LNP vaccine stability. Mature eukaryotic mRNAs include a 5′-cap, a coding region, UTR, and a 3′terminal poly A tail. mRNA optimization includes codon optimization in the coding sequence as well as UTR optimization. Replacing rare codons with common codons increases mRNA translation [44]. Increasing GC content also enhances mRNA translation levels [ 45–47] and decreases immunogenicity [48]. Concerning the optimization of mRNA UTRs, the introduction of the Kozak consensus sequence after the 5 ′ UTR can also improve the stability and translation initiation level [ 49]. The selection of human α- and β-globin 3′ UTR sequences signiﬁcantly improves mRNA stability and translation efﬁciency [50,51]. The introduction of the 3′UTR sequences of twoβ-globins in a head-to-tail manner between the coding sequence and the poly A tail further improved mRNA stability and translation efﬁciency [52]. The 5′-cap is a protective structure resulting from a structural modiﬁcation on the ﬁrst 7-methylguanosine at the 5′end of mRNA linked to the ﬁrst nucleotide via a triphosphate Viruses 2023, 15, 668 7 of 16 linkage (Cap0, m7GpppN). Cap0 inhibits the degradation of mRNA by nucleases through spatial binding with transcription initiation factors, and increases translation initiation levels. Continued methylation of Cap0 to form Cap1 and Cap2 further reduces the level of immunogenicity. The poly A tail usually consists of 10–250 nucleotides and improves mRNA stability, resistance to nuclease degradation and translation by forming a complex with poly A binding protein [53]. In addition, the length of the poly A tail affects translation efﬁciency and protein expression levels [52,54]. Typically, the poly A tail of mRNA is composed of adenosine chain. However, a recent study reported that mRNA tails containing cytosine (C) improve the level and duration of mRNA expression [ 55]. In addition, cytosine (C) substitution can improve resistance to mRNA degradation, thus prolonging its half-life. The various nucleotide modiﬁcations of mRNA include pseudouridine substitution and uracil and cytosine methylation. Sequence modiﬁcations reduce the inﬂammation- stimulating effects of mRNA and cleavage by nucleases, improve mRNA stability, and en- hance translation levels [ 22,56]. The two approved COVID-19 mRNA vaccines, mRNA-1273 (Moderna) and BNT162b2 (Pﬁzer/BioNTech), were both designed with N1-methyl pseudouridine triphosphate (m1ψTP) instead of uridine triphosphate (UTP). m1ψTP has a better safety proﬁle and more effectively reduces immune stimulation com- pared to pseudouridine [57]. These ﬁndings also suggest that the introduction of m1ψTP in mRNA can effectively reduce the immunogenicity of mRNA vaccines and enhance mRNA stability and protein expression. In addition, sequence optimization and modiﬁcation, such as increasing GC content and introducing pseudouridine, could enhance the stability and translation level of mRNA by stabilizing its secondary structure and increasing base stacking and melting point [58–61]. 5.1.3. Circular RNA and Self-Amplifying RNA Structures Circular RNAs (circRNAs) are single-stranded, closed-loop RNAs that are covalently bonded without"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:008", "title": "Stability mRNA Vaccines", "text": "modiﬁcation, such as increasing GC content and introducing pseudouridine, could enhance the stability and translation level of mRNA by stabilizing its secondary structure and increasing base stacking and melting point [58–61]. 5.1.3. Circular RNA and Self-Amplifying RNA Structures Circular RNAs (circRNAs) are single-stranded, closed-loop RNAs that are covalently bonded without a 5′cap or 3′tail structure. circRNA can potentially encode protein and serve as a foundation for vaccine development. The unique circular structure of circRNA makes it more resistant to nuclease degradation and results in a longer half-life than linear RNA [62–65]. Moreover, circRNA does not contain stop codons and is able to reduce the frequency of ribosome dissociation from RNA, which in turn increases protein translation and expression levels. circRNA can be expressed consistently in cells for 5 to 7 days, whereas linear mRNA with the same sequence is reportedly only consistently expressed for 2 days [66,67]. The stability of a circRNA vaccine developed by Qu et al. [68] using LNPs was also signiﬁcantly better than that of linear mRNA vaccines at 4, 25, and 37 ◦C. In addition to expressing the target protein, self-amplifying RNA vaccines also carry a sequence for RNA-dependent RNA polymerase. The expressed RNA polymerase uses its own RNA sequence as a template for self-ampliﬁcation to produce more copies of saRNA. The major advantage of saRNA is that it can achieve protein expression levels similar to those of conventional mRNA at low doses [ 69,70]. Moreover, since saRNA produces double-stranded RNA during transient replication, this RNA also increases the level of innate immune activation in the body. 5.2. Excipients As stated previously, key active pharmaceutical ingredients for mRNA vaccines in- clude cap analogs, ribonucleoside triphosphates (NTPs), modiﬁed nucleotides (m1ψTP), and polynucleotide tails. These play an important role in improving mRNA stability, reducing immune stimulation, and enhancing mRNA expression and safety. The excipients in mRNA vaccine formulations include LNP lipids, sucrose, and the buffer for injection. Lipids are major components of vaccines and play an important role in mRNA delivery. mRNA vaccines require cryopreservation, and sucrose is often added as a Viruses 2023, 15, 668 8 of 16 protective agent to ensure vaccine freezing. In addition, the buffer affects the long-term mRNA vaccine stability. Since LNP lipids are susceptible to oxidative hydrolysis during storage, the selection of high-quality lipid excipients is essential to prevent impurities that affect lipid stability, such as hydroperoxides and metals [71]. Ribozymes can be catalytically active even at −20 ◦C [72], and some remain active even at −70 ◦C [73]. For this reason, the excipients used in mRNA vaccine formulations must be free of RNAase. Sucrose is a common excipient used to reduce the crystallization temperature and ice crystal formation in the aqueous phase. The interfacial ﬁlm formed by the adsorption of sugar molecules at the oil-water interface also increases the steric hindrance and elec- trostatic repulsion between droplets. Ayat et al. [34] showed that the addition of sucrose increases the freeze-thaw stability of mRNA vaccines. Sucrose was also selected as a vac-"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:009", "title": "Stability mRNA Vaccines", "text": "phase. The interfacial ﬁlm formed by the adsorption of sugar molecules at the oil-water interface also increases the steric hindrance and elec- trostatic repulsion between droplets. Ayat et al. [34] showed that the addition of sucrose increases the freeze-thaw stability of mRNA vaccines. Sucrose was also selected as a vac- cine stabilizing agent and cryoprotectant in the Moderna and Pﬁzer/BioNTech COVID-19 mRNA vaccine formulations. It ensures the lipids do not become too sticky during cold storage. Recently, Mao et al. [ 74] reported the development of a needle-free injectable COVID-19 mRNA vaccine. This formulation utilizes sucrose as an antioxidant for LNP particles. The purported stability of this vaccine is 6 months at 2–8 ◦C. 5.3. LNP Delivery Systems mRNA delivery vehicles primarily include LNPs, polymeric nanoparticle delivery sys- tems, inorganic nanoparticle delivery systems, and peptide nanoparticle delivery systems. Among them, LNPs are the most widely used in mRNA vaccines; they are also common non-viral delivery vehicles in gene therapy [75]. mRNAs can be protected by LNPs from ribonuclease degradation and enter cells by endocytosis then escape into the cytoplasm via endosomes to complete mRNA translation and expression [76]. The immunogenicity of mRNA vaccines is also increased after LNP encapsulation and delivery [77]. LNPs in mRNA vaccines are composed of four main components: phospholipids, cholesterol, PEG lipids, and ionizable lipids. Because phospholipids can spontaneously or- ganize into lipid bilayers and have high phase transition temperatures, they are often used as structural lipids and account for approximately 10–20% of the total lipids in LNPs. Kauff- man et al. [78] found that phospholipid 1,2-dioleoyl-sn-glycero-3-phosphoethanolamine (DOPE) improved mRNA transfection efﬁciency. Zhang et al. [79] found that DOPE can affect the biodistribution of LNPs in vivo. Cholesterol is another structural lipid in LNPs, accounting for approximately 20–50% of the total lipids in LNPs. Cholesterol enhances particle stability by modulating membrane integrity and rigidity [80,81]. The molecular geometry of cholesterol derivatives can further affect the delivery efﬁciency and biodis- tribution of LNPs [82]. PEG lipids serve to control the size of LNPs and stabilize them, preventing aggregation of the particles during storage [83,84]. PEG lipids can also prevent rapid uptake of LNPs, reducing serum protein-mediated opsonization and clearance by reticuloendothelial cells and improving the circulation half-life of LNPs [85]. In addition, functional modiﬁcations of PEG lipids can facilitate the binding of LNPs to ligands or biomolecules [86]. Ionizable lipids account for 30–50% of the total lipids of LNPs. Ionizable lipids contain tertiaryamine groups and are only neutral at a physiological pH when present in the core of the LNPs, but become positively charged when ionized at a low pH in acidic endosomes. Since neutral lipids interact less with the anionic membrane of vascular cells and greatly improve the biocompatibility of LNPs, pH-sensitive ionizable lipids are more favorable for in vivo mRNA delivery. Additionally, this property of ionizable lipids can be exploited to help LNPs escape from the endosomes [80,87]. Alameh et al. found that ionizable lipids affect LNP particle size and are a key factor in"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:010", "title": "Stability mRNA Vaccines", "text": "improve the biocompatibility of LNPs, pH-sensitive ionizable lipids are more favorable for in vivo mRNA delivery. Additionally, this property of ionizable lipids can be exploited to help LNPs escape from the endosomes [80,87]. Alameh et al. found that ionizable lipids affect LNP particle size and are a key factor in determining the inherent adjuvant effect of LNPs [88]. Ionizable lipids include single- and multi-charged lipids. Both the mRNA-1273 and BNT162b2 approved COVID-19 mRNA vaccines have single-charged ionizable lipids. Multi-charged lipids have a higher ratio of positively-chargeable polymer amine (nitrogen) groups to negatively-charged nucleic acid phosphate groups, which is Viruses 2023, 15, 668 9 of 16 more favorable for mRNA encapsulation, cellular uptake, and lysosomal escape. All en- hance the immune efﬁcacy of mRNA vaccines. Recently, Chen et al. developed a novel multi-charged lipid termed 4N4T-LNP , which features higher mRNA delivery efﬁciency and a good safety proﬁle [89]. The above information is summarized as follows (Table 3). Table 3. Composition and function of LNP in mRNA vaccines *. Component Proportion (%) Function Modiﬁcations and Related-Functions Reference phospholipid 10–20 structural lipids 3-phosphate group modiﬁcation: improve transfection efﬁciency; increase the distribution in vivo [78,79] cholesterol 20–50 structural lipids C-24 alkyl derivatives: regulate the integrity of the membrane; impact on delivery efﬁciency and biodistribution [80–82] PEG-lipid ~1.5 Prevent aggregation; stabilization Covalent Coupling modiﬁcation: improving the half-life of LNPs [83–86] Ionizable lipid 30–50 Encapsulation; delivery Introduction of multiple tertiary amine nitrogen atoms: higher delivery efﬁciency and safety [80,87,89] * Data source from pre-clinical stage study. The particle size of LNPs affects their internalization, biodistribution, immunogenicity, degradation, and clearance [90,91]. Controlling the particle size of LNPs also allows for targeted delivery to speciﬁc tissues and cells [ 92]. Typically, the optimal size range for LNPs is 20–200 nm, a range that makes them ideal for permeation and retention and allows them to cross interstitial tissues [90,93]. The application of LNP delivery systems and mRNA technology has greatly increased the development speed of COVID-19 mRNA vaccines. This new class of vaccine has sig- niﬁcant advantages in combating the global COVID-19 pandemic. Recent studies have continued to investigate and optimize LNP delivery systems to support the design of sub- sequent mRNA therapeutic products. Both currently available COVID-19 mRNA vaccines are stored and transported under frozen conditions. The development of mRNA-LNP for- mulations that do not require frozen storage would reduce production and transportation costs. Therefore, the development of mRNA vaccines should focus on researching key factors affecting the long-term stability of LNP formulations. 5.4. Manufacturing Processes 5.4.1. Ethanol mRNA-LNPs are prepared primarily using microﬂuidic technology or microjet tech- nology by rapidly mixing the organic phase (primarily ethanol) containing lipids with the aqueous phase containing mRNA. Later, ethanol content can be reduced from the initial 25–1% by dialysis. However, even 1% residual ethanol can affect long-term vaccine stability [35,94], and hydration of ethanol can lead to lipid membrane fusion in the lipo- some [95]. Because of Fick’s law of diffusion, low-polarity tiny molecules such as ethanol are carried"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:011", "title": "Stability mRNA Vaccines", "text": "content can be reduced from the initial 25–1% by dialysis. However, even 1% residual ethanol can affect long-term vaccine stability [35,94], and hydration of ethanol can lead to lipid membrane fusion in the lipo- some [95]. Because of Fick’s law of diffusion, low-polarity tiny molecules such as ethanol are carried across the lipid bilayer. Ethanol diffusion displaces water molecules on the surface of the liposome and further binds to lipid heads, leading to the formation of an interdigitated structure in the lipid membrane [95]. Since the interdigitated structure has a larger surface area of hydrophobic groups, it is more likely to induce lipid membrane fusion. Moreover, lipid membrane fusion can lead to mRNA leakage [96]. Consequently, reducing residual ethanol from the production process is an important factor affecting mRNA vaccine stability. Viruses 2023, 15, 668 10 of 16 5.4.2. pH and Buffer System pH is also important for mRNA vaccine stability because it affects the rate of mRNA hydrolysis. Under normal conditions, mRNA is more stable in a weakly alkaline envi- ronment. The pH of both the approved Moderna and Pﬁzer/BioNTech COVID-19 RNA vaccines are controlled between 7 and 8. Bauer et al. found that hydrolysis of nucleic acid molecules was signiﬁcantly accelerated when the pH was decreased from 7.0 to 6.5 [ 97]. In the presence of Mg2+ or Ca2+, the phosphodiester bonds of RNA molecules are more susceptible to hydrolytic breakage [31,98]. With respect to the composition of the vaccine buffer system, a suitable buffer system and osmolarity regulator is required because mRNA vaccines may need to be stored below 0 ◦C and the pH may change after freezing. Pﬁzer’s COVID-19 vaccine initially used a phosphate buffer containing KCl/NaCl. Subsequently, Tris buffer was used due to the signiﬁcant pH ﬂuctuations that can occur in phosphate systems after freezing [99]. Tris-HCl stabilizes nucleic acid molecules and scavenges hydroxyl radicals [100,101]. Furthermore, Kolhe et al. used pH probes to demonstrate that the pH of histidine buffer and Tris-HCl buffer ﬂuctuated very little when the temperature was decreased from 0 to−30 ◦C, with pH increases of 0.5 and 0.6, respectively [102]. In contrast, the pH of a buffer system consisting of sodium phosphate salts ﬂuctuated more during freezing, with a pH decrease of 3.6 when the temperature was decreased from 0 to −30 ◦C. 5.4.3. Lyophilization mRNA hydrolysis is the principal factor in mRNA-LNP instability. Structural analysis of mRNA-LNPs has demonstrated that mRNA, ionizable lipids, and water are located in the core of the LNP , with other neutral auxiliary lipids primarily located in the outer wall. The presence of water can initiate hydrolysis reactions in mRNA-LNPs. Lyophilization can be an effective strategy to improve the stability of mRNA-LNP formulations by reducing the water content of the product. Lyophilization is widely used for live attenuated viral vaccines [ 103]. During the freeze-drying process, the product structures are exposed to stress. Therefore, cryoprotec- tant are usually added in order to protect the product from freezing or drying stress and also to increase"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:012", "title": "Stability mRNA Vaccines", "text": "reducing the water content of the product. Lyophilization is widely used for live attenuated viral vaccines [ 103]. During the freeze-drying process, the product structures are exposed to stress. Therefore, cryoprotec- tant are usually added in order to protect the product from freezing or drying stress and also to increase its stability during storage. The most popular cryoprotectants reported in the literature for freeze-drying nanoparticles include trehalose, sucrose, glucose and mannitol [104]. The level of stabilization afforded by sugars generally relies on their con- centrations [105]. Lyophilized vaccines have greater stability than vaccines in conventional liquid formulations [106]. Jones et al. reported that mRNA lyophilized with 10% trehalose as a protectant had high translation and protein expression levels even after storage for 10 months at 4 ◦C [107]. A lyophilized cytomegalovirus mRNA vaccine (mRNA-1647) developed by Moderna is currently in phase 3 clinical trials. The vaccine is purported to have a shelf life of up to 18 months at 5 ◦C. Gerhardt et al. found that the lyophilized mRNA vaccine could be stored for over 8 months at room temperature and for over 21 months at 4 ◦C [108]. The authors described that the physical properties and protein expression levels of the vaccine remained stable. Ball et al. lyophilized LNP-siRNA samples and found that they were stable at −80 ◦C for up to 11 months; the siRNAs maintained good gene-silencing effects [35]. Muramatsu et al. conducted a similar stability study of lyophilized mRNA-LNP vaccines and found that the samples were stable for 24 weeks at 4 ◦C or 4 weeks at 42 ◦C. After that, the vaccine exhibited a signiﬁcant decrease in mRNA integrity and particle size, as well as a decrease in immunogenicity and mRNA concentra- tion [109]. Recently, a study reported that the physiochemical properties and bioactivities of lyophilized vaccines showed no change at 25 ◦C over 6 months, and the lyophilized SARS-CoV-2 mRNA vaccines could elicit potent humoral and cellular immunity whether in mice, rabbits, or rhesus macaques [110]. In addition to the COVID-19 mRNA vaccine, the second-generation inﬂuenza mRNA vaccine developed by Sanoﬁ incorporates lyophilization. However, lyophilization requires re-dissolution before administration, during which particle aggregation might occur, which Viruses 2023, 15, 668 11 of 16 is detrimental to vaccine efﬁcacy. In addition, lyophilization is expensive, laborious, and time-consuming. 5.5. Temperature and Physical Shock Temperature is an important environmental factor affecting vaccine stability. Packer et al. studied the effect of different ambient temperatures ( −20, 5, 25, and 40 ◦C) on the stability of mRNA vaccines [ 39]. RP-IP HPLC assays revealed some degree of mRNA degradation in all groups, with a progressively higher percentage of mRNA integrity loss with increasing ambient temperature. Of the two approved COVID-19 mRNA vac- cines, data showed that the Moderna vaccine is stable at −20 ◦C for 6 months and the Pﬁzer-BioNTech vaccine is stable at −80–−60 ◦C for 6 months. However, when stored at 2–8 ◦C, the shelf life of the Moderna and Pﬁzer-BioNTech vaccines is rapidly reduced to 30"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:013", "title": "Stability mRNA Vaccines", "text": "COVID-19 mRNA vac- cines, data showed that the Moderna vaccine is stable at −20 ◦C for 6 months and the Pﬁzer-BioNTech vaccine is stable at −80–−60 ◦C for 6 months. However, when stored at 2–8 ◦C, the shelf life of the Moderna and Pﬁzer-BioNTech vaccines is rapidly reduced to 30 days and 5 days, respectively. The Onpattro siRNA drug formulation has a shelf life of 3 years at 2–8 ◦C [111], suggesting that a key factor affecting mRNA vaccine stability may be mRNA structure itself. Zhang et al. developed a novel liquid formulation of a COVID-19 mRNA vaccine based on LNP-encapsulated mRNA that encodes the RBD sequence of SARS-CoV-2 [112]. The vaccine can be stored for 7 days at room temperature and for one month at 2–8 ◦C with no effect on vaccine immunogenicity. Furthermore, mRNA purity, encapsulation efﬁciency, polymer dispersity index, and in vivo antibody levels did not change signiﬁcantly when stored for 6 months at 2–8 ◦C [113]. Strict control of temperature as well as rational process design are critical for the temperature sensitivity of mRNA vaccines and its improved stability. In addition to temperature, physical shock is another important environmental factor affecting vaccine stability. Grau et al. investigated the stability of the Pﬁzer-BioNTech and Moderna COVID-19 mRNA vaccines in a continuous movement environment [114]. This environment had no signiﬁcant effect on mRNA vaccines. When the intensity of shaking was increased up to 180 min, changes in mRNA integrity and degraded RNA fragments were observed. Kudsiova et al. performed a similar study for the BNT162b2 vaccine and found that vigorous shaking, vibration, and repeated syringe draw-and-release resulted in increased BNT162b2 lipid nanoparticles particle size and changes in polymer dispersity index, accompanied by the release of a large amount of mRNA from the lipid nanoparticles and a loss of free mRNA, which inevitably affects the protective effect of the vaccine [115]. 6. Conclusions The COVID-19 pandemic has accelerated the development and application of mRNA vaccines. Owing to its huge production capacity and fast speed of research and develop- ment, the mRNA vaccine has great potential in the prevention and control of infectious diseases. However, due to the inherent instability of RNA, the mRNA vaccine usually needs harsh production conditions, and lower storage temperatures and transportation conditions, which shortens the shelf life of the vaccine and restricts the global accessibility of vaccines. Therefore, improving the stability of the mRNA vaccine is a challenge in this ﬁeld. The degradation pathways of mRNA include physical degradation and chemical degradation. Hydrolysis is the main form of mRNA destruction. Both self-cleaving nuclease and protein nuclease can destroy the stability of RNA through hydrolysis. Research on pH, temperature, ion concentration and other factors is of great signiﬁcance to improve stability over the full life span of mRNA vaccines, including formulation, preparation, storage and in vivo immune effect. In terms of vaccine design and manufacturing techniques, the length and structure of mRNA, codon optimization, nucleoside modiﬁcation, GC content, LNP formulation, buffer system and other factors jointly"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:014", "title": "Stability mRNA Vaccines", "text": "great signiﬁcance to improve stability over the full life span of mRNA vaccines, including formulation, preparation, storage and in vivo immune effect. In terms of vaccine design and manufacturing techniques, the length and structure of mRNA, codon optimization, nucleoside modiﬁcation, GC content, LNP formulation, buffer system and other factors jointly affect the stability of mRNA vaccines. A suitable LNPs delivery system is vital for the uptake and expression of mRNA in vivo and its in vitro stability. The level of excipients and manufacturing techniques also affect the stability of mRNA vaccines. Controlling the quality of excipients and developing advanced manufacturing techniques will contribute to improve the long-term stability Viruses 2023, 15, 668 12 of 16 of such vaccines. At present, developing advanced drying technology or adopting low- temperature storage is the main means to deal with this problem. Furthermore, exploring the degradation model of the vaccine and the action mechanism between lipid and mRNA will help improve the stability of mRNA vaccine research. Recently, McMahon et al. proposed a risk-based stability research idea, suggesting that the accelerated stability model, empirical data, kinetic analysis, and other risk-based ideas could be used to predict the stability of the mRNA vaccine, and to obtain the quality attributes related to the products’ stability and the expiration limit attributes, which would provide guidance for the research and evaluation of the stability of mRNA vaccines [3]. In conclusion, we should deeply understand the underlying degradation mechanism and inﬂuencing factors of mRNA vaccines, improve the stability through structural and technological optimization, and carry out research on stability characteristics to lay the foundation for the safety and effectiveness of such vaccines. Author Contributions: Conceptualization, M.X. and X.W.; writing—original draft preparation, F.C., Y.W. and Y.B.; writing—review and editing, M.X. and X.W.; supervision, Z.L., Q.M. and D.L. All authors have read and agreed to the published version of the manuscript. Funding: This research was funded by CAMS Innovation Fund for Medical Sciences (2021-I2M-5-005). Institutional Review Board Statement: Not applicable. Informed Consent Statement: Not applicable. Data Availability Statement: Not applicable. Conﬂicts of Interest: The authors declare no conﬂict of interest. References 1. Beck, J.D.; Reidenbach, D.; Salomon, N.; Sahin, U.; Türeci, O.; Vormehr, M.; Kranz, L.M. mRNA therapeutics in cancer immunotherapy. Mol. Cancer 2021, 20, 69. [CrossRef] 2. Uddin, M.N.; Roni, M.A. Challenges of Storage and Stability of Mrna-Based COVID-19 Vaccines.Vaccines 2021, 9, 1033. [CrossRef] 3. McMahon, M.E.; Abbott, A.; Babayan, Y.; Carhart, J.; Chen, C.W.; Debie, E.; Fu, M.; Hoaglund-Hyzer, C.; Lennard, A.; Li, H.; et al. Considerations for Updates to Ich Q1 and Q5c Stability Guidelines: Embracing Current Technology and Risk Assessment Strategies. AAPS J. 2021, 23, 107. [CrossRef] 4. WHO. Stability of Vaccines; WHO: Geneva, Switzerland, 1989. 5. WHO. Thermostability of Vaccines; WHO/GPV/98.07; WHO: Geneva, Switzerland, 1998. 6. ICH. Q5C Stability Testing of Biotechnologicalbiological Products; ICH: Geneva, Switzerland, 1995. 7. WHO. Guidelines for Stability Evaluation of Vaccines; WHO: Geneva, Switzerland, 2006. 8. WHO. Guidelines for Stability Evaluation of Vaccines; WHO: Geneva, Switzerland, 2011. 9. Center for Drug Evaluation"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:015", "title": "Stability mRNA Vaccines", "text": "WHO. Thermostability of Vaccines; WHO/GPV/98.07; WHO: Geneva, Switzerland, 1998. 6. ICH. Q5C Stability Testing of Biotechnologicalbiological Products; ICH: Geneva, Switzerland, 1995. 7. WHO. Guidelines for Stability Evaluation of Vaccines; WHO: Geneva, Switzerland, 2006. 8. WHO. Guidelines for Stability Evaluation of Vaccines; WHO: Geneva, Switzerland, 2011. 9. Center for Drug Evaluation of China. Technical Guidelines for Stability Research of Biological Products; Center for Drug Evaluation of China: Beijing, China, 2015. 10. Pharmacopoeia of the People’s Republic of China. Guidelines for stability test of biological products. InChinese Pharmacopoeia; China Pharmaceutical Science and Technology Press Publishing Company: Beijing, China, 2020. 11. Schmid, A. Considerations for Producing Mrna Vaccines for Clinical Trials. Methods Mol. Biol. 2016, 1499, 237–251. 12. Evaluation, Center for Drug. Technical Guidelines on Research and Development of COVID-19 Prophylactic Mrna Vaccines (Draft Edition); Center for Drug Evaluation of China: Beijing, China, 2020. 13. WHO. Evaluation of the Quality, Safety and Efﬁcacy of Messenger Rna Vaccines for the Prevention of Infectious Diseases: Regulatory Considerations; WHO: Geneva, Switzerland, 2021. 14. FDA. Liposomal Drug Products: Chemistry, Manufacturing, and Controls; Human Pharmacokinetic and Bioavailability; and Labeling Docu-mentation; FDA: Silver Spring, MD, USA, 2018. 15. Center for Drug Evaluation of China. Technical Guidelines for the Pharmacological Study and Evaluation of in Vivo Gene Therapy Products (Draft Edition); CDE: Beijing, China, 2022. 16. ICH. Evaluation for Stability Data Q1e; ICH: Geneva, Switzerland, 2003. 17. ICH. Stability Testing of New Drug Substances and Products Q1a(R2); ICH: Geneva, Switzerland, 2003. 18. WHO. Controlled Temperature Chain (Ctc) Guidelines; WHO: Geneva, Switzerland, 2012. 19. WHO. Extended Controlled Temperature Conditions (Ectc) Guidelines; WHO: Geneva, Switzerland, 2013. 20. Malone, R.W.; Felgner, P .L.; Verma, I.M. Cationic Liposome-Mediated Rna Transfection.Proc. Natl. Acad. Sci. USA 1989, 86, 6077–6081. [CrossRef] Viruses 2023, 15, 668 13 of 16 21. Wolff, J.A.; Malone, R.W.; Williams, P .; Chong, W.; Acsadi, G.; Jani, A.; Felgner, P .L. Direct gene transfer into mouse musclein vivo. Science 1990, 247 Pt 1, 1465–1468. [CrossRef] 22. Karikó, K.; Buckstein, M.; Ni, H.; Weissman, D. Suppression of RNA Recognition by Toll-like Receptors: The Impact of Nucleoside Modiﬁcation and the Evolutionary Origin of RNA. Immunity 2005, 23, 165–175. [CrossRef] 23. World Health Organization. COVID-19 Vaccine Tracker and Landscape[Eb/Ol]. 2022. Available online: Https://Www.Who.Int/ Publications/M/Item/Draft-Landscape-of-Covid-19-Candidate-Vaccines (accessed on 8 February 2023). 24. Feldman, R.A.; Fuhr, R.; Smolenov, I.; Ribeiro, A.; Panther, L.; Watson, M.; Senn, J.J.; Smith, M.; Almarsson, Ö.; Pujar, H.S.; et al. mRNA vaccines against H10N8 and H7N9 inﬂuenza viruses of pandemic potential are immunogenic and well tolerated in healthy adults in phase 1 randomized clinical trials. Vaccine 2019, 37, 3326–3334. [CrossRef] 25. Miah, K.M.; Hyde, S.C.; Gill, D.R. Emerging gene therapies for cystic ﬁbrosis. Expert Rev. Respir. Med. 2019, 13, 709–725. [CrossRef] 26. Attarwala, H.; Lumley, M.; Liang, M.; Ivaturi, V .; Senn, J. Translational Pharmacokinetic/Pharmacodynamic Model for mRNA- 3927, an Investigational Therapeutic for the Treatment of Propionic Acidemia. Nucleic Acid Ther. 2022. Online ahead of print . [CrossRef] 27. Gillmore, J.D.; Gane, E.; Taubel, J.; Kao, J.; Fontana, M.; Maitland, M.L.; Seitzer, J.; O’Connell,"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:016", "title": "Stability mRNA Vaccines", "text": "Lumley, M.; Liang, M.; Ivaturi, V .; Senn, J. Translational Pharmacokinetic/Pharmacodynamic Model for mRNA- 3927, an Investigational Therapeutic for the Treatment of Propionic Acidemia. Nucleic Acid Ther. 2022. Online ahead of print . [CrossRef] 27. Gillmore, J.D.; Gane, E.; Taubel, J.; Kao, J.; Fontana, M.; Maitland, M.L.; Seitzer, J.; O’Connell, D.; Walsh, K.R.; Wood, K.; et al. CRISPR-Cas9 In Vivo Gene Editing for Transthyretin Amyloidosis. N. Engl. J. Med. 2021, 385, 493–502. [CrossRef] 28. Schoenmaker, L.; Witzigmann, D.; Kulkarni, J.A.; Verbeke, R.; Kersten, G.; Jiskoot, W.; Crommelin, D.J.A. Mrna-Lipid Nanoparticle COVID-19 Vaccines: Structure and Stability. Int. J. Pharm. 2021, 601, 120586. [CrossRef] 29. Pogocki, D.; Schöneich, C. Chemical stability of nucleic acid–derived drugs. J. Pharm. Sci. 2000, 89, 443–456. [CrossRef] 30. Kaukinen, U.; Lyytikainen, S.; Mikkola, S.; Lonnberg, H. The Reactivity of Phosphodiester Bonds within Linear Single-Stranded Oligoribonucleotides Is Strongly Dependent on the Base Sequence. Nucleic Acids Res. 2002, 30, 468–474. [CrossRef] 31. Wayment-Steele, H.K.; Kim, D.S.; Choe, C.A.; Nicol, J.J.; Wellington-Oguri, R.; Watkins, A.M.; Sperberg, R.A.P .; Huang, P .S.; Participants, E.; Das, R. Theoretical Basis for Stabilizing Messenger Rna through Secondary Structure Design. bioRxiv 2021. [CrossRef] 32. Mikkola, S.; Kaukinen, U.; Lönnberg, H. The Effect of Secondary Structure on Cleavage of the Phosphodiester Bonds of RNA. Cell Biochem. Biophys. 2001, 34, 95–119. [CrossRef] [PubMed] 33. Fabre, A.-L.; Colotte, M.; Luis, A.; Tuffet, S.; Bonnet, J. An efﬁcient method for long-term room temperature storage of RNA. Eur. J. Hum. Genet. 2014, 22, 379–385. [CrossRef] 34. Ayat, N.R.; Sun, Z.; Sun, D.; Yin, M.; Hall, R.C.; Vaidya, A.M.; Liu, X.; Schilb, A.L.; Scheidt, J.; Lu, Z.-R. Formulation of Biocompatible Targeted ECO/siRNA Nanoparticles with Long-Term Stability for Clinical Translation of RNAi.Nucleic Acid Ther. 2019, 29, 195–207. [CrossRef] 35. Ball, R.L.; Bajaj, P .; Whitehead, K.A. Achieving Long-Term Stability of Lipid Nanoparticles: Examining the Effect of Ph, Temperature, and Lyophilization. Int. J. Nanomed. 2017, 12, 305–315. [CrossRef] 36. Ryals, R.C.; Patel, S.; Acosta, C.; McKinney, M.; Pennesi, M.E.; Sahay, G. The effects of PEGylation on LNP based mRNA delivery to the eye. PLoS ONE 2020, 15, e0241006. [CrossRef] 37. Garaycoechea, J.I.; Crossan, G.P .; Langevin, F.; Mulderrig, L.; Louzada, S.; Yang, F.; Guilbaud, G.; Park, N.; Roerink, S.; Nik-Zainal, S.; et al. Alcohol and endogenous aldehydes damage chromosomes and mutate stem cells. Nature 2018, 553, 171–177. [CrossRef] [PubMed] 38. Shishodia, S.; Zhang, D.; El-Sagheer, A.H.; Brown, T.; Claridge, T.D.W.; Schoﬁeld, C.J.; Hopkinson, R.J. NMR analyses onN- hydroxymethylated nucleobases—Implications for formaldehyde toxicity and nucleic acid demethylases. Org. Biomol. Chem. 2018, 16, 4021–4032. [CrossRef] [PubMed] 39. Packer, M.; Gyawali, D.; Yerabolu, R.; Schariter, J.; White, P . A novel mechanism for the loss of mRNA activity in lipid nanoparticle delivery systems. Nat. Commun. 2021, 12, 6777. [CrossRef] [PubMed] 40. Klauer, A.A.; van Hoof, A. Degradation of Mrnas That Lack a Stop Codon: A Decade of Nonstop Progress. Wiley Interdiscip Rev. RNA 2012, 3, 649–660. [CrossRef] [PubMed] 41. Santiago, T.C.; Purvis, I.J.; Bettany, A.J.; Brown, A.J. The Relationship between Mrna Stability and Length in Saccharomyces"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:017", "title": "Stability mRNA Vaccines", "text": "12, 6777. [CrossRef] [PubMed] 40. Klauer, A.A.; van Hoof, A. Degradation of Mrnas That Lack a Stop Codon: A Decade of Nonstop Progress. Wiley Interdiscip Rev. RNA 2012, 3, 649–660. [CrossRef] [PubMed] 41. Santiago, T.C.; Purvis, I.J.; Bettany, A.J.; Brown, A.J. The Relationship between Mrna Stability and Length in Saccharomyces Cerevisiae. Nucleic. Acids Res. 1986, 14, 8347–8360. [CrossRef] [PubMed] 42. Stewart-Jones, G.B.E.; Elbashir, S.M.; Wu, K.; Lee, D.; Renzi, I.; Ying, B.; Koch, M.; Sein, C.E.; Choi, A.; Whitener, B.; et al. Development of SARS-CoV-2 Mrna Vaccines Encoding Spike N-Terminal and Receptor Binding Domains.bioRxiv 2022. [CrossRef] 43. Suzuki, Y.; Hyodo, K.; Tanaka, Y.; Ishihara, H. Sirna-Lipid Nanoparticles with Long-Term Storage Stability Facilitate Potent Gene-Silencing in Vivo. J. Control. Release 2015, 220, 44–50. [CrossRef] 44. Gustafsson, C.; Govindarajan, S.; Minshull, J. Codon bias and heterologous protein expression.Trends Biotechnol. 2004, 22, 346–353. [CrossRef] 45. Graf, M.; Bojak, A.; Deml, L.; Bieler, K.; Wolf, H.; Wagner, R. Concerted Action of Multiple cis -Acting Sequences Is Required for Rev Dependence of Late Human Immunodeﬁciency Virus Type 1 Gene Expression. J. Virol. 2000, 74, 10822–10826. [CrossRef] 46. Kudla, G.; Lipinski, L.; Cafﬁn, F.; Helwak, A.; Zylicz, M. High Guanine and Cytosine Content Increases mRNA Levels in Mammalian Cells. PLoS Biol. 2006, 4, e180. [CrossRef] Viruses 2023, 15, 668 14 of 16 47. Thess, A.; Grund, S.; Mui, B.L.; Hope, M.J.; Baumhof, P .; Fotin-Mleczek, M.; Schlake, T. Sequence-Engineered Mrna without Chemical Nucleoside Modiﬁcations Enables an Effective Protein Therapy in Large Animals. Mol. Ther. 2015, 23, 1456–1464. [CrossRef] [PubMed] 48. Weissman, D.; Karik ó, K. mRNA: Fulﬁlling the Promise of Gene Therapy. Mol. Ther. 2015, 23, 1416–1417. [CrossRef] [PubMed] 49. Zarghampoor, F.; Azarpira, N.; Khatami, S.R.; Behzad-Behbahani, A.; Foroughmand, A.M. Improved translation efﬁciency of therapeutic mRNA. Gene 2019, 707, 231–238. [CrossRef] [PubMed] 50. Karikó, K.; Kuo, A.; Barnathan, E.S. Overexpression of urokinase receptor in mammalian cells following administration of the in vitro transcribed encoding mRNA. Gene Ther. 1999, 6, 1092–1100. [CrossRef] [PubMed] 51. Ross, J.; Sullivan, T.D. Half-lives of beta and gamma globin messenger RNAs and of protein synthetic capacity in cultured human reticulocytes. Blood 1985, 66, 1149–1154. [CrossRef] [PubMed] 52. Holtkamp, S.; Kreiter, S.; Selmi, A.; Simon, P .; Koslowski, M.; Huber, C.; Tureci, O.; Sahin, U. Modiﬁcation of Antigen-Encoding Rna Increases Stability, Translational Efﬁcacy, and T-Cell Stimulatory Capacity of Dendritic Cells. Blood 2006, 108, 4009–4017. [CrossRef] [PubMed] 53. Pelletier, J.; Sonenberg, N. The Organizing Principles of Eukaryotic Ribosome Recruitment. Annu. Rev. Biochem. 2019, 88, 307–335. [CrossRef] 54. E Grier, A.; Burleigh, S.; Sahni, J.; A Clough, C.; Cardot, V .; Choe, D.C.; Krutein, M.C.; Rawlings, D.J.; Jensen, M.C.; Scharenberg, A.M.; et al. pEVL: A Linear Plasmid for Generating mRNA IVT Templates With Extended Encoded Poly(A) Sequences. Mol. Ther. Nucleic Acids 2016, 5, e306. [CrossRef] 55. Li, C.Y.; Liang, Z.; Hu, Y.; Zhang, H.; Setiasabda, K.D.; Li, J.; Ma, S.; Xia, X.; Kuang, Y. Cytidine-containing tails robustly enhance and prolong protein production of synthetic mRNA in cell and in vivo. Mol. Ther. Nucleic Acids 2022,"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:018", "title": "Stability mRNA Vaccines", "text": "Poly(A) Sequences. Mol. Ther. Nucleic Acids 2016, 5, e306. [CrossRef] 55. Li, C.Y.; Liang, Z.; Hu, Y.; Zhang, H.; Setiasabda, K.D.; Li, J.; Ma, S.; Xia, X.; Kuang, Y. Cytidine-containing tails robustly enhance and prolong protein production of synthetic mRNA in cell and in vivo. Mol. Ther. Nucleic Acids 2022, 30, 300–310. [CrossRef] 56. Anderson, B.R.; Muramatsu, H.; Jha, B.K.; Silverman, R.H.; Weissman, D.; Karikó, K. Nucleoside modiﬁcations in RNA limit activation of 2′-5′-oligoadenylate synthetase and increase resistance to cleavage by RNase L.Nucleic Acids Res. 2011, 39, 9329–9338. [CrossRef] 57. Andries, O.; Mc Cafferty, S.; De Smedt, S.C.; Weiss, R.; Sanders, N.N.; Kitada, T. N1-methylpseudouridine-incorporated mRNA outperforms pseudouridine-incorporated mRNA by providing enhanced protein expression and reduced immunogenicity in mammalian cell lines and mice. J. Control. Release 2015, 217, 337–344. [CrossRef] 58. Sen, A.; Kargar, K.; Akgun, E.; Pinar, M.C. Codon Optimization: A Mathematical Programing Approach. Bioinformatics 2020, 36, 4012–4020. [CrossRef] 59. Mauger, D.M.; Cabral, B.J.; Presnyak, V .; Su, S.V .; Reid, D.W.; Goodman, B.; Link, K.; Khatwani, N.; Reynders, J.; Moore, M.J.; et al. mRNA structure regulates protein expression through changes in functional half-life. Proc. Natl. Acad. Sci. USA 2019, 116, 24075–24083. [CrossRef] 60. Zhang, J.; Kuo, C.C.; Chen, L. Gc Content around Splice Sites Affects Splicing through Pre-Mrna Secondary Structures. BMC Genom. 2011, 12, 90. [CrossRef] 61. Zhao, B.S.; He, C. Pseudouridine in a new era of RNA modiﬁcations. Cell Res. 2015, 25, 153–154. [CrossRef] 62. Bai, Y.; Liu, D.; He, Q.; Liu, J.; Mao, Q.; Liang, Z. Research progress on circular RNA vaccines.Front. Immunol. 2022, 13, 1091797. [CrossRef] 63. Zhou, W.Y.; Cai, Z.R.; Liu, J.; Wang, D.S.; Ju, H.Q.; Xu, R.H. Circular Rna: Metabolism, Functions and Interactions with Proteins. Mol. Cancer 2020, 19, 172. [CrossRef] 64. Uchida, S.; Perche, F.; Pichon, C.; Cabral, H. Nanomedicine-Based Approaches for mRNA Delivery. Mol. Pharm. 2020, 17. [CrossRef] 65. Enuka, Y.; Lauriola, M.; Feldman, M.E.; Sas-Chen, A.; Ulitsky, I.; Yarden, Y. Circular RNAs are long-lived and display only minimal early alterations in response to a growth factor. Nucleic Acids Res. 2016, 44, 1370–1383. [CrossRef] 66. Wesselhoeft, R.A.; Kowalski, P .S.; Anderson, D.G. Engineering circular RNA for potent and stable translation in eukaryotic cells. Nat. Commun. 2018, 9, 2629. [CrossRef] 67. Chen, C.; Wei, H.; Zhang, K.; Li, Z.; Wei, T.; Tang, C.; Yang, Y.; Wang, Z. A ﬂexible, efﬁcient, and scalable platform to produce circular RNAs as new therapeutics. bioRxiv 2022. [CrossRef] 68. Qu, L.; Yi, Z.; Shen, Y.; Lin, L.; Chen, F.; Xu, Y.; Wu, Z.; Tang, H.; Zhang, X.; Tian, F.; et al. Circular Rna Vaccines against SARS-CoV-2 and Emerging Variants. Cell 2022, 185, 1728–1744.e16. [CrossRef] 69. McKay, P .F.; Hu, K.; Blakney, A.K.; Samnuan, K.; Brown, J.C.; Penn, R.; Zhou, J.; Bouton, C.R.; Rogers, P .; Polra, K.; et al. Self-Amplifying Rna SARS-CoV-2 Lipid Nanoparticle Vaccine Candidate Induces High Neutralizing Antibody Titers in Mice. Nat. Commun. 2020, 11, 3523. [CrossRef] [PubMed] 70. de Alwis, R.; Gan, E.S.; Chen, S.; Leong, Y.S.; Tan, H.C.; Zhang, S.L.; Yau, C.; Low,"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:019", "title": "Stability mRNA Vaccines", "text": "R.; Zhou, J.; Bouton, C.R.; Rogers, P .; Polra, K.; et al. Self-Amplifying Rna SARS-CoV-2 Lipid Nanoparticle Vaccine Candidate Induces High Neutralizing Antibody Titers in Mice. Nat. Commun. 2020, 11, 3523. [CrossRef] [PubMed] 70. de Alwis, R.; Gan, E.S.; Chen, S.; Leong, Y.S.; Tan, H.C.; Zhang, S.L.; Yau, C.; Low, J.G.H.; Kalimuddin, S.; Matsuda, D.; et al. A Single Dose of Self-Transcribing and Replicating Rna-Based SARS-CoV-2 Vaccine Produces Protective Adaptive Immunity in Mice. Mol. Ther. 2021, 29, 1970–1983. [CrossRef] [PubMed] 71. Kumar, V .; Kalonia, D.S. Removal of peroxides in polyethylene glycols by vacuum drying: Implications in the stability of biotech and pharmaceutical formulations. AAPS PharmSciTech 2006, 7, E47–E53. [CrossRef] [PubMed] 72. Ma, S.; Huang, Y.; van Huystee, R. Improved plant RNA stability in storage. Anal. Biochem. 2004, 326, 122–124. [CrossRef] 73. Seyhan, A.A.; Burke, J.M. Mg2+-independent hairpin ribozyme catalysis in hydrated RNA ﬁlms. RNA 2000, 6, 189–198. [CrossRef] Viruses 2023, 15, 668 15 of 16 74. Mao, S.; Li, S.; Zhang, Y.; Long, L.; Peng, J.; Cao, Y.; Mao, J.Z.; Qi, X.; Xin, Q.; San, G.; et al. A Highly Efﬁcient Needle-Free-Injection Delivery System for Mrna-Lnp Vaccination against SARS-CoV-2. Nano Today 2023, 48, 101730. [CrossRef] 75. Cullis, P .R.; Hope, M.J. Lipid Nanoparticle Systems for Enabling Gene Therapies. Mol. Ther. 2017, 25, 1467–1475. [CrossRef] 76. Sabnis, S.; Kumarasinghe, E.S.; Salerno, T.; Mihai, C.; Ketova, T.; Senn, J.J.; Lynn, A.; Bulychev, A.; McFadyen, I.; Chan, J.; et al. A Novel Amino Lipid Series for mRNA Delivery: Improved Endosomal Escape and Sustained Pharmacology and Safety in Non-human Primates. Mol. Ther. 2018, 26, 1509–1519. [CrossRef] 77. Prieve, M.G.; Harvie, P .; Monahan, S.D.; Roy, D.; Li, A.G.; Blevins, T.L.; Paschal, A.E.; Waldheim, M.; Bell, E.C.; Galperin, A.; et al. Targeted mRNA Therapy for Ornithine Transcarbamylase Deﬁciency.Mol. Ther. 2018, 26, 801–813. [CrossRef] [PubMed] 78. Kauffman, K.J.; Dorkin, J.R.; Yang, J.H.; Heartlein, M.W.; DeRosa, F.; Mir, F.F.; Fenton, O.S.; Anderson, D.G. Optimization of Lipid Nanoparticle Formulations for mRNA Delivery in Vivo with Fractional Factorial and Deﬁnitive Screening Designs. Nano Lett. 2015, 15, 7300–7306. [CrossRef] [PubMed] 79. Zhang, R.; El-Mayta, R.; Murdoch, T.J.; Warzecha, C.C.; Billingsley, M.M.; Shepherd, S.J.; Gong, N.; Wang, L.; Wilson, J.M.; Lee, D.; et al. Helper lipid structure inﬂuences protein adsorption and delivery of lipid nanoparticles to spleen and liver. Biomater. Sci. 2021, 9, 1449–1463. [CrossRef] [PubMed] 80. Meng, C.; Chen, Z.; Li, G.; Welte, T.; Shen, H. Nanoplatforms for mRNA Therapeutics. Adv. Ther. 2020, 4, 2000099. [CrossRef] 81. Hajj, K.A.; Whitehead, K.A. Tools for translation: Non-viral materials for therapeutic mRNA delivery.Nat. Rev. Mater. 2017, 2, 17056. [CrossRef] 82. Patel, S.; Ashwanikumar, N.; Robinson, E.; Xia, Y.; Mihai, C.; Grifﬁth, J.P ., 3rd; Hou, S.; Esposito, A.A.; Ketova, T.; Welsher, K.; et al. Naturally-Occurring Cholesterol Analogues in Lipid Nanoparticles Induce Polymorphic Shape and Enhance Intracellular Delivery of Mrna. Nat. Commun. 2020, 11, 983. [CrossRef] 83. Heyes, J.; Hall, K.; Tailor, V .; Lenz, R.; MacLachlan, I. Synthesis and characterization of novel poly(ethylene glycol)-lipid conjugates suitable for use in drug delivery. J."}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:020", "title": "Stability mRNA Vaccines", "text": "et al. Naturally-Occurring Cholesterol Analogues in Lipid Nanoparticles Induce Polymorphic Shape and Enhance Intracellular Delivery of Mrna. Nat. Commun. 2020, 11, 983. [CrossRef] 83. Heyes, J.; Hall, K.; Tailor, V .; Lenz, R.; MacLachlan, I. Synthesis and characterization of novel poly(ethylene glycol)-lipid conjugates suitable for use in drug delivery. J. Control. Release 2006, 112, 280–290. [CrossRef] 84. Leung, A.K.; Tam, Y.Y.C.; Cullis, P .R. Lipid Nanoparticles for Short Interfering RNA Delivery. Adv. Genet. 2014, 88, 71–110. [CrossRef] 85. Jokerst, J.V .; Lobovkina, T.; Zare, R.N.; Gambhir, S.S. Nanoparticle PEGylation for imaging and therapy.Nanomedicine 2011, 6, 715–728. [CrossRef] 86. Singh, M.S.; Ramishetti, S.; Landesman-Milo, D.; Goldsmith, M.; Chatterjee, S.; Palakuri, R.; Peer, D. Therapeutic Gene Silencing Using Targeted Lipid Nanoparticles in Metastatic Ovarian Cancer. Small 2021, 17, e2100287. [CrossRef] 87. Kowalski, P .S.; Rudra, A.; Miao, L.; Anderson, D.G. Delivering the Messenger: Advances in Technologies for Therapeutic mRNA Delivery. Mol. Ther. 2019, 27, 710–728. [CrossRef] [PubMed] 88. Alameh, M.-G.; Tomb ácz, I.; Bettini, E.; Lederer, K.; Ndeupen, S.; Sittplangkoon, C.; Wilmore, J.R.; Gaudette, B.T.; Soliman, O.Y.; Pine, M.; et al. Lipid nanoparticles enhance the efﬁcacy of mRNA and protein subunit vaccines by inducing robust T follicular helper cell and humoral responses. Immunity 2021, 54, 2877–2892.e7. [CrossRef] [PubMed] 89. Chen, K.; Fan, N.; Huang, H.; Jiang, X.; Qin, S.; Xiao, W.; Zheng, Q.; Zhang, Y.; Duan, X.; Qin, Z.; et al. Mrna Vaccines against SARS-CoV-2 Variants Delivered by Lipid Nanoparticles Based on Novel Ionizable Lipids.Adv. Funct. Mater. 2022, 32, 2204692. [CrossRef] [PubMed] 90. Mitragotri, S.; Lahann, J. Physical approaches to biomaterial design. Nat. Mater. 2009, 8, 15–23. [CrossRef] [PubMed] 91. Duan, X.; Li, Y. Physicochemical Characteristics of Nanoparticles Affect Circulation, Biodistribution, Cellular Internalization, and Trafﬁcking. Small 2013, 9, 1521–1532. [CrossRef] [PubMed] 92. Kim, M.; Jeong, M.; Hur, S.; Cho, Y.; Park, J.; Jung, H.; Seo, Y.; Woo, H.A.; Nam, K.T.; Lee, K.; et al. Engineered ionizable lipid nanoparticles for targeted delivery of RNA therapeutics into different types of cells in the liver. Sci. Adv. 2021, 7, eabf4398. [CrossRef] 93. Barua, S.; Mitragotri, S. Challenges associated with penetration of nanoparticles across cell and tissue barriers: A review of current status and future prospects. Nano Today 2014, 9, 223–243. [CrossRef] 94. Ly, H.H.; Daniel, S.; Soriano, S.K.V .; Kis, Z.; Blakney, A.K. Optimization of Lipid Nanoparticles for saRNA Expression and Cellular Activation Using a Design-of-Experiment Approach. Mol. Pharm. 2022, 19, 1892–1905. [CrossRef] 95. Komatsu, H.; Okada, S. Ethanol-induced aggregation and fusion of small phosphatidylcholine liposome: Participation of interdigitated membrane formation in their processes. Biochim. Biophys. Acta 1995, 1235, 270–280. [CrossRef] 96. Kimura, N.; Maeki, M.; Sato, Y.; Ishida, A.; Tani, H.; Harashima, H.; Tokeshi, M. Development of a Microﬂuidic-Based Post- Treatment Process for Size-Controlled Lipid Nanoparticles and Application to siRNA Delivery.ACS Appl. Mater. Interfaces 2020, 12, 34011–34020. [CrossRef] 97. Bauer, T.; Hammes, W.P .; Haase, N.U.; Hertel, C. Effect of food components and processing parameters on DNA degradation in food. Environ. Biosaf. Res. 2004, 3, 215–223. [CrossRef] [PubMed] 98. Lindahl, T. Instability and decay"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:021", "title": "Stability mRNA Vaccines", "text": "Lipid Nanoparticles and Application to siRNA Delivery.ACS Appl. Mater. Interfaces 2020, 12, 34011–34020. [CrossRef] 97. Bauer, T.; Hammes, W.P .; Haase, N.U.; Hertel, C. Effect of food components and processing parameters on DNA degradation in food. Environ. Biosaf. Res. 2004, 3, 215–223. [CrossRef] [PubMed] 98. Lindahl, T. Instability and decay of the primary structure of DNA. Nature 1993, 362, 709–715. [CrossRef] [PubMed] 99. Lewis, L.M.; Badkar, A.V .; Cirelli, D.; Combs, R.; Lerch, T.F. “The Race to Develop the Pﬁzer-Biontech COVID-19 Vaccine: From the Pharmaceutical Scientists’ Perspective.J. Pharm. Sci. 2022, 112, 640–647. [CrossRef] [PubMed] 100. White, P . Moderna Science and Technology Day. 2022. Available online: https://s29.q4cdn.com/435878511/ﬁles/doc_ presentations/2022/05/Science-Day-2022-Master-Slides-FINAL-(05.17_7am).pdf (accessed on 8 January 2023). Viruses 2023, 15, 668 16 of 16 101. Blenke, E.O.; Örnskov, E.; Schöneich, C.; Nilsson, G.A.; Volkin, D.B.; Mastrobattista, E.; Almarsson, O.; Crommelin, D.J. The Storage and In-Use Stability of mRNA Vaccines and Therapeutics: Not A Cold Case. J. Pharm. Sci. 2023, 112, 386–403. [CrossRef] [PubMed] 102. Kolhe, P .; Amend, E.; Singh, S.K. Impact of freezing on pH of buffered solutions and consequences for monoclonal antibody aggregation. Biotechnol. Prog. 2010, 26, 727–733. [CrossRef] 103. Hansen, L.J.J.; Daoussi, R.; Vervaet, C.; Remon, J.-P .; De Beer, T.R.M. Freeze-drying of live virus vaccines: A review.Vaccine 2015, 33, 5507–5519. [CrossRef] 104. Abdelwahed, W.; Degobert, G.; Stainmesse, S.; Fessi, H. Freeze-Drying of Nanoparticles: Formulation, Process and Storage Considerations. Adv. Drug Deliv. Rev. 2006, 58, 1688–1713. [CrossRef] 105. Schwarz, C.; Mehnert, W. Freeze-drying of drug-free and drug-loaded solid lipid nanoparticles (SLN).Int. J. Pharm. 1997, 157, 171–179. [CrossRef] 106. Wang, W. Lyophilization and development of solid protein pharmaceuticals. Int. J. Pharm. 2000, 203, 1–60. [CrossRef] 107. Jones, K.L.; Drane, D.; Gowans, E.J. Long-term storage of DNA-free RNA for use in vaccine studies. Biotechniques 2007, 43, 675–681. [CrossRef] 108. Gerhardt, A.; Voigt, E.; Archer, M.; Reed, S.; Larson, E.; Van Hoeven, N.; Kramer, R.; Fox, C.; Casper, C. A Thermostable, Flexible RNA Vaccine Delivery Platform for Pandemic Response. bioRxiv 2021. [CrossRef] 109. Muramatsu, H.; Lam, K.; Bajusz, C.; Laczko, D.; Kariko, K.; Schreiner, P .; Martin, A.; Lutwyche, P .; Heyes, J.; Pardi, N. Lyophilization Provides Long-Term Stability for a Lipid Nanoparticle-Formulated, Nucleoside-Modiﬁed Mrna Vaccine. Mol. Ther. 2022, 30, 1941–1951. [CrossRef] [PubMed] 110. Ai, L.; Li, Y.; Zhou, L.; Yao, W.; Zhang, H.; Hu, Z.; Han, J.; Wang, W.; Wu, J.; Xu, P .; et al. Lyophilized Mrna-Lipid Nanoparticle Vaccines with Long-Term Stability and High Antigenicity against SARS-CoV-2.Cell Discov. 2023, 9, 9. [CrossRef] [PubMed] 111. EMA. Summary of Product Characteristics. 2018. Available online: https://www.ema.europa.eu/en/documents/product- information/onpattro-epar-product-information_en.pdf (accessed on 10 January 2023). 112. Zhang, N.-N.; Li, X.-F.; Deng, Y.-Q.; Zhao, H.; Huang, Y.-J.; Yang, G.; Huang, W.-J.; Gao, P .; Zhou, C.; Zhang, R.-R.; et al. A Thermostable mRNA Vaccine against COVID-19. Cell 2020, 182, 1271–1283.e16. [CrossRef] 113. Zhao, H.; Wang, T.-C.; Li, X.-F.; Zhang, N.-N.; Li, L.; Zhou, C.; Deng, Y.-Q.; Cao, T.-S.; Yang, G.; Li, R.-T.; et al. Long-term stability and protection efﬁcacy of the RBD-targeting COVID-19 mRNA vaccine in nonhuman primates. Signal"}
{"doc_id": "Stability_mRNA_Vaccines", "page": 0, "chunk_id": "Stability_mRNA_Vaccines:022", "title": "Stability mRNA Vaccines", "text": "al. A Thermostable mRNA Vaccine against COVID-19. Cell 2020, 182, 1271–1283.e16. [CrossRef] 113. Zhao, H.; Wang, T.-C.; Li, X.-F.; Zhang, N.-N.; Li, L.; Zhou, C.; Deng, Y.-Q.; Cao, T.-S.; Yang, G.; Li, R.-T.; et al. Long-term stability and protection efﬁcacy of the RBD-targeting COVID-19 mRNA vaccine in nonhuman primates. Signal Transduct. Target. Ther. 2021, 6, 438. [CrossRef] 114. Grau, S.; Ferrández, O.; Martín-García, E.; Maldonado, R. Reconstituted mRNA COVID-19 vaccines may maintain stability after continuous movement. Clin. Microbiol. Infect. 2021, 27, 1698.e1–1698.e4. [CrossRef] 115. Kudsiova, L.; Lansley, A.; Scutt, G.; Allen, M.; Bowler, L.; Williams, S.; Lippett, S.; Stafford, S.; Tarzi, M.; Cross, M.; et al. Stability Testing of the Pﬁzer-Biontech Bnt162b2 COVID-19 Vaccine: A Translational Study in Uk Vaccination Centres.BMJ Open Sci. 2021, 5, e100203. [CrossRef] Disclaimer/Publisher’s Note: The statements, opinions and data contained in all publications are solely those of the individual author(s) and contributor(s) and not of MDPI and/or the editor(s). MDPI and/or the editor(s) disclaim responsibility for any injury to people or property resulting from any ideas, methods, instructions or products referred to in the content."}
