{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:000", "title": "Stem Cell Therapy", "text": "WJD https://www.wjgnet.com 1 July 15, 2025 Volume 16 Issue 7 World Journal of DiabetesW J D Submit a Manuscript: https://www.f6publishing.com World J Diabetes 2025 July 15; 16(7): 107344 DOI: 10.4239/wjd.v16.i7.107344 ISSN 1948-9358 (online) MINIREVIEWS Stem cell therapy for diabetes: Advances, prospects, and challenges Dian-Bao Zuo, Chun-Hua Wang, Ming Sang, Xiao-Dong Sun, Guo-Ping Chen, Kang-Kang Ji Specialty type: Endocrinology and metabolism Provenance and peer review: Invited article; Externally peer reviewed. Peer-review model: Single blind Peer-review report’s classification Scientific Quality: Grade A, Grade B, Grade B Novelty: Grade A, Grade A Creativity or Innovation: Grade A, Grade B Scientific Significance: Grade A, Grade B P-Reviewer: Huang C; Hwu CM; Zhang L Received: March 21, 2025 Revised: April 21, 2025 Accepted: June 13, 2025 Published online: July 15, 2025 Processing time: 116 Days and 19.3 Hours Dian-Bao Zuo, Ming Sang, Xiao-Dong Sun, Research Center for Translational Medicine, Xiangyang No. 1 People’s Hospital, Hubei University of Medicine, Xiangyang 441000, Hubei Province, China Chun-Hua Wang, Central Laboratory, Xiangyang Central Hospital, Affiliated Hospital of Hubei University of Arts and Science, Xiangyang 441021, Hubei Province, China Guo-Ping Chen, Kang-Kang Ji, Department of Clinical Medical Research, Binhai County People’s Hospital, Clinical Medical College of Yangzhou University, Yancheng 224500, Jiangsu Province, China Co-first authors: Dian-Bao Zuo and Chun-Hua Wang. Co-corresponding authors: Guo-Ping Chen and Kang-Kang Ji. Corresponding author: Kang-Kang Ji, PhD, Postdoctoral Fellow, Chief Physician, Professor, Department of Clinical Medical Research, Binhai County People’s Hospital, Clinical Medical College of Yangzhou University, No. 299 Haibin Road, Yancheng 224500, Jiangsu Province, China. kyrie@mail.ustc.edu.cn Abstract Diabetes mellitus, a global epidemic, represents a major public health threat. Stem cell therapy, with its regenerative capacity, has emerged as a promising approach for diabetes mellitus management. This paper reviews recent advancements, prospects, and challenges in stem cell-based treatments for diabetes mellitus, focusing on the applications of induced pluripotent stem cells and mesenchymal stem cells, the development of pancreatic islet organoids, and the potential for personalized medicine. The review critically assesses the efficacy and safety of stem cell therapies in clinical trials and examines their applications in both type 1 and type 2 diabetes mellitus. Despite the promising potential, challenges such as safety concerns, transplantation efficiency, ethical considerations, and immune rejection remain prevalent. Lastly, the paper discusses future directions, including the integration of stem cell therapy with other treatments and the advancement of personalized therapeutic strategies, offering new perspectives and hope for dia- betes mellitus management. Key Words: Diabetes mellitus; Stem cell therapy; Induced pluripotent stem cells; Me- senchymal stem cells; Clinical applications ©The Author(s) 2025. Published by Baishideng Publishing Group Inc. All rights reserved. Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 2 July 15, 2025 Volume 16 Issue 7 Core Tip: Stem cell therapy emerges as a transformative approach, leveraging dual mechanisms: Differentiation into glucose- responsive β-cells and immunomodulation via paracrine signaling. Recent advancements include vertex pharmaceuticals’ VX-880 trial, where patients demonstrated restored insulin production and a significant reduction in exogenous insulin dependence. Challenges such as tumorigenicity in pluripotent stem cells"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:001", "title": "Stem Cell Therapy", "text": "Stem cell therapy emerges as a transformative approach, leveraging dual mechanisms: Differentiation into glucose- responsive β-cells and immunomodulation via paracrine signaling. Recent advancements include vertex pharmaceuticals’ VX-880 trial, where patients demonstrated restored insulin production and a significant reduction in exogenous insulin dependence. Challenges such as tumorigenicity in pluripotent stem cells and immune rejection are addressed through clustered regularly interspaced short palindromic repeats-edited human leukocyte antigen knockouts and encapsulation technologies. Innovations like three dimensional-bioprinted organoids and artificial intelligence-driven personalized regimens integrating MSC-pharmacotherapy synergies exemplify the next frontier, promising scalable, precision solutions to redefine diabetes management and mitigate complications. Citation: Zuo DB, Wang CH, Sang M, Sun XD, Chen GP, Ji KK. Stem cell therapy for diabetes: Advances, prospects, and challenges. World J Diabetes 2025; 16(7): 107344 URL: https://www.wjgnet.com/1948-9358/full/v16/i7/107344.htm DOI: https://dx.doi.org/10.4239/wjd.v16.i7.107344 INTRODUCTION Diabetes mellitus has reached pandemic proportions, with global prevalence doubling from 7% to 14% among adults between 1990 and 2022, now affecting 830 million individuals worldwide [1]. Conventional therapies, including met- formin, sulfonylureas, and insulin injections, remain the standard of care[2,3]. However, they primarily alleviate sym- ptoms rather than address the disease’s fundamental pathophysiology irreversible pancreatic β-cell loss and systemic insulin resistance [4]. These treatments, through drug-mediated glucose regulation and exogenous insulin supplemen- tation, do not restore endogenous β-cell function nor prevent disease progression, leaving patients susceptible to de- bilitating complications such as retinopathy, nephropathy, and cardiovascular diseases. Stem cell therapy offers a paradigm shift by targeting these unmet needs through two complementary mechanisms: (1) Direct differentiation into glucose-responsive β-cells to replenish damaged islets[5]; and (2) Immunomodulation via paracrine signaling to suppress autoimmune destruction in type 1 diabetes mellitus (T1DM) and mitigate chronic inflam- mation in type 2 diabetes mellitus (T2DM)[6,7]. This dual capacity regenerative potential combined with microenviron- mental remodeling positions stem cells as a transformative approach for achieving sustained glycemic control and halting diabetic complications. This review critically examines recent advances in stem cell-based therapies, focusing on clinically relevant strategies using induced pluripotent stem cells (iPSCs), mesenchymal stem cells (MSCs), and bioengineered islet organoids. It also addresses ongoing challenges related to safety (tumorigenicity, immunogenicity), efficacy (cell survival, engraftment), and translational barriers (ethical and regulatory considerations), proposing integrative solutions such as combinatory therapies and artificial intelligence (AI)-driven personalized approaches. By bridging preclinical findings with clinical trial outcomes, this review aims to facilitate the transition from experimental models to practical applications in diabetes mellitus care. PRINCIPLES AND MECHANISMS OF STEM CELL THERAPY FOR DIABETES MELLITUS Diabetes mellitus comprises two distinct clinical entities: T1DM, characterized by autoimmune-mediated β-cell de- struction, and T2DM, driven by insulin resistance and progressive β-cell dysfunction[8,9]. Stem cell therapies target these divergent pathologies through three interconnected mechanisms: (1) Direct differentiation into insulin-producing β-cells; (2) Paracrine-mediated regeneration of endogenous islets; and (3) Immunomodulation to counteract autoimmune or inflammatory damage[10] (Figure 1). Stem cell differentiation into pancreatic β-cells Stem cells exhibit multi-directional differentiation potential, enabling them to transform into pancreatic β-cells under specific induction conditions. In vitro, both embryonic stem cells (ESCs) and iPSCs can be stepwise induced through"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:002", "title": "Stem Cell Therapy", "text": "endogenous islets; and (3) Immunomodulation to counteract autoimmune or inflammatory damage[10] (Figure 1). Stem cell differentiation into pancreatic β-cells Stem cells exhibit multi-directional differentiation potential, enabling them to transform into pancreatic β-cells under specific induction conditions. In vitro, both embryonic stem cells (ESCs) and iPSCs can be stepwise induced through agents such as activin A, FGF10, insulin-like growth factor-1 (IGF-1), and nicotinamide, progressing from ESC/iPSC to endoderm cells, pancreatic progenitor cells, endocrine progenitor cells, and mature pancreatic β-cells[11]. These differen- tiated β-cells closely resemble their natural counterparts in both structure and function, responding to fluctuations in blood glucose and secreting appropriate insulin amounts to regulate glucose homeostasis[12]. Paracrine-mediated islet regeneration Stem cells, particularly MSCs, secrete a range of cytokines and growth factors, including IGF-1, hepatocyte growth factor (HGF), and vascular endothelial growth factor (VEGF). (1) IGF-1 activates phosphatidylinositol 3-kinase (PI3K) and protein kinase B (AKT) signaling, inhibiting β-cell apoptosis and enhancing glucose-stimulated insulin secretion[13,14]; (2) HGF promotes β-cell proliferation through c-Met receptor activation, increasing islet mass in T2DM models[15]; and (3) VEGF induces neoangiogenesis, improving islet perfusion and oxygen/nutrient supply, preventing hypoxia-induced Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 3 July 15, 2025 Volume 16 Issue 7 Figure 1 Mechanisms of stem cell therapy for diabetes mellitus. This figure outlines the mechanisms by which stem cell therapy addresses diabetes. It includes the differentiation of stem cells into insulin-producing β-cells, paracrine effects that promote β-cell regeneration, and immunomodulation that reduces autoimmune damage and inflammation. Collectively, these processes enhance glucose regulation and facilitate pancreatic repair. ESC: Embryonic stem cells; iPSC: Induced pluripotent stem cells; MSC: Mesenchymal stem cell; T1DM: Type 1 diabetes mellitus. β-cell loss[16]. Transplantation of MSCs into diabetic rat models has been shown to stimulate pancreatic β-cell prolif- eration, enhance insulin secretion, and reduce blood glucose levels. Immunomodulation in diabetes mellitus pathogenesis In T1DM, an autoimmune condition in which the immune system attacks pancreatic β-cells, MSCs possess immunomodu- latory properties that can curb excessive immune activation, reduce autoimmune responses against β-cells, and inhibit T lymphocyte proliferation and activation. By modulating the Th1/Th2 balance, MSCs decrease Th1 cytokine secretion (e.g., interferon-γ and tumor necrosis factor- α) and increase Th2 cytokine secretion (e.g., interleukin-4 and interleukin-10), mitigating inflammation and immune-mediated damage [17]. Additionally, MSCs can promote the generation of re- gulatory T cells, which exert immunosuppressive functions, safeguarding β-cells from autoimmune attack[18,19]. Clinical studies have demonstrated that patients with T1DM receiving MSC therapy exhibit reduced autoantibody levels, diminished immune cell activation, enhanced pancreatic β-cell function, and improved glucose control[20,21]. APPLICATION OF STEM CELL THERAPY IN THE TREATMENT OF DIABETES MELLITUS Application of ESCs and iPSCs in diabetes mellitus treatment ESCs and iPSCs, with their remarkable self-renewal capacity and multilineage differentiation potential, have become critical tools in advancing diabetes mellitus therapeutics. A pivotal moment in this field occurred in 2006 when D’Amour et al[22] developed a five-step differentiation protocol to convert human ESCs into functional insulin-secreting cells capable of producing various pancreatic hormones[22], including insulin, glucagon, somatostatin, pancreatic polypeptide,"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:003", "title": "Stem Cell Therapy", "text": "multilineage differentiation potential, have become critical tools in advancing diabetes mellitus therapeutics. A pivotal moment in this field occurred in 2006 when D’Amour et al[22] developed a five-step differentiation protocol to convert human ESCs into functional insulin-secreting cells capable of producing various pancreatic hormones[22], including insulin, glucagon, somatostatin, pancreatic polypeptide, and growth hormone-releasing peptide. In vivo studies subsequently demonstrated that these cells could alleviate hyperglycemia in diabetic mouse models, marking the beginning of stem cell-based interventions in diabetes mellitus treatment. Recent breakthroughs further highlight the transformative role of ESCs and iPSCs in treating both T1DM and T2DM. For T1DM, the primary therapeutic approach focuses on differentiating ESCs/iPSCs into functional pancreatic β-cells to restore lost islet populations and endogenous insulin secretion. A landmark clinical trial by vertex pharmaceuticals (VX- 880) showcased remarkable efficacy: 90 days after a single dose of stem cell-derived islet cells, patients exhibited restored insulin production and a 91% reduction in dependence on exogenous insulin [23]. Extended phase 1/2 trial data (N- CT04786262) further substantiated these results, with 12 patients with T1DM achieving glucose-responsive insulin secretion following full-dose VX-880 infusion, and 11 participants reducing or eliminating insulin injections by 2024. Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 4 July 15, 2025 Volume 16 Issue 7 Concurrently, in China, the Peking University Stem Cell Research Center and Tianjin First Central Hospital pioneered the first chemically reprogrammed iPSC-derived islet transplantation for T1DM in 2023 (ChiCTR2300072200). The recipient achieved physiological glycemic regulation within 75 days and maintained insulin independence for over a year, marking a significant milestone toward a functional cure for T1DM[24]. In T2DM, ESC/iPSC-based therapies address two key mechanisms: Reducing insulin resistance and promoting β-cell regeneration. A groundbreaking study led by Cheng X’s team (Chinese Academy of Sciences’ Center for Excellence in Molecular Cell Science) and Yin H’s group (Shanghai Changzheng Hospital) exemplifies this strategy [25]. By tran- splanting autologous iPSC-derived regenerative islet tissue (E-islets) into a T2DM individual with pancreatic injury, they achieved sustained glycemic control, reduced reliance on exogenous insulin, and observed no tumorigenic or immuno- logical complications, as reported in Cell Discovery (2024)[25]. These findings underscore the versatility of stem cell platforms in addressing diverse diabetic pathologies. Application of MSCs in diabetes mellitus treatment MSCs, multipotent stromal cells found in adult tissues such as bone marrow, adipose tissue, umbilical cord, and placenta, have gained significant attention in diabetes mellitus therapeutics due to their low immunogenicity and potent im- munoregulatory properties. Current clinical trial registries (ClinicalTrials.gov) indicate that 63.6% (77/121) of diabetes mellitus-related stem cell interventions utilize MSCs, with umbilical cord-derived MSCs being the most common source (38 studies), followed by bone marrow (16 studies) and adipose tissue (13 studies) (Table 1). In addition to glycemic control, MSC-based therapies have shown significant efficacy in treating diabetic complications, including nephropathy, myopathy, and chronic foot ulcers. Recent research highlights that the therapeutic effects of MSCs are largely attributed to their strong immunomodu- latory functions and paracrine signaling capabilities. By migrating to damaged tissues, MSCs secrete"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:004", "title": "Stem Cell Therapy", "text": "addition to glycemic control, MSC-based therapies have shown significant efficacy in treating diabetic complications, including nephropathy, myopathy, and chronic foot ulcers. Recent research highlights that the therapeutic effects of MSCs are largely attributed to their strong immunomodu- latory functions and paracrine signaling capabilities. By migrating to damaged tissues, MSCs secrete bioactive substances, such as exosomes, VEGF, and HGF, while modulating the expression of inflammatory cytokines like interleukin-6 and tumor necrosis factor-α, thereby fostering a microenvironment conducive to tissue repair[26,27]. Although the precise mechanisms in T2DM are still under investigation, clinical evidence supports their effectiveness in both T1DM and T2DM. A meta-analysis of 13 studies involving 302 patients found that MSC treatment improved blood glucose re- gulation, with insulin requirements decreasing from approximately 0.6 to 0.4 units, and a significant reduction in glycated hemoglobin[28]. Another meta-analysis focused on diabetic foot ulcers demonstrated that stem cells were far more effective than conventional treatments, significantly improving patients’ quality of life. The stem cell-treated group showed higher ulcer and wound healing rates (201/263 cases vs 92/270 in the control group) and a significantly greater rate of neovascularization (49/92 cases vs 7/111 cases in the control group). Additionally, the amputation rate was markedly lower in the stem cell-treated group compared to the control group (13/184 cases vs 63/227 cases)[29]. Mechanistic insights and early clinical evidence Pioneering studies in 2006 revealed that MSCs exhibited tropism toward pancreatic islets and glomeruli in diabetic mice, initiating tissue repair processes [30]. Further research demonstrated that MSC-derived interleukin-1Ra inhibits in- terleukin-1 pathway activation, reversing β-cell dedifferentiation and restoring islet function in T2DM models[31]. Ad- ditional work by Khatri et al’s team confirmed MSC-mediated pancreatic regeneration in streptozotocin-challenged models, where intrapancreatic MSC administration mitigated β-cell destruction[32]. Combatting diabetic complications Vascular pathologies: Chronic hyperglycemia-induced inflammation (tumor necrosis factor- α, interleukin-6) and oxidative stress are key drivers of both macrovascular (e.g., atherosclerosis) and microvascular (e.g., nephropathy) complications. A 2024 multicenter trial (NCT01719640) involving 97 patients with T2DM demonstrated that combined bone marrow MSC/mononuclear cell therapy resulted in a 50.6% increase in C-peptide levels. An 8-year follow-up revealed significantly reduced macrovascular (13.8% vs 44.8% in the control group) and neuropathic complications (10.3% vs 48.3% in the control group)[33-35]. Diabetic foot ulcers: MSC administration, whether via local injection or intravascular delivery, enhances wound healing by activating PI3K/AKT and mitogen-activated protein kinase/extracellular regulated protein kinases (ERK) pathways, promoting epithelialization and angiogenesis. A cohort study involving five groups with 216 participants confirmed the efficacy of MSCs in promoting ulcer healing. The bone marrow-MSC group achieved 100% ulcer healing significantly faster than the bone marrow-mononuclear cells group within 6 weeks following cell therapy. Additionally, bone marrow- MSC therapy demonstrated superior safety and tolerance, as well as enhanced efficacy in improving lower limb perfusion and foot ulcer healing in diabetic patients with severe limb ischemia, compared to bone marrow-mononuclear cells therapy. Data indicate that MSCs derived from bone marrow and adipose tissue achieved an 88% success rate in treating diabetic foot ulcers, highlighting the safety and effectiveness of MSC"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:005", "title": "Stem Cell Therapy", "text": "in improving lower limb perfusion and foot ulcer healing in diabetic patients with severe limb ischemia, compared to bone marrow-mononuclear cells therapy. Data indicate that MSCs derived from bone marrow and adipose tissue achieved an 88% success rate in treating diabetic foot ulcers, highlighting the safety and effectiveness of MSC transplantation in preventing limb amputations[36, 37]. Diabetic nephropathy: Six registered clinical trials investigate the use of MSCs in treating renal complications. MSCs mitigate renal fibrosis through Smad2/3 pathway inhibition and by secreting VEGF/HGF, which improves microcircu- lation. Their anti-inflammatory action includes downregulation of monocyte chemoattractant protein-1 and M2 ma- crophage polarization, leading to a reduction in interleukin-1 β/interleukin-6/tumor necrosis factor- α levels [38-40]. Additionally, exosome-mediated modulation of the extracellular matrix further delays the progression of fibrosis[41,42]. A 2024 case report from Pakistan American Hospital documented the successful improvement of a patient’s renal con- dition using umbilical cord-derived Wharton’s jelly MSCs and exosomes, further supporting the clinical translatability of Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 5 July 15, 2025 Volume 16 Issue 7 Table 1 Clinical trials of mesenchymal stem cell-based stem cell therapies for diabetes Clinical trials MSCs source Diabetes Type 1 diabetes Type 2 diabetes Diabetic foot Diabetic nephropathy Others Umbilical cord-derived MSCs NCT04972890 NCT05631444 NCT06751199 NCT02579148 NCT01143168 NCT01219465 NCT01374854 NCT03484741 NCT05003908 NCT06407297 NCT01142050 NCT01413035 NCT01954147 NCT02302599 NCT02886884 NCT02945449 NCT03751735 NCT04441658 NCT04501341 NCT05507697 NCT06727721 NCT02672280 NCT06373809 NCT01216865 NCT02834858 NCT04104451 NCT04464213 NCT06231771 NCT06812637 NCT03288571 NCT04125329 NCT04562025 NCT04216849 NCT02745808 NCT02763423 Bone marrow-derived MSCs NCT02387749 NCT01157403 NCT03361631 NCT02893306 NCT04078308 NCT00644241 NCT01694173 NCT01719640 NCT01759823 NCT03343782 NCT03943940 NCT01686139 NCT00955669 NCT02796079 NCT03248466 NCT05783115 Adipose-derived MSCs NCT01257776 NCT02940418 NCT03920397 NCT05308836 NCT06605508 NCT03259217 NCT05610865 NCT03865394 NCT03916211 NCT04466007 NCT05595681 NCT04869761 NCT03840343 MSCs from other sources NCT02384018 NCT01496339 NCT06003530 Unknown origin MSCs NCT04776239 NCT00646724 NCT01068951 NCT02057211 NCT04061746 NCT01322789 NCT01786707 NCT02286128 NCT02304588 MSC: Mesenchymal stem cell. this approach[43]. Application of stem cell-derived exosomes in diabetes mellitus Stem cell-derived exosomes, a subset of extracellular vesicles (30 nm-150 nm in diameter) enclosed by lipid bilayers, have emerged as a promising cell-free therapeutic strategy for diabetes mellitus and its complications. These nanoscale particles retain the reparative properties of their parental MSCs while bypassing immunogenicity concerns due to the absence of intact cellular components. Their cargo, which includes proteins, lipids, and regulatory RNAs, allows for precise modulation of target cell activity through membrane fusion or endocytosis[44]. This combination of biocompa- tibility and functional versatility positions exosomes as effective mediators in diabetic wound healing, retinopathy management, and metabolic regulation. In diabetic wound repair, exosomes counteract hyperglycemia-induced impairments through multiple mechanisms. Local administration of placental MSC-derived exosomes accelerates wound closure by enriching miR-145-5p, which suppresses cyclin-dependent kinase inhibitor 1A, activating Erk/Akt signaling pathways to enhance fibroblast prolif- eration, migration, and apoptosis resistance[45]. Additionally, exosome-mediated adenosine 5’-monophosphate-activated protein kinase /ULK1 autophagy induction alleviates muscle atrophy, while the coordinated suppression of oxidative stress and inflammation, in combination with angiogenesis and collagen remodeling, helps restore tissue integrity[46,47]. Preclinical studies further highlight reduced scar width and accelerated epithelial regeneration in animal models, supporting their translational"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:006", "title": "Stem Cell Therapy", "text": "resistance[45]. Additionally, exosome-mediated adenosine 5’-monophosphate-activated protein kinase /ULK1 autophagy induction alleviates muscle atrophy, while the coordinated suppression of oxidative stress and inflammation, in combination with angiogenesis and collagen remodeling, helps restore tissue integrity[46,47]. Preclinical studies further highlight reduced scar width and accelerated epithelial regeneration in animal models, supporting their translational potential. Exosome therapy also holds promise for diabetic retinopathy, where MSC-derived small extracellular vesicles (MSC- sEVs) mitigate retinal neurodegeneration and pathological angiogenesis. Under hyperglycemic conditions, hypoxia inducible factor (HIF)-1α stabilization inhibits EZH2 degradation, leading to peroxisome proliferator-activated receptor- gamma coactivator (PGC)-1α suppression via methylation, which worsens retinal dysfunction. MSC-sEVs counteract this cascade by delivering miR-5068 and miR-10228, which disrupt the HIF-1α/EZH2/PGC-1α signaling pathway. Intravitreal injection of MSC-sEVs in db/db mice and streptozotocin-induced diabetic rats restores retinal function, reduces apoptosis, and alleviates inflammatory infiltration and abnormal neovascularization[48]. Despite these advances, the clinical translation of exosome therapies faces several challenges. First, the standardization and quality control of exosome production remain imperfect, which could affect the stability and reproducibility of their efficacy [49]. Second, the short in vivo stability and half-life of exosomes may limit their long-term effectiveness [50]. Furthermore, while exosomes generally exhibit low immunogenicity, their long-term safety and potential immune response risks remain uncertain due to the complexity of clinical applications and individual variability. Therefore, Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 6 July 15, 2025 Volume 16 Issue 7 comprehensive, large-scale, multi-center, long-term clinical trials are essential to assess and verify the safety and efficacy of exosome-based therapies in clinical practice. CHALLENGES IN STEM CELL THERAPY FOR DIABETES MELLITUS Safety issues Despite the transformative potential of stem cell therapy in diabetes mellitus management, safety concerns especially tumorigenicity and immunogenicity remain significant barriers to clinical implementation. PSCs, including ESCs and iPSCs, inherently pose oncogenic risks due to their unchecked proliferative capacity. Transplanting insufficiently differ- entiated ESCs or iPSCs increases the likelihood of tumor formation[51]. To mitigate these risks, multi-faceted strategies are necessary, including clustered regularly interspaced short palindromic repeats (CRISPR)-mediated knockout of oncogenes (e.g., MYC), optimized reprogramming techniques to minimize epigenetic alterations, and rigorous post- transplant monitoring through circulating tumor DNA assays[52-54]. In contrast, clinical data from 62 studies involving 3546 patients indicate that mesoderm-derived MSCs do not exhibit significant adverse reactions during treatment[55]. Only a few patients experienced mild side effects, such as fever and constipation, suggesting that MSCs present a relatively low tumorigenic risk in clinical applications. Immunogenicity presents another challenge. Allogeneic ESCs, carrying foreign human leukocyte antigen (HLA) haplotypes, trigger robust host immune rejection, while autologous iPSCs although theoretically immune-compatible may acquire immunogenic neo-antigens during reprogramming due to dysregulated gene expression (e.g., aberrant activation of endogenous retroviruses) [56]. MSCs, however, display inherent immune privilege through low major histocompatibility complex (MHC)-II expression, though their immunogenicity can increase with prolonged in vitro passaging or exposure to inflammatory cytokines (e.g., interferon-γ), as evidenced by the upregulation of MHC levels in bone marrow-derived MSCs under pro-inflammatory conditions. Moreover, source-dependent variability exists: Um- bilical cord MSCs maintain stable low"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:007", "title": "Stem Cell Therapy", "text": "through low major histocompatibility complex (MHC)-II expression, though their immunogenicity can increase with prolonged in vitro passaging or exposure to inflammatory cytokines (e.g., interferon-γ), as evidenced by the upregulation of MHC levels in bone marrow-derived MSCs under pro-inflammatory conditions. Moreover, source-dependent variability exists: Um- bilical cord MSCs maintain stable low immunogenicity across passages, while adipose-derived and bone marrow-derived MSCs may exhibit higher immunogenicity[57-60]. Current strategies to overcome immune rejection present practical limitations. Autologous iPSC-derived islet tran- splantation, while avoiding HLA mismatch, is cost-prohibitive and technically complex, restricting its scalability [61]. Allogeneic approaches, such as VX-880, combine HLA-matched donor cells with immunosuppressants (e.g., tacrolimus/ mammalian target of rapamycin inhibitors), but long-term immunosuppression raises infection risks and exacerbates diabetic nephropathy [62-64]. Emerging solutions involve CRISPR-based engineering to delete immunogenic loci (e.g., B2M knockout) and introduce immune checkpoint regulators (e.g., programmed cell death ligand 1 overexpression), which could protect MSC-derived islet β-cells from graft rejection in diabetes mellitus treatment without the need for adjunctive immunosuppression [65,66]. Encapsulation technologies, like Vertex’s VX-264 (NCT05791201), provide phy- sical immunoisolation for transplanted islet cells, though this approach prioritizes insulin secretion over the intrinsic regenerative functions of stem cells a trade-off that may limit efficacy, particularly in treating T2DM and microvascular complications. Efficacy challenges The clinical efficacy of stem cell therapy in diabetes mellitus is contingent upon three interdependent factors: Post- transplantation cell survival, homing efficiency to target tissues, and the functional potency of engrafted cells. Upon administration, exogenous stem cells whether insulin-producing β-cell progenitors or immunomodulatory MSCs are immediately subjected to immune surveillance. Research indicates that a significant proportion of MSCs perish within one day of transplantation in mice, with the surviving cells almost entirely disappearing within 11 days[67]. This attrition is further aggravated by metabolic stressors: Hyperoxic in vitro culture conditions predispose cells to oxidative damage, while hypoxic diabetic microenvironments trigger mitochondrial dysfunction and caspase-3 activation[68]. Strategies to enhance cell survival include CRISPR-mediated overexpression of anti-apoptotic genes, such as Bcl2[69-71], and au- tologous cell sourcing to reduce immune recognition. The homing efficiency of stem cells relies on precise interactions with damaged tissues through various cytokines and signaling pathways. Suboptimal homing efficiency limits the therapeutic potential of stem cells in diabetes mellitus treatment. Currently, the mechanisms governing stem cell homing remain incompletely understood, hindering the accurate targeting of the pancreas and injured tissues. The expression of chemokines or their receptors can significantly enhance homing efficacy. For instance, overexpression of CCR2 in MSCs substantially improves their immunomodulatory activity and migratory ability. Intravenously infused MSC-CCR2 exhibits enhanced homing to the lungs and injured tissues, thereby accelerating tissue repair in diabetic wounds[72,73]. Additionally, the CCR4 and stromal cell-derived factor-1 (SDF-1) chemokine pairs hold promise for further optimization. In diabetic mice, damaged islet tissues secrete SDF-1, and MSCs expressing CXCR4 respond to this gradient, migrating toward the damaged islet tissues through cytoskeletal rearrangement and chemotaxis. MSCs expressing CXCR4, or local injection of SDF-1, significantly improve the homing efficiency of MSCs to islet tissues[74,75]. Genetic engineering of stem cells offers a promising"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:008", "title": "Stem Cell Therapy", "text": "damaged islet tissues secrete SDF-1, and MSCs expressing CXCR4 respond to this gradient, migrating toward the damaged islet tissues through cytoskeletal rearrangement and chemotaxis. MSCs expressing CXCR4, or local injection of SDF-1, significantly improve the homing efficiency of MSCs to islet tissues[74,75]. Genetic engineering of stem cells offers a promising approach to overcoming their inherent therapeutic limitations. While native MSCs primarily exert paracrine immunomodulation, insulin-secreting variants generated via PDX1/ NEUROG3 transduction exhibit physiologic glucose responsiveness in primate models [76,77]. Additionally, overex- pression of angiopoietin-1 in MSCs has been shown to significantly enhance the survival of human umbilical vein endothelial cells, promote tubule formation, and activate Akt, thereby driving angiogenesis and accelerating wound healing in diabetic mouse models[78]. Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 7 July 15, 2025 Volume 16 Issue 7 However, individual differences play a pivotal role in determining the effectiveness of stem cell therapies. Factors such as age, baseline health status, and genetic background of both stem cell donors and patients can alter the in vivo microen- vironment, subsequently affecting stem cell survival, differentiation, and functionality [79-81]. For example, elderly patients may provide a suboptimal environment for stem cell survival due to age-related declines in physiological functions, while patients with specific genetic profiles may exhibit varying immune responses to stem cells, resulting in diverse therapeutic outcomes. Ethical and regulatory challenges The translation of stem cell therapies into clinical practice is hindered by complex ethical and regulatory challenges, particularly in relation to pluripotent cell sources. Despite its transformative potential in diabetes mellitus treatment, ESC research remains entangled in ethical debates due to the inherent requirement for embryo destruction. Germany’s Embryo Protection Act (1991) illustrates stringent regulations prohibiting the derivation of human ESCs, reflecting widespread concerns about the commodification of embryos, a risk that intensifies when using surplus in vitro fertil- ization embryos or tissues derived from abortions for cell line development [82]. This ethical dilemma has prompted a shift toward alternative sources of pluripotent cells, such as iPSCs, which are reprogrammed from somatic cells without involving embryos, thereby sidestepping the moral issues associated with ESC use[83]. In parallel, MSCs, sourced from bone marrow, umbilical cord, or adipose tissue, have gained prominence due to their non-controversial procurement. However, ethical considerations remain regarding donor consent and material traceability. For example, clinical samples, such as bone marrow aspirates, require documented consent for secondary research use, with strict protocols governing the disposal of biological materials at each phase of clinical trials. Regulatory fragmentation further complicates the development of stem cell-based therapies. As of 2025, only a few countries have implemented dedicated frameworks for stem cell product manufacturing, leading to inconsistent quality control standards for critical processes, such as cryopreservation (-196 °C liquid nitrogen 2 storage) and viral vector testing. A unified and comprehensive quality assessment system is essential to ensure clinical safety. Currently, global regulatory policies for stem cell therapies vary widely, with inconsistent standards posing significant obstacles to the conduct of clinical trials, the approval process, and"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:009", "title": "Stem Cell Therapy", "text": "cryopreservation (-196 °C liquid nitrogen 2 storage) and viral vector testing. A unified and comprehensive quality assessment system is essential to ensure clinical safety. Currently, global regulatory policies for stem cell therapies vary widely, with inconsistent standards posing significant obstacles to the conduct of clinical trials, the approval process, and the commercialization of stem cell-based treatments. TECHNOLOGICAL BREAKTHROUGHS AND FUTURE DEVELOPMENT PATHWAYS IN STEM CELL THERAPY FOR DIABETES MELLITUS Technological innovations and breakthroughs in stem cell therapy Recent advancements in stem cell therapy for diabetes mellitus are fueled by innovations in cell sourcing, genetic engineering, and biohybrid technologies. The discovery of novel stem cell sources, such as amniotic stem cells, presents distinct advantages for clinical translation, owing to their low immunogenicity and cost-effective isolation methods, which significantly reduce the risk of immune rejection [84]. Similarly, urine-derived stem cells offer a non-invasive alternative for autologous therapies, circumventing ethical concerns while retaining differentiation potential[85]. Gene-editing technologies are reshaping therapeutic strategies by enhancing functional precision. Targeted modific- ations allow for the deletion of tumorigenic genes and the insertion of anti-apoptotic or insulin-secretory pathways, thereby improving both safety profiles and glucose-regulatory efficacy. For example, CRISPR-mediated knockout of HLA class I genes in iPSCs reduces graft rejection, while overexpression of PDX1 increases β-cell differentiation efficiency[66]. The integration of tissue engineering with stem cell technology provides additional innovative solutions. Techniques such as three-dimensional (3D) printing and microfluidics enable the creation of bio-scaffolds with precise architectures, creating optimal environments for stem cell growth and differentiation. Microfluidic systems allow for precise spa- tiotemporal control over growth factor gradients (e.g., Wnt and FGF families), directing stem cells toward glucose- responsive islet organoids that mimic native pancreatic structures[86,87]. Advances in 3D printing have also facilitated the delivery of stem cells encapsulated in hydrogels and other nanomaterials, enhancing transplantation efficiency and cell survival. For instance, dual-network micro-fibrous encapsulation using alginate and hyaluronic acid methacrylate protects pancreatic α-cells and β-cells, preserving their bioactivity and supporting effective nutrient and metabolite exchange[88]. Bioengineered scaffolds also enable localized stem cell delivery: GelMA hydrogels protect adipose-derived stem cells from hyperglycemic stress while promoting angiogenesis in chronic wounds [89,90], while dual-network microfibers sustain β-cell viability through optimized nutrient exchange[91]. Collectively, these innovations represent a multidisciplinary approach to overcoming current challenges related to scalability, efficacy, and safety[92]. Combined treatment strategies The synergistic integration of stem cell therapy with conventional glucose-lowering medications and immunosuppressive regimens represents a transformative approach to diabetes mellitus management. Combining MSCs with pharmaco- logical agents such as insulin, metformin, or glucagon-like peptide-1 receptor agonists achieves dual therapeutic goals: Rapid glycemic stabilization through drug-mediated metabolic control and long-term β-cell regeneration via stem cell- driven restoration and immunomodulation [93]. In T1DM, where extensive β-cell destruction leads to severe insulin deficiency, concurrent stem cell transplantation and insulin therapy offer significant clinical benefits. This strategy reduces exogenous insulin dependence and mitigates adverse effects of intensive insulin regimens, such as hypoglycemia and weight gain. Moreover, combining MSCs with anti-diabetic drugs holds promise for treating complications like diabetic foot ulcers and"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:010", "title": "Stem Cell Therapy", "text": "severe insulin deficiency, concurrent stem cell transplantation and insulin therapy offer significant clinical benefits. This strategy reduces exogenous insulin dependence and mitigates adverse effects of intensive insulin regimens, such as hypoglycemia and weight gain. Moreover, combining MSCs with anti-diabetic drugs holds promise for treating complications like diabetic foot ulcers and nephropathy, where stem cells promote tissue repair and pharmacological agents correct systemic Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 8 July 15, 2025 Volume 16 Issue 7 metabolic imbalances. Immunosuppressant co-administration plays a vital role in optimizing outcomes for β-cell or islet transplantation, particularly in autoimmune-mediated T1DM. While MSCs naturally suppress inflammatory responses through the paracrine secretion of anti-inflammatory cytokines, adjunctive immunosuppressants, such as tacrolimus or myco- phenolate mofetil, provide further protection against residual autoimmune attacks on transplanted cells. Clinical evidence indicates that this combinatorial approach significantly enhances graft survival, improves β-cell function, and stabilizes glycemic variability, thereby reducing the incidence of acute metabolic complications. Personalized treatment strategies The advent of precision medicine has accelerated the development of patient-tailored stem cell therapies, addressing the inherent variability in treatment responses caused by differences in stem cell sources, culture protocols, and patient profiles. Personalized strategies leverage comprehensive datasets, including genetic predispositions, epigenetic modific- ations, disease progression markers, and comorbidities to optimize therapeutic precision. AI algorithms analyze these multidimensional datasets to predict individual responses to specific stem cell lineages or differentiation protocols, enabling clinicians to customize interventions based on factors like age, sex, disease severity, and complication profiles. For example, machine learning models trained on longitudinal clinical data can identify optimal timing and dosage regimens for MSC administration, maximizing engraftment efficiency while minimizing off-target effects. Advances in gene-editing technologies further refine personalized approaches by correcting diabetes mellitus- associated genetic mutations (e.g., monogenic defects in maturity-onset diabetes of the young subtypes) or engineering stem cells to express patient-specific immune tolerance markers. Simultaneously, bioinformatics tools elucidate the molecular pathways underlying stem cell-mediated β-cell regeneration, enabling the selection of targeted therapeutic modalities. AI-driven predictive analytics also enhance risk stratification by integrating real-time continuous glucose monitoring data with histocompatibility profiles, facilitating preemptive adjustments to treatment plans. This shift towards individualized therapy not only improves clinical outcomes but also streamlines healthcare resource allocation by reducing trial-and-error inefficiencies. CONCLUSION Stem cell-based therapies have the potential to transform diabetes mellitus management through mechanisms such as β- cell differentiation, endogenous regeneration, and immunomodulation. Although preclinical studies and early-phase clinical trials yield promising results, progress toward clinical implementation is still hindered by challenges, including tumorigenicity risks, variable therapeutic efficacy, immune rejection, and evolving regulatory frameworks. Overcoming these challenges will require innovations in cell engineering, biomaterial science, and quality control protocols. Emerging technologies, such as CRISPR-based gene editing, 3D-bioprinted tissue constructs, and AI-optimized combinatorial regimens, are well-positioned to address current obstacles, paving the way for standardized, scalable therapeutic platforms. As research deepens our understanding of stem cell biology and patient-specific disease mechanisms, these therapies are expected to transition from experimental approaches to mainstream clinical solutions, providing durable, precision-targeted strategies"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:011", "title": "Stem Cell Therapy", "text": "tissue constructs, and AI-optimized combinatorial regimens, are well-positioned to address current obstacles, paving the way for standardized, scalable therapeutic platforms. As research deepens our understanding of stem cell biology and patient-specific disease mechanisms, these therapies are expected to transition from experimental approaches to mainstream clinical solutions, providing durable, precision-targeted strategies for managing diabetes mellitus and its complications. ACKNOWLEDGEMENTS The authors would like to express their gratitude to the First People’s Hospital of Xiangyang City and the People’s Hospital of Binhai County, which provided the clinical research platform. FOOTNOTES Author contributions: Ji KK and Chen GP conceived and designed the review; Zuo DB and Wang CH wrote the manuscript with the assistance of other co-authors; Sang M and Sun XD gave critical views about this theme; Ji KK and Zuo DB contributed to the manuscript revision and guidance; All authors have read and approved the final manuscript. Supported by the Faculty Development Grants of Xiangyang No. 1 People’s Hospital Affiliated to Hubei University of Medicine, No. XYY2025D05, No. 2024QDJZR037 and No. 2024QDJZR015. Conflict-of-interest statement: The authors declare that they have no conflict of interest. Open Access: This article is an open-access article that was selected by an in-house editor and fully peer-reviewed by external reviewers. It is distributed in accordance with the Creative Commons Attribution NonCommercial (CC BY-NC 4.0) license, which permits others to distribute, remix, adapt, build upon this work non-commercially, and license their derivative works on different terms, provided the original work is properly cited and the use is non-commercial. See: https://creativecommons.org/Licenses/by-nc/4.0/ Country of origin: China Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 9 July 15, 2025 Volume 16 Issue 7 ORCID number: Kang-Kang Ji 0009-0006-9711-4873. S-Editor: Fan M L-Editor: A P-Editor: Xu ZH REFERENCES 1 NCD Risk Factor Collaboration (NCD-RisC). Worldwide trends in diabetes prevalence and treatment from 1990 to 2022: a pooled analysis of 1108 population-representative studies with 141 million participants. Lancet 2024; 404: 2077-2093 [PMID: 39549716 DOI: 10.1016/S0140-6736(24)02317-1] [FullText] 2 Hirsch IB, Pihoker C, Roberts A, Zenno A, Le P, Lawrence JM, Casagrande SS, Herman WH, Wexler DJ, Cefalu WT. Medication Use and Self-Care Practices in Persons With Diabetes. In: Diabetes in America [Internet]. Bethesda (MD): National Institute of Diabetes and Digestive and Kidney Diseases (NIDDK); 2023– [PMID: 39298640] [FullText] 3 Zahid M, Dowlatshahi S, Kansara AH, Sadhu AR. The Evolution of Diabetes Technology - Options Toward Personalized Care. Endocr Pract 2023; 29: 653-662 [PMID: 37100350 DOI: 10.1016/j.eprac.2023.04.007] [FullText] 4 Karwasra R, Sharma S, Sharma I, Shahid N, Umar T. Diabetology and Nanotechnology: A Compelling Combination. Recent Pat Nanotechnol 2025; 19: 4-16 [PMID: 37937555 DOI: 10.2174/0118722105253055231016155618] [FullText] 5 Yamanaka S. Pluripotent Stem Cell-Based Cell Therapy-Promise and Challenges. Cell Stem Cell 2020; 27: 523-531 [PMID: 33007237 DOI: 10.1016/j.stem.2020.09.014] [FullText] 6 Li H, Zhu H, Ge T, Wang Z, Zhang C. Mesenchymal Stem Cell-Based Therapy for Diabetes Mellitus: Enhancement Strategies and Future Perspectives. Stem Cell Rev Rep 2021; 17: 1552-1569 [PMID: 33675006 DOI: 10.1007/s12015-021-10139-5] [FullText] 7 Maestas MM, Bui MH, Millman JR. Recent progress"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:012", "title": "Stem Cell Therapy", "text": "523-531 [PMID: 33007237 DOI: 10.1016/j.stem.2020.09.014] [FullText] 6 Li H, Zhu H, Ge T, Wang Z, Zhang C. Mesenchymal Stem Cell-Based Therapy for Diabetes Mellitus: Enhancement Strategies and Future Perspectives. Stem Cell Rev Rep 2021; 17: 1552-1569 [PMID: 33675006 DOI: 10.1007/s12015-021-10139-5] [FullText] 7 Maestas MM, Bui MH, Millman JR. Recent progress in modeling and treating diabetes using stem cell-derived islets. Stem Cells Transl Med 2024; 13: 949-958 [PMID: 39159002 DOI: 10.1093/stcltm/szae059] [FullText] 8 Bluestone JA, Herold K, Eisenbarth G. Genetics, pathogenesis and clinical interventions in type 1 diabetes. Nature 2010; 464: 1293-1300 [PMID: 20432533 DOI: 10.1038/nature08933] [FullText] 9 Stumvoll M, Goldstein BJ, van Haeften TW. Type 2 diabetes: principles of pathogenesis and therapy. Lancet 2005; 365: 1333-1346 [PMID: 15823385 DOI: 10.1016/S0140-6736(05)61032-X] [FullText] 10 Sneddon JB, Tang Q, Stock P, Bluestone JA, Roy S, Desai T, Hebrok M. Stem Cell Therapies for Treating Diabetes: Progress and Remaining Challenges. Cell Stem Cell 2018; 22: 810-823 [PMID: 29859172 DOI: 10.1016/j.stem.2018.05.016] [FullText] 11 Millman JR, Xie C, Van Dervort A, Gürtler M, Pagliuca FW, Melton DA. Generation of stem cell-derived β-cells from patients with type 1 diabetes. Nat Commun 2016; 7: 11463 [PMID: 27163171 DOI: 10.1038/ncomms11463] [FullText] 12 Hogrebe NJ, Ishahak M, Millman JR. Developments in stem cell-derived islet replacement therapy for treating type 1 diabetes. Cell Stem Cell 2023; 30: 530-548 [PMID: 37146579 DOI: 10.1016/j.stem.2023.04.002] [FullText] 13 Boumaza I, Srinivasan S, Witt WT, Feghali-Bostwick C, Dai Y, Garcia-Ocana A, Feili-Hariri M. Autologous bone marrow-derived rat mesenchymal stem cells promote PDX-1 and insulin expression in the islets, alter T cell cytokine pattern and preserve regulatory T cells in the periphery and induce sustained normoglycemia. J Autoimmun 2009; 32: 33-42 [PMID: 19062254 DOI: 10.1016/j.jaut.2008.10.004] [FullText] 14 Dong Z, Fu Y, Cai Z, Dai H, He Y. Recent advances in adipose-derived mesenchymal stem cell-derived exosomes for regulating macrophage polarization. Front Immunol 2025; 16: 1525466 [PMID: 39963133 DOI: 10.3389/fimmu.2025.1525466] [FullText] 15 Oliveira AG, Araújo TG, Carvalho BM, Rocha GZ, Santos A, Saad MJA. The Role of Hepatocyte Growth Factor (HGF) in Insulin Resistance and Diabetes. Front Endocrinol (Lausanne) 2018; 9: 503 [PMID: 30214428 DOI: 10.3389/fendo.2018.00503] [FullText] 16 Yang J, Chen Z, Pan D, Li H, Shen J. Umbilical Cord-Derived Mesenchymal Stem Cell-Derived Exosomes Combined Pluronic F127 Hydrogel Promote Chronic Diabetic Wound Healing and Complete Skin Regeneration. Int J Nanomedicine 2020; 15: 5911-5926 [PMID: 32848396 DOI: 10.2147/IJN.S249129] [FullText] 17 Li A, Guo F, Pan Q, Chen S, Chen J, Liu HF, Pan Q. Mesenchymal Stem Cell Therapy: Hope for Patients With Systemic Lupus Erythematosus. Front Immunol 2021; 12: 728190 [PMID: 34659214 DOI: 10.3389/fimmu.2021.728190] [FullText] 18 Luz-Crawford P, Kurte M, Bravo-Alegría J, Contreras R, Nova-Lamperti E, Tejedor G, Noël D, Jorgensen C, Figueroa F, Djouad F, Carrión F. Mesenchymal stem cells generate a CD4+CD25+Foxp3+ regulatory T cell population during the differentiation process of Th1 and Th17 cells. Stem Cell Res Ther 2013; 4: 65 [PMID: 23734780 DOI: 10.1186/scrt216] [FullText] 19 Kawada-Horitani E, Kita S, Okita T, Nakamura Y, Nishida H, Honma Y, Fukuda S, Tsugawa-Shimizu Y, Kozawa J, Sakaue T,"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:013", "title": "Stem Cell Therapy", "text": "cells generate a CD4+CD25+Foxp3+ regulatory T cell population during the differentiation process of Th1 and Th17 cells. Stem Cell Res Ther 2013; 4: 65 [PMID: 23734780 DOI: 10.1186/scrt216] [FullText] 19 Kawada-Horitani E, Kita S, Okita T, Nakamura Y, Nishida H, Honma Y, Fukuda S, Tsugawa-Shimizu Y, Kozawa J, Sakaue T, Kawachi Y, Fujishima Y, Nishizawa H, Azuma M, Maeda N, Shimomura I. Human adipose-derived mesenchymal stem cells prevent type 1 diabetes induced by immune checkpoint blockade. Diabetologia 2022; 65: 1185-1197 [PMID: 35511238 DOI: 10.1007/s00125-022-05708-3] [Full Text] 20 Izadi M, Sadr Hashemi Nejad A, Moazenchi M, Masoumi S, Rabbani A, Kompani F, Hedayati Asl AA, Abbasi Kakroodi F, Jaroughi N, Mohseni Meybodi MA, Setoodeh A, Abbasi F, Hosseini SE, Moeini Nia F, Salman Yazdi R, Navabi R, Hajizadeh-Saffar E, Baharvand H. Mesenchymal stem cell transplantation in newly diagnosed type-1 diabetes patients: a phase I/II randomized placebo-controlled clinical trial. Stem Cell Res Ther 2022; 13: 264 [PMID: 35725652 DOI: 10.1186/s13287-022-02941-w] [FullText] 21 Hu J, Yu X, Wang Z, Wang F, Wang L, Gao H, Chen Y, Zhao W, Jia Z, Yan S, Wang Y. Long term effects of the implantation of Wharton's jelly-derived mesenchymal stem cells from the umbilical cord for newly-onset type 1 diabetes mellitus. Endocr J 2013; 60: 347-357 [PMID: 23154532 DOI: 10.1507/endocrj.ej12-0343] [FullText] 22 D'Amour KA, Bang AG, Eliazer S, Kelly OG, Agulnick AD, Smart NG, Moorman MA, Kroon E, Carpenter MK, Baetge EE. Production of pancreatic hormone-expressing endocrine cells from human embryonic stem cells. Nat Biotechnol 2006; 24: 1392-1401 [PMID: 17053790 DOI: 10.1038/nbt1259] [FullText] 23 Vertex snaps up diabetes stem cell rival. Nat Biotechnol 2022; 40: 1161 [PMID: 35945441 DOI: 10.1038/s41587-022-01443-7] [FullText] Wang S, Du Y, Zhang B, Meng G, Liu Z, Liew SY, Liang R, Zhang Z, Cai X, Wu S, Gao W, Zhuang D, Zou J, Huang H, Wang M, Wang X, 24 Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 10 July 15, 2025 Volume 16 Issue 7 Wang X, Liang T, Liu T, Gu J, Liu N, Wei Y, Ding X, Pu Y, Zhan Y, Luo Y, Sun P, Xie S, Yang J, Weng Y, Zhou C, Wang Z, Wang S, Deng H, Shen Z. Transplantation of chemically induced pluripotent stem-cell-derived islets under abdominal anterior rectus sheath in a type 1 diabetes patient. Cell 2024; 187: 6152-6164.e18 [PMID: 39326417 DOI: 10.1016/j.cell.2024.09.004] [FullText] 25 Wu J, Li T, Guo M, Ji J, Meng X, Fu T, Nie T, Wei T, Zhou Y, Dong W, Zhang M, Shi Y, Cheng X, Yin H; Clinical Group. Treating a type 2 diabetic patient with impaired pancreatic islet function by personalized endoderm stem cell-derived islet tissue. Cell Discov 2024; 10: 45 [PMID: 38684699 DOI: 10.1038/s41421-024-00662-3] [FullText] 26 Fu X, Liu G, Halim A, Ju Y, Luo Q, Song AG. Mesenchymal Stem Cell Migration and Tissue Repair. Cells 2019; 8: 784 [PMID: 31357692 DOI: 10.3390/cells8080784] [FullText] 27 Ling L, Feng X, Wei T, Wang Y, Wang Y, Wang Z, Tang D, Luo Y, Xiong Z. Human amnion-derived"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:014", "title": "Stem Cell Therapy", "text": "26 Fu X, Liu G, Halim A, Ju Y, Luo Q, Song AG. Mesenchymal Stem Cell Migration and Tissue Repair. Cells 2019; 8: 784 [PMID: 31357692 DOI: 10.3390/cells8080784] [FullText] 27 Ling L, Feng X, Wei T, Wang Y, Wang Y, Wang Z, Tang D, Luo Y, Xiong Z. Human amnion-derived mesenchymal stem cell (hAD-MSC) transplantation improves ovarian function in rats with premature ovarian insufficiency (POI) at least partly through a paracrine mechanism. Stem Cell Res Ther 2019; 10: 46 [PMID: 30683144 DOI: 10.1186/s13287-019-1136-x] [FullText] 28 Habiba UE, Khan N, Greene DL, Ahmad K, Shamim S, Umer A. Meta-analysis shows that mesenchymal stem cell therapy can be a possible treatment for diabetes. Front Endocrinol (Lausanne) 2024; 15: 1380443 [PMID: 38800472 DOI: 10.3389/fendo.2024.1380443] [FullText] 29 Sun Y, Zhao J, Zhang L, Li Z, Lei S. Effectiveness and safety of stem cell therapy for diabetic foot: a meta-analysis update. Stem Cell Res Ther 2022; 13: 416 [PMID: 35964145 DOI: 10.1186/s13287-022-03110-9] [FullText] 30 Lee RH, Seo MJ, Reger RL, Spees JL, Pulin AA, Olson SD, Prockop DJ. Multipotent stromal cells from human marrow home to and promote repair of pancreatic islets and renal glomeruli in diabetic NOD/scid mice. Proc Natl Acad Sci U S A 2006; 103: 17438-17443 [PMID: 17088535 DOI: 10.1073/pnas.0608249103] [FullText] 31 Wang L, Liu T, Liang R, Wang G, Liu Y, Zou J, Liu N, Zhang B, Liu Y, Ding X, Cai X, Wang Z, Xu X, Ricordi C, Wang S, Shen Z. Mesenchymal stem cells ameliorate β cell dysfunction of human type 2 diabetic islets by reversing β cell dedifferentiation. EBioMedicine 2020; 51: 102615 [PMID: 31918404 DOI: 10.1016/j.ebiom.2019.102615] [FullText] 32 Khatri R, Petry SF, Linn T. Intrapancreatic MSC transplantation facilitates pancreatic islet regeneration. Stem Cell Res Ther 2021; 12: 121 [PMID: 33579357 DOI: 10.1186/s13287-021-02173-4] [FullText] 33 Yuan T, Yang T, Chen H, Fu D, Hu Y, Wang J, Yuan Q, Yu H, Xu W, Xie X. New insights into oxidative stress and inflammation during diabetes mellitus-accelerated atherosclerosis. Redox Biol 2019; 20: 247-260 [PMID: 30384259 DOI: 10.1016/j.redox.2018.09.025] [FullText] 34 Weinberg Sibony R, Segev O, Dor S, Raz I. Overview of oxidative stress and inflammation in diabetes. J Diabetes 2024; 16: e70014 [PMID: 39435991 DOI: 10.1111/1753-0407.70014] [FullText] 35 Wu Z, Huang S, Li S, Cai J, Huang L, Wu W, Chen J, Tan J. Bone marrow mesenchymal stem cell and mononuclear cell combination therapy in patients with type 2 diabetes mellitus: a randomized controlled study with 8-year follow-up. Stem Cell Res Ther 2024; 15: 339 [PMID: 39350270 DOI: 10.1186/s13287-024-03907-w] [FullText] 36 Liu Y, Chen J, Liang H, Cai Y, Li X, Yan L, Zhou L, Shan L, Wang H. Human umbilical cord-derived mesenchymal stem cells not only ameliorate blood glucose but also protect vascular endothelium from diabetic damage through a paracrine mechanism mediated by MAPK/ ERK signaling. Stem Cell Res Ther 2022; 13: 258 [PMID: 35715841 DOI: 10.1186/s13287-022-02927-8] [FullText] 37 Nalisa DL, Moneruzzaman M, Changwe GJ, Mobet Y, Li LP, Ma YJ, Jiang HW. Stem Cell Therapy for Diabetic Foot Ulcers: Theory"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:015", "title": "Stem Cell Therapy", "text": "protect vascular endothelium from diabetic damage through a paracrine mechanism mediated by MAPK/ ERK signaling. Stem Cell Res Ther 2022; 13: 258 [PMID: 35715841 DOI: 10.1186/s13287-022-02927-8] [FullText] 37 Nalisa DL, Moneruzzaman M, Changwe GJ, Mobet Y, Li LP, Ma YJ, Jiang HW. Stem Cell Therapy for Diabetic Foot Ulcers: Theory and Practice. J Diabetes Res 2022; 2022: 6028743 [PMID: 36524153 DOI: 10.1155/2022/6028743] [FullText] 38 Shi Y, Wang Y, Li Q, Liu K, Hou J, Shao C, Wang Y. Immunoregulatory mechanisms of mesenchymal stem and stromal cells in inflammatory diseases. Nat Rev Nephrol 2018; 14: 493-507 [PMID: 29895977 DOI: 10.1038/s41581-018-0023-5] [FullText] 39 Xiang E, Han B, Zhang Q, Rao W, Wang Z, Chang C, Zhang Y, Tu C, Li C, Wu D. Human umbilical cord-derived mesenchymal stem cells prevent the progression of early diabetic nephropathy through inhibiting inflammation and fibrosis. Stem Cell Res Ther 2020; 11: 336 [PMID: 32746936 DOI: 10.1186/s13287-020-01852-y] [FullText] 40 Zhang Y, Le X, Zheng S, Zhang K, He J, Liu M, Tu C, Rao W, Du H, Ouyang Y, Li C, Wu D. MicroRNA-146a-5p-modified human umbilical cord mesenchymal stem cells enhance protection against diabetic nephropathy in rats through facilitating M2 macrophage polarization. Stem Cell Res Ther 2022; 13: 171 [PMID: 35477552 DOI: 10.1186/s13287-022-02855-7] [FullText] 41 Ji C, Zhang J, Shi H, Chen B, Xu W, Jin J, Qian H. Single-cell RNA transcriptomic reveal the mechanism of MSC derived small extracellular vesicles against DKD fibrosis. J Nanobiotechnology 2024; 22: 339 [PMID: 38890734 DOI: 10.1186/s12951-024-02613-2] [FullText] 42 Bai Y, Huang L, Fan Y, Li Y. Marrow mesenchymal stem cell mediates diabetic nephropathy progression via modulation of Smad2/3/WTAP/ m6A/ENO1 axis. FASEB J 2024; 38: e23729 [PMID: 38847786 DOI: 10.1096/fj.202301773R] [FullText] 43 Habiba UE, Greene DL, Ahmad K, Shamim S, Khan N, Umer A. Case Report: Allogenic Wharton's jelly mesenchymal stem cell and exosome therapy are safe and effective for diabetic kidney failure. F1000Res 2024; 13: 379 [DOI: 10.12688/f1000research.146671.1] [FullText] 44 Zhang Z, Mi T, Jin L, Li M, Zhanghuang C, Wang J, Tan X, Lu H, Shen L, Long C, Wei G, He D. Comprehensive proteomic analysis of exosome mimetic vesicles and exosomes derived from human umbilical cord mesenchymal stem cells. Stem Cell Res Ther 2022; 13: 312 [PMID: 35841000 DOI: 10.1186/s13287-022-03008-6] [FullText] 45 Su J, Wei Q, Ma K, Wang Y, Hu W, Meng H, Li Q, Zhang Y, Zhang W, Li H, Fu X, Zhang C. P-MSC-derived extracellular vesicles facilitate diabetic wound healing via miR-145-5p/ CDKN1A-mediated functional improvements of high glucose-induced senescent fibroblasts. Burns Trauma 2023; 11: tkad010 [PMID: 37860579 DOI: 10.1093/burnst/tkad010] [FullText] 46 Song J, Liu J, Cui C, Hu H, Zang N, Yang M, Yang J, Zou Y, Li J, Wang L, He Q, Guo X, Zhao R, Yan F, Liu F, Hou X, Sun Z, Chen L. Mesenchymal stromal cells ameliorate diabetes-induced muscle atrophy through exosomes by enhancing AMPK/ULK1-mediated autophagy. J Cachexia Sarcopenia Muscle 2023; 14: 915-929 [PMID: 36708027 DOI: 10.1002/jcsm.13177] [FullText] 47 Li Y, Zhu Z, Li S, Xie X, Qin L, Zhang Q,"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:016", "title": "Stem Cell Therapy", "text": "Zhao R, Yan F, Liu F, Hou X, Sun Z, Chen L. Mesenchymal stromal cells ameliorate diabetes-induced muscle atrophy through exosomes by enhancing AMPK/ULK1-mediated autophagy. J Cachexia Sarcopenia Muscle 2023; 14: 915-929 [PMID: 36708027 DOI: 10.1002/jcsm.13177] [FullText] 47 Li Y, Zhu Z, Li S, Xie X, Qin L, Zhang Q, Yang Y, Wang T, Zhang Y. Exosomes: compositions, biogenesis, and mechanisms in diabetic wound healing. J Nanobiotechnology 2024; 22: 398 [PMID: 38970103 DOI: 10.1186/s12951-024-02684-1] [FullText] 48 Sun F, Sun Y, Wang X, Zhu J, Chen S, Yu Y, Zhu M, Xu W, Qian H. Engineered mesenchymal stem cell-derived small extracellular vesicles for diabetic retinopathy therapy through HIF-1α/EZH2/PGC-1α pathway. Bioact Mater 2024; 33: 444-459 [PMID: 38076648 DOI: 10.1016/j.bioactmat.2023.11.008] [FullText] 49 Koritzinsky EH, Street JM, Star RA, Yuen PS. Quantification of Exosomes. J Cell Physiol 2017; 232: 1587-1590 [PMID: 27018079 DOI: 10.1002/jcp.25387] [FullText] 50 Choi H, Choi Y, Yim HY, Mirzaaghasi A, Yoo JK, Choi C. Biodistribution of Exosomes and Engineering Strategies for Targeted Delivery of Therapeutic Exosomes. Tissue Eng Regen Med 2021; 18: 499-511 [PMID: 34260047 DOI: 10.1007/s13770-021-00361-0] [FullText] Han L, He H, Yang Y, Meng Q, Ye F, Chen G, Zhang J. Distinctive Clinical and Pathologic Features of Immature Teratomas Arising from 51 Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 11 July 15, 2025 Volume 16 Issue 7 Induced Pluripotent Stem Cell-Derived Beta Cell Injection in a Diabetes Patient. Stem Cells Dev 2022; 31: 97-101 [PMID: 35018826 DOI: 10.1089/scd.2021.0255] [FullText] 52 Bs S, Kh C, Bc T. Ensuring Safety in Stem Cell Therapies: A Review of Tumorigenic Risks and Mitigation Strategies. 2024 Preprint [DOI: 10.20944/preprints202409.0136.v1] [FullText] 53 Balboa D, Otonkoski T. Human pluripotent stem cell based islet models for diabetes research. Best Pract Res Clin Endocrinol Metab 2015; 29: 899-909 [PMID: 26696518 DOI: 10.1016/j.beem.2015.10.012] [FullText] 54 Qin Y, Sun J, Xie MF. [Research Progress in Induced Pluripotent Stem Cell Neoplasia]. Linchuang Yixue Jinzhan 2024; 14: 105-110 [DOI: 10.12677/acm.2024.143672] [FullText] 55 Wang Y, Yi H, Song Y. The safety of MSC therapy over the past 15 years: a meta-analysis. Stem Cell Res Ther 2021; 12: 545 [PMID: 34663461 DOI: 10.1186/s13287-021-02609-x] [FullText] 56 Cerneckis J, Cai H, Shi Y. Induced pluripotent stem cells (iPSCs): molecular mechanisms of induction and applications. Signal Transduct Target Ther 2024; 9: 112 [PMID: 38670977 DOI: 10.1038/s41392-024-01809-0] [FullText] 57 Li Y, Jin M, Guo D, Shen S, Lu K, Pan R, Sun L, Zhang H, Shao J, Pan G. Unveiling the immunogenicity of allogeneic mesenchymal stromal cells: Challenges and strategies for enhanced therapeutic efficacy. Biomed Pharmacother 2024; 180: 117537 [PMID: 39405918 DOI: 10.1016/j.biopha.2024.117537] [FullText] 58 Petrenko Y, Vackova I, Kekulova K, Chudickova M, Koci Z, Turnovcova K, Kupcova Skalnikova H, Vodicka P, Kubinova S. A Comparative Analysis of Multipotent Mesenchymal Stromal Cells derived from Different Sources, with a Focus on Neuroregenerative Potential. Sci Rep 2020; 10: 4290 [PMID: 32152403 DOI: 10.1038/s41598-020-61167-z] [FullText] 59 Tan K, Zheng K, Li D, Lu H, Wang S, Sun X. Impact of adipose tissue or umbilical cord derived mesenchymal"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:017", "title": "Stem Cell Therapy", "text": "A Comparative Analysis of Multipotent Mesenchymal Stromal Cells derived from Different Sources, with a Focus on Neuroregenerative Potential. Sci Rep 2020; 10: 4290 [PMID: 32152403 DOI: 10.1038/s41598-020-61167-z] [FullText] 59 Tan K, Zheng K, Li D, Lu H, Wang S, Sun X. Impact of adipose tissue or umbilical cord derived mesenchymal stem cells on the immunogenicity of human cord blood derived endothelial progenitor cells. PLoS One 2017; 12: e0178624 [PMID: 28562647 DOI: 10.1371/journal.pone.0178624] [FullText] 60 Li J, Xu SQ, Zhao YM, Yu S, Ge LH, Xu BH. Comparison of the biological characteristics of human mesenchymal stem cells derived from exfoliated deciduous teeth, bone marrow, gingival tissue, and umbilical cord. Mol Med Rep 2018; 18: 4969-4977 [PMID: 30272340 DOI: 10.3892/mmr.2018.9501] [FullText] 61 Madrid M, Sumen C, Aivio S, Saklayen N. Autologous Induced Pluripotent Stem Cell-Based Cell Therapies: Promise, Progress, and Challenges. Curr Protoc 2021; 1: e88 [PMID: 33725407 DOI: 10.1002/cpz1.88] [FullText] 62 Borges VF, Galant LS, Kanashiro A, Castanheira FVES, Monteiro VVS, Duarte DÂ, Rodrigues FC, Silva CMS, Schneider AH, Cebinelli GCM, de Lima MHF, Viola JPB, Cunha TM, da Costa Neto CM, Alves-Filho JCF, Pupo AS, Cunha FQ. FK506 impairs neutrophil migration that results in increased polymicrobial sepsis susceptibility. Inflamm Res 2023; 72: 203-215 [PMID: 36401631 DOI: 10.1007/s00011-022-01669-w] [FullText] 63 Lipsitz J, Chowdary AR, Tsai P, Quigley R. Paxlovid-induced tacrolimus toxicity in a 16-year-old male with steroid-resistant nephrotic syndrome. Pediatr Nephrol 2025 [PMID: 39998631 DOI: 10.1007/s00467-025-06686-5] [FullText] 64 Fotino N, Fotino C, Pileggi A. Re-engineering islet cell transplantation. Pharmacol Res 2015; 98: 76-85 [PMID: 25814189 DOI: 10.1016/j.phrs.2015.02.010] [FullText] 65 Santini-González J, Castro-Gutierrez R, Becker MW, Rancourt C, Russ HA, Phelps EA. Human stem cell derived beta-like cells engineered to present PD-L1 improve transplant survival in NOD mice carrying human HLA class I. Front Endocrinol (Lausanne) 2022; 13: 989815 [PMID: 36506044 DOI: 10.3389/fendo.2022.989815] [FullText] 66 Parent AV, Faleo G, Chavez J, Saxton M, Berrios DI, Kerper NR, Tang Q, Hebrok M. Selective deletion of human leukocyte antigens protects stem cell-derived islets from immune rejection. Cell Rep 2021; 36: 109538 [PMID: 34407395 DOI: 10.1016/j.celrep.2021.109538] [FullText] 67 Yu S, Yu S, Liu H, Liao N, Liu X. Enhancing mesenchymal stem cell survival and homing capability to improve cell engraftment efficacy for liver diseases. Stem Cell Res Ther 2023; 14: 235 [PMID: 37667383 DOI: 10.1186/s13287-023-03476-4] [FullText] 68 Noronha NC, Mizukami A, Caliári-Oliveira C, Cominal JG, Rocha JLM, Covas DT, Swiech K, Malmegrim KCR. Priming approaches to improve the efficacy of mesenchymal stromal cell-based therapies. Stem Cell Res Ther 2019; 10: 131 [PMID: 31046833 DOI: 10.1186/s13287-019-1224-y] [FullText] 69 Hyun J, Grova M, Nejadnik H, Lo D, Morrison S, Montoro D, Chung M, Zimmermann A, Walmsley GG, Lee M, Daldrup-Link H, Wan DC, Longaker MT. Enhancing in vivo survival of adipose-derived stromal cells through Bcl-2 overexpression using a minicircle vector. Stem Cells Transl Med 2013; 2: 690-702 [PMID: 23934910 DOI: 10.5966/sctm.2013-0035] [FullText] 70 Liu W, Yue W, Wu R. Overexpression of Bcl-2 promotes survival and differentiation of neuroepithelial stem cells after transplantation into rat aganglionic colon. Stem"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:018", "title": "Stem Cell Therapy", "text": "vivo survival of adipose-derived stromal cells through Bcl-2 overexpression using a minicircle vector. Stem Cells Transl Med 2013; 2: 690-702 [PMID: 23934910 DOI: 10.5966/sctm.2013-0035] [FullText] 70 Liu W, Yue W, Wu R. Overexpression of Bcl-2 promotes survival and differentiation of neuroepithelial stem cells after transplantation into rat aganglionic colon. Stem Cell Res Ther 2013; 4: 7 [PMID: 23324128 DOI: 10.1186/scrt155] [FullText] 71 Zhang J, Hirst AJ, Duan F, Qiu H, Huang R, Ji Y, Bai L, Zhang F, Robinson D, Jones M, Li L, Wang P, Jiang P, Andrews PW, Barbaric I, Na J. Anti-apoptotic Mutations Desensitize Human Pluripotent Stem Cells to Mitotic Stress and Enable Aneuploid Cell Survival. Stem Cell Reports 2019; 12: 557-571 [PMID: 30773485 DOI: 10.1016/j.stemcr.2019.01.013] [FullText] 72 Xu R, Ni B, Wang L, Shan J, Pan L, He Y, Lv G, Lin H, Chen W, Zhang Q. CCR2-overexpressing mesenchymal stem cells targeting damaged liver enhance recovery of acute liver failure. Stem Cell Res Ther 2022; 13: 55 [PMID: 35123561 DOI: 10.1186/s13287-022-02729-y] [Full Text] 73 Kuang S, He F, Liu G, Sun X, Dai J, Chi A, Tang Y, Li Z, Gao Y, Deng C, Lin Z, Xiao H, Zhang M. CCR2-engineered mesenchymal stromal cells accelerate diabetic wound healing by restoring immunological homeostasis. Biomaterials 2021; 275: 120963 [PMID: 34153785 DOI: 10.1016/j.biomaterials.2021.120963] [FullText] 74 Shi M, Li J, Liao L, Chen B, Li B, Chen L, Jia H, Zhao RC. Regulation of CXCR4 expression in human mesenchymal stem cells by cytokine treatment: role in homing efficiency in NOD/SCID mice. Haematologica 2007; 92: 897-904 [PMID: 17606439 DOI: 10.3324/haematol.10669] [FullText] 75 Mayorga ME, Kiedrowski M, McCallinhart P, Forudi F, Ockunzzi J, Weber K, Chilian W, Penn MS, Dong F. Role of SDF-1:CXCR4 in Impaired Post-Myocardial Infarction Cardiac Repair in Diabetes. Stem Cells Transl Med 2018; 7: 115-124 [PMID: 29119710 DOI: 10.1002/sctm.17-0172] [FullText] 76 Wu C, Liu F, Li P, Zhao G, Lan S, Jiang W, Meng X, Tian L, Li G, Li Y, Liu JY. Engineered hair follicle mesenchymal stem cells overexpressing controlled-release insulin reverse hyperglycemia in mice with type L diabetes. Cell Transplant 2015; 24: 891-907 [PMID: 24835482 DOI: 10.3727/096368914X681919] [FullText] Milanesi A, Lee JW, Li Z, Da Sacco S, Villani V, Cervantes V, Perin L, Yu JS. β-Cell regeneration mediated by human bone marrow 77 Zuo DB et al. Stem cell therapy for diabetes WJD https://www.wjgnet.com 12 July 15, 2025 Volume 16 Issue 7 mesenchymal stem cells. PLoS One 2012; 7: e42177 [PMID: 22879915 DOI: 10.1371/journal.pone.0042177] [FullText] 78 Deng Q, Du F, Pan S, Xia Y, Zhu Y, Zhang J, Li C, Yu S. Activation of angiopoietin-1 signaling with engineering mesenchymal stem cells promoted efficient angiogenesis in diabetic wound healing. Stem Cell Res Ther 2025; 16: 75 [PMID: 39985096 DOI: 10.1186/s13287-025-04207-7] [FullText] 79 Carp DM, Liang Y. Universal or Personalized Mesenchymal Stem Cell Therapies: Impact of Age, Sex, and Biological Source. Cells 2022; 11: 2077 [PMID: 35805161 DOI: 10.3390/cells11132077] [FullText] 80 Fernández-Santos ME, Garcia-Arranz M, Andreu EJ, García-Hernández AM, López-Parra M, Villarón E, Sepúlveda P, Fernández-Avilés F, García-Olmo"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:019", "title": "Stem Cell Therapy", "text": "39985096 DOI: 10.1186/s13287-025-04207-7] [FullText] 79 Carp DM, Liang Y. Universal or Personalized Mesenchymal Stem Cell Therapies: Impact of Age, Sex, and Biological Source. Cells 2022; 11: 2077 [PMID: 35805161 DOI: 10.3390/cells11132077] [FullText] 80 Fernández-Santos ME, Garcia-Arranz M, Andreu EJ, García-Hernández AM, López-Parra M, Villarón E, Sepúlveda P, Fernández-Avilés F, García-Olmo D, Prosper F, Sánchez-Guijo F, Moraleda JM, Zapata AG. Optimization of Mesenchymal Stromal Cell (MSC) Manufacturing Processes for a Better Therapeutic Outcome. Front Immunol 2022; 13: 918565 [PMID: 35812460 DOI: 10.3389/fimmu.2022.918565] [Full Text] 81 Ikebe C, Suzuki K. Mesenchymal stem cells for regenerative therapy: optimization of cell preparation protocols. Biomed Res Int 2014; 2014: 951512 [PMID: 24511552 DOI: 10.1155/2014/951512] [FullText] 82 Golchin A, Chatziparasidou A, Ranjbarvan P, Niknam Z, Ardeshirylajimi A. Embryonic Stem Cells in Clinical Trials: Current Overview of Developments and Challenges. Adv Exp Med Biol 2021; 1312: 19-37 [PMID: 33159303 DOI: 10.1007/5584_2020_592] [FullText] 83 Aboul-Soud MAM, Alzahrani AJ, Mahmoud A. Induced Pluripotent Stem Cells (iPSCs)-Roles in Regenerative Therapies, Disease Modelling and Drug Screening. Cells 2021; 10: 2319 [PMID: 34571968 DOI: 10.3390/cells10092319] [FullText] 84 Loukogeorgakis SP, De Coppi P. Concise Review: Amniotic Fluid Stem Cells: The Known, the Unknown, and Potential Regenerative Medicine Applications. Stem Cells 2017; 35: 1663-1673 [PMID: 28009066 DOI: 10.1002/stem.2553] [FullText] 85 Yin X, Li Q, Shu Y, Wang H, Thomas B, Maxwell JT, Zhang Y. Exploiting urine-derived induced pluripotent stem cells for advancing precision medicine in cell therapy, disease modeling, and drug testing. J Biomed Sci 2024; 31: 47 [PMID: 38724973 DOI: 10.1186/s12929-024-01035-4] [FullText] 86 Liu X, Yu Y, Liu D, Li J, Sun J, Wei Q, Zhao Y, Pandol SJ, Li L. Porous microcapsules encapsulating β cells generated by microfluidic electrospray technology for diabetes treatment. NPG Asia Mater 2022; 14: 39 [DOI: 10.1038/s41427-022-00385-5] [FullText] 87 Li J, Zhang H, Sun L, Fan L, Fu X, Liu X, Liu D, Wei Q, Zhao Y, Pandol SJ, Li L. Porous microcarriers with pancreatic β cell aggregates loading for diabetic care. Chem Eng J 2022; 436: 135174 [DOI: 10.1016/j.cej.2022.135174] [FullText] 88 Jiang L, Shen Y, Liu Y, Zhang L, Jiang W. Making human pancreatic islet organoids: Progresses on the cell origins, biomaterials and three- dimensional technologies. Theranostics 2022; 12: 1537-1556 [PMID: 35198056 DOI: 10.7150/thno.66670] [FullText] 89 Yang J, Yan Y, Yin X, Liu X, Reshetov IV, Karalkin PA, Li Q, Huang RL. Bioengineering and vascularization strategies for islet organoids: advancing toward diabetes therapy. Metabolism 2024; 152: 155786 [PMID: 38211697 DOI: 10.1016/j.metabol.2024.155786] [FullText] 90 Xia S, Weng T, Jin R, Yang M, Yu M, Zhang W, Wang X, Han C. Curcumin-incorporated 3D bioprinting gelatin methacryloyl hydrogel reduces reactive oxygen species-induced adipose-derived stem cell apoptosis and improves implanting survival in diabetic wounds. Burns Trauma 2022; 10: tkac001 [PMID: 35291229 DOI: 10.1093/burnst/tkac001] [FullText] 91 Huan Z, Li J, Guo J, Yu Y, Li L. Pancreatic islet cells in microfluidic-spun hydrogel microfibers for the treatment of diabetes. Acta Biomater 2024; 187: 149-160 [PMID: 39222705 DOI: 10.1016/j.actbio.2024.08.047] [FullText] 92 Sun J, Li J, Huan Z, Pandol SJ, Liu D, Shang L, Li"}
{"doc_id": "Stem_Cell_Therapy", "page": 0, "chunk_id": "Stem_Cell_Therapy:020", "title": "Stem Cell Therapy", "text": "DOI: 10.1093/burnst/tkac001] [FullText] 91 Huan Z, Li J, Guo J, Yu Y, Li L. Pancreatic islet cells in microfluidic-spun hydrogel microfibers for the treatment of diabetes. Acta Biomater 2024; 187: 149-160 [PMID: 39222705 DOI: 10.1016/j.actbio.2024.08.047] [FullText] 92 Sun J, Li J, Huan Z, Pandol SJ, Liu D, Shang L, Li L. Mesenchymal Stem Cell‐Laden Composite β Cell Porous Microgel for Diabetes Treatment. Adv Funct Materials 2023; 33 [DOI: 10.1002/adfm.202211897] [FullText] 93 Arte PA, Tungare K, Bhori M, Jobby R, Aich J. Treatment of type 2 diabetes mellitus with stem cells and antidiabetic drugs: a dualistic and future-focused approach. Hum Cell 2024; 37: 54-84 [PMID: 38038863 DOI: 10.1007/s13577-023-01007-0] [FullText] Published by Baishideng Publishing Group Inc 7041 Koll Center Parkway, Suite 160, Pleasanton, CA 94566, USA Telephone: +1-925-3991568 E-mail: office@baishideng.com Help Desk: https://www.f6publishing.com/helpdesk https://www.wjgnet.com © 2025 Baishideng Publishing Group Inc. All rights reserved."}
